<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>
  
  <meta http-equiv="content-type" content="text/html; charset=UTF-8">



  
  <title>Informa&ccedil;&otilde;es de contato</title>


  
  <meta name="description" content="Contact netbeans.org">


  
  <meta name="NAV_LINK" content="Contact">


  
  <meta name="NAV_PRIORITY" content="9">


  
  <link rel="stylesheet" type="text/css" href="../netbeans.css">


</head><body>

<h1>Contatar a equipe do NetBeans <br>
</h1>



<p>H&aacute; algumas maneiras de entrar em contado com a equipe do NetBeans. Leia esta p&aacute;gina com cuidado para asegurar que voc&ecirc; envie sua consulta para o canal apropriado.<br>
</p>



<h2>Suporte e uso do NetBeans</h2>



<p>
Dirija <span style="font-weight: bold;">todas </span><strong>as perguntas relativas ao uso e suporte</strong> do NetBeans IDE e Plataforma para a lista de correio p&uacute;bica ou f&oacute;rum <strong>nbusers@netbeans.org</strong>. Voc&ecirc; precisa <a href="../community/lists/top.html">se inscever na lista/f&oacute;rum para postar perguntas</a>.
  <br>
</p>


<p>
</p>

<div class="rarticle"><div class="ml15"><a href="http://forums.netbeans.org/">F&oacute;runs de Suporte do NetBeans</a> e <a href="../community/lists/top.html">Listas de Correio</a><br>
</div>

<div class="rarticle"><div class="ml15"><a href="https://netbeans.org/kb/support.html">P&aacute;gina de Suporte do NetBeans</a><br>
</div>

<div class="rarticle">
<div class="ml15"><a href="http://www.oracle.com/us/support/development-tools-080025.html">Suporte da Oracle para o NetBeans IDE</a></div>
</div>



<h2>Relat&oacute;ris de bugs, solicita&ccedil;&otilde;es de recursos e aprimoramentos</h2>

<p>
Para reportar um bug no NetBeans IDE, <a href="../community/issues.html">registre uma quest&atilde;o</a>. Caso voc&ecirc; tenha solicita&ccedil;&otilde;es de recurso ou aprimoramento, recomendamos que pergunte primeiro na <a href="../community/lists/top.html">lista de correio nbusers</a> para avaliar se sua id&eacute;ia &eacute; vi&aacute;vel, suportada por outros e se algum outro desenvolvedor j&aacute; n&atilde;o est&aacute; trabalhando no assunto.  
</p>

<div class="rarticle">
<div class="ml15"><a href="https://netbeans.org/bugzilla/query.cgi?format=advanced">Pesquisa nas quest&otilde;es existentes</a> para verificar se sua quest&atilde;o j&aacute; foi reportada.</div>
</div>
<p>
</p>
<div class="rarticle">
<div class="ml15"><a href="../community/issues.html">Registrar um relat&oacute;rio de novo bug ou uma solicita&ccedil;&atilde;o de aprimoramento</a></div>
</div>



<h2>Not&iacute;cias</h2>

<p>
Voc&ecirc; liberou um plug-in do NetBeans ou um aplicativo com base na Plataforma NetBeans? Soube de uma confer&ecirc;ncia ou evento que possa ser do interesse dos usu&aacute;rios do NetBeans? Envie suas not&iacute;cias para a <a href="/community/news/newsletter/index.html">Newsletter do NetBeans</a>!</p>

<p>
</p>
<div class="rarticle">
  <div class="ml15"><p><a href="mailto:nbnews_contrib@netbeans.org">Envie um item de not&iacute;cia para os editores do NetBeans Weekly<br>
</a></p>
</div></div>



<h2>Webmaster</h2>

<p>Caso haja problemas com sua conta do NetBeans.org, downloads ou links quebrados, imagens ou p&aacute;ginas da Web n&atilde;o apropriadamente exibidas, quest&otilde;es com o conte&uacute;do do site da Web ou sugest&otilde;es apara aprimoramentos do site da Web:</p>
<p>
</p>
<div class="rarticle">
  <div class="ml15"><p><a href="https://netbeans.org/about/contact_form.html?to=1">Contate o Webmaster do NetBeans</a>
</p></div></div>



<h2>Licenciamento, Consultas confidenciais</h2>

<p>
Para perguntas sobre a distribui&ccedil;&atilde;o do Softwareg NetBeans, do SPL ou outras quest&otilde;es relativas a licen&ccedil;a, leia primeiro nossa p&aacute;gina <a href="http://wiki.netbeans.org/wiki/view/NetBeansUserFAQ#section-NetBeansUserFAQ-Licence">FAQs de Licen&ccedil;a</a>. Se as informa&ccedil;&otilde;es n&atilde;o respondem suas perguntas:</p>
<p>
</p>
<div class="rarticle">
  <div class="ml15"><p><a href="https://netbeans.org/about/contact_form.html?to=2">Contate a Equipe de Gerenciamento do Produto NetBeans</a>
</p></div></div>



</div></div>
</body></html>