<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">


<title>Um breve hist&oacute;rico do NetBeans</title>
<meta name="description" content="A brief history of the NetBeans Platform/IDE/Open source project">
<meta name="NAV_LINK" content="History">
<link rel="stylesheet" type="text/css" href="../netbeans.css">
    <script src="http://static.simile.mit.edu/timeline/api-2.3.0/timeline-api.js?bundle=true" type="text/javascript"></script>
</head><body>
<h1>Um breve hist&oacute;rico do NetBeans</h1>

    <p align="center">
    </p><div id="my-timeline" style="border: 1px solid rgb(170, 170, 170); margin: 0px 20px; height: 150px;"></div>
    <noscript>
      Esta p&aacute;gina usa o Javascript para mostrar-lhe um mapa do caminho. Ative o Javascript em seu navegador para ver toda a p&aacute;gina. Obrigado.
    </noscript>
    <script type="text/javascript">
      var tl;
      $(function(){
        var eventSource = new Timeline.DefaultEventSource();
        var bandInfos = [
          Timeline.createBandInfo({
            startDate:      "Jan 01 1999 00:00:00 GMT",
            endDate:        "Dec 01 2020 00:00:00 GMT",
            eventSource:    eventSource,
            width:          "70%",
            intervalUnit:   Timeline.DateTime.MONTH,
            intervalPixels: 25
          }),
          Timeline.createBandInfo({
            startDate:      "Jan 01 1999 00:00:00 GMT",
            endDate:        "Dec 01 2020 00:00:00 GMT",
            eventSource:    eventSource,
            overview:       true,
            width:          "30%",
            intervalUnit:   Timeline.DateTime.YEAR,
            intervalPixels: 80
          })
        ];
        bandInfos[1].syncWith = 0;
        bandInfos[1].highlight = true;
        tl = Timeline.create(document.getElementById("my-timeline"), bandInfos);
        tl.loadXML("./netbeans-timeline.xml?"+(new Date().getTime()), function(xml, url) { eventSource.loadXML(xml, url); });

      });
    </script>
    <br>

<p>
<br>
O NetBeans come&ccedil;ou como um projeto estudantil (originalmente denominado Xelfi) na Rep&uacute;blica Tcheca em 1996. O objetivo era escrever um Java IDE similar ao Delphi no Java. O Xelfi foi o promeiro Java IDE (Ambiente Integrado de Desenvovimento) escrito em Java, com sua pr&eacute;-vers&otilde;es em 1997.  
</p><p>O Xelfi foi um projeto divertido no qual trabalhar, especialmente porque o espa&ccedil;o Java IDE era um territ&oacute;rio inexplorado naquela &eacute;poca. O projeto atraiu nastante interesse por estes estudantes, e quando se graduaram, decidiram que o poderiam o comercializar como um produto comercial. Pedindo recuros de amigos e parentes para um espa&ccedil;o na Web, eles formaram uma empresa em torno do mesmo.<br>
</p><p>Logo depois, eles foram contratados por <a href="http://www.google.com/search?q=roman+stanek&amp;hl=en&amp;lr=&amp;c2coff=1&amp;client=safari&amp;rls=en&amp;start=10&amp;sa=N">Roman Stanek</a>, um empreeendedor que j&aacute; tinha se envolvido em diversas empresas embrion&aacute;rias na Rep&uacute;blica Tcheca. Ele estava procurando por uma boa id&eacute;ia na qual investir e descobriu o Xelfi. Ele se encontrou com os fundadores, eles se entenderam, e nascia um neg&oacute;cio.
</p>
<p>
O plano de neg&oacute;cios original era o de desenvolver componentes Java ativados para rede. Jarda Tulach, que projetou a arquitetura b&aacute;sica do IDE, teve a id&eacute;ia do nome <i>Net</i>Beans,para descrever o que os componentes fariam. O IDE seria o meio para entregar os mesmos. Quando a especifica&ccedil;&atilde;o para o Enterprise Java Beans surgiu, fez mais sentido trabalhar com o padr&atilde;o para tais componentes do que competir com ele- mas o nome colou.
</p>
<p>
Na primavera de 1999, o <a href="http://www.internetnews.com/dev-news/article.php/75561"> NetBeans DeveloperX2</a> foi lan&ccedil;ado, suportando o Swing. Os aprimoramentos no desempenho vindos com o JDK 1.3, lan&ccedil;ado no outono de 1999, tornou o NetBeans uma escolha vi&aacute;vel para ferramentas de desenvolvimento. No ver&atilde;o de 1999, a equeipe estava trabalhando duro em rearquitetar o DeveloperX2 para o NetBeans mais modular que forma a base do software hoje.
</p><p>
Algo mais estava surgindo no ver&atilde;o de 1999: a <a href="http://www.sun.com">Sun Microsystems</a> queria ter melhores ferramentas de desenvolvimento Java e se interessou pelo NetBeans. Era um sonho se tornando realidade para a equipe do NetBeans: o NetBeans iria se tornar o conjunto de ferramentas estrela do pr&oacute;prio criador do Java! No outono, com a pr&oacute;xima gera&ccedil;&atilde;o do NetBeans Developer em beta, uma negocia&ccedil;&atilde;o foi obtida. A Sun Microsystems tamb&eacute;m adquiriu uma outra empresa de ferramentas, a Fort&eacute;, ao mesmo tempo, e decidiu renomear o NetBeans como <span style="font-style: italic;">Fort&eacute; para Java</span>. O nome <span style="font-style: italic;">NetBeans</span> foi relegado- por um tempo.
</p><p>Durante a aquisi&ccedil;&atilde;o, os jovens desenvolvedores que tinham estado envolvidos em projetos de c&oacute;digo-fonte aberto na maioria de suas carreiras de programa&ccedil;&atilde;o, mencionaram a id&eacute;ia de tornar o NetBeans em c&oacute;digo-fonte aberto. Movendo r&aacute;pido adiante menos de seis meses depois, foi tomada decis&atilde;o que o NetBeans seria de c&oacute;digo-fonte aberto. Embora a Sun tenha contribu&iacute;do com consider&aacute;vel quantidade de c&oacute;digo para projetos de c&oacute;digo-fonte aberto ao longo dos anos, este foi o primeiro projeto de c&oacute;digo-fonte aberto <i>patrocinado</i> pela Sun, um projeto para o qual a Sun pagaria pelo site e pelo manuseio da infraestrutura. A primeira decis&atilde;o tomada foi a de que era l&oacute;gico chamar o novo site de: netbeans.org. Em Junho de 2000, <a href="http://web.archive.org/web/20000815061212/https://netbeans.org/index.html">o site da Web inicial netbeans.org</a> foi lan&ccedil;ado.<br>
<br>


</p><h2>A Plataforma</h2>Ao longo do tempo, aconteceu uma coisa interessante: as pessoas come&ccedil;aram a desenvolver aplicativos usando o execut&aacute;vel n&uacute;celo do NetBeans e seus pr&oacute;prios plug-ins de applicativos que n&atilde;o eram de fato ferramentas de desenvolvimento. De fato, isso acabou por se tornar um bom mercado. Em 2000 e 2001, bastante trabalho foi feito para retirar partes que faziam a suposi&ccedil;&atilde;o de um aplicativo desenvolvido no NetBeans era um IDE, para que a plataforma fosse um aplicativo de desktop adequado para qualquer prop&oacute;sito. Esse trabalho tamb&eacute;m see tornou saud&aacute;vel para a base de c&oacute;digo do IDE, encorajando um projeto de API limpo e uma separa&ccedil;&atilde;o de preocupa&ccedil;&otilde;es.<br>
<br>
<h2>Os primeiros anos<br>
</h2>
<p>Um projeto de c&oacute;digo-fonte aberto &eacute; uma entidade viva que precisa de tempo para encontrar o equil&iacute;brio correto de pessoas e contribui&ccedil;&otilde;es. Seu crescimento &eacute; sempre um processo cont&iacute;nuo. No primeiro ano (at&eacute; o NetBeans 3.2), o projeto dispendeu tempo para encontrar-se. Os pr&oacute;ximos poucos anos envolveram o aprendizado sobre o que funcionaria em termos de processos de c&oacute;digo-fonte aberto. (Nos primeiros dois anos, o processo de desenvolvimento era t&atilde;o aberto que mais tempo foi gasto para debater do que para implementar. </p>
<p>Mas as dores do crescimento tiveram retorno. Com o NetBeans 3.5, enormes ganhos foram obetidos em termos de desempenho, e testes e processos implementados para prevenir regress&otilde;es. Com a 3.6, os sistema de janelas e a folha de propriedade foram reimplementados, e a interface do usu&aacute;rio foi bastante limpa. <br>
</p>
<p>O NetBeans 4.0 foi uma mudan&ccedil;a completa na forma de trabalho do IDE. Um novo sistema de projetos n&atilde;o somente aumentou a experi&ecirc;ncia do usu&aacute;rio, mas tamb&eacute;m tornou poss&iacute;vel substituir infraestrutura que mantinha o NetBeans preso. O NetBeans 4.1 foi desenvolvido em uma nova infraesturtura de projetos da 4.0, e adicionou mais recursos e o completo suporte J2EE. O NetBeans 5.0 introduziu o suporte compreensivo para desenvolver m&oacute;dulos IDE e aplicativos &quot;rich client&quot; com base na plataforma NetBeans; um construtor intuitivo de IGU (Matisse); novo e reprojetado suporte CVS, suporte para o Sun ApplicationServer 8.2, Weblogic9 e JBoss 4. Vers&otilde;es subsequentes continuaram a desenvolver sobre o &ecirc;xito de vers&otilde;es anteriores e pelas demandas da ind&uacute;stria em transforma&ccedil;&atilde;o. Elogios da imprensa, pr&ecirc;mios da ind&uacute;stria e revis&otilde;es favor&aacute;veis por desenvolvedores se seguiram.<br>
</p>
<p>
Hoje, a equipe do NetBeans n&atilde;o poderia estar mais orgulhosa de qu&atilde;o longe o projeto e a comunidade NetBeans chegaram. Tamb&eacute;m vale lembrar que quase todos os arquitetos originais ainda est&atilde;o envolvidos no projeto, e est&atilde;o participando das listas de correiro do NetBeans. H&aacute; mais pessoas usando o software NetBeans do que antes. As ferramentas continuam a evoluir e a comunidade cresce. N&oacute;s o <a href="https://netbeans.org/people/new">convidamos a fazer parte disso</a>!<br>
<br>
</p>
<p></p><h2>Links relacionados</h2>
<ul>
<li><a href="press/releases.html">Comunicados &agrave; Imprensa</a></li>
<li><a href="../community/releases/vision.html">Declara&ccedil;&atilde;o da Vis&atilde;o Original</a></li>
<li><span style="text-decoration: underline;"></span><a href="../community/releases/roadmap.html">Mapa do caminho do desenvovimento do NetBeans</a><br>
</li>
<li><a href="https://netbeans.org/download/books/definitive-guide/html/apis-c_history.html">Hist&oacute;rico do NetBeans</a> do <i>NetBeans o Guia Definitivo</i> (N&atilde;o inclu&iacute;do em vers&atilde;o impressa).</li>
<li><a href="http://www.developer.com/java/other/article.php/631131">Artigo no Developer.com </a><a href="http://www.developer.com/java/other/article.php/631131"><span style="font-style: italic;">Circa 2001</span> </a></li>
<li><a href="http://web.archive.org/web/20000815061212/https://netbeans.org/index.html">Arquivo do site da Web original NetBeans.org</a></li>

</ul>
</body></html>