<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">

<title>Uma Introdu&ccedil;&atilde;o ao NetBeans</title>
<meta name="description" content="What is NetBeans, and what is netbeans.org">
<meta name="keywords" content="open source, screenshots, features, professional IDE, cross platform, product comparison, quicktour, features, benefits, use cases, license, governance, license">
<link rel="stylesheet" type="text/css" href="../netbeans.css">
</head><body>

<h1>Bem-vindo a comunidade NetBeans!</h1>
    
<p>A maioria dos desenvolvedores reconhecem o NetBeans IDE como o Java IDE original gr&aacute;tis. Ele &eacute; isso e muito mais! O NetBeans IDE fornece o suporte para diversas linguagens (PHP, JavaFX, C/C++, JavaScript, etc.) e estruturas. 
<br>
</p>
<p>O NetBeans &eacute; um projeto de c&oacute;digo-fonte aberto dedicado a prover produtos de desenvolvimento de software s&oacute;lidos como uma rocha (o <a href="../features/ide/index.html">NetBeans IDE</a> e a <a href="../features/platform/index.html">Plataforma NetBeans</a>) que endere&ccedil;em as necessidades dos desenvolvedores, dos usu&aacute;rios e das empresas que confiam no NetBeans como uma base para seus produtos. <br>
</p>
<div align="center"><p><a href="../kb/docs/intro-screencasts.html"><img src="../images_www/articles/69/start69.jpg" border="1"><br>V&iacute;deo: Introdu&ccedil;&atilde;o ao Software NetBeans</a></p></div>



<p>Em Junho de 2000, o NetBeans foi tornado <a href="os/index.html">c&oacute;digo-fonte aberto</a> pela <a href="http://www.sun.com/">Sun Microsystems</a>, que permaneceu como a patrocinadora do projeto at&eacute; Janeiro de 2010 quando a Sun Microsystems se tornou uma subsidi&aacute;ria da Oracle. Consulte nossa se&ccedil;&atilde;o <a href="history.html">Hist&oacute;rico</a> para obter mais informa&ccedil;&otilde;es.<br>
</p>

<p>Os dois produtos base, o NetBeans IDE e a Plataforma NetBeans, s&atilde;o gr&aacute;tis para uso comercial e n&atilde;o comercial. O <a href="../community/sources/">c&oacute;digo-fonte</a> est&aacute; dispon&iacute;vel para que qualquer pessoa o reutilize como considerar adequado, dentro dos Termos de Uso. A <a href="legal">se&ccedil;&atilde;o Legal</a> cont&eacute;m informa&ccedil;&otilde;es em rela&ccedil;&atilde;o ao licenciamento, quest&otilde;es de direito autoral, pol&iacute;tica de privacidade e termos de uso. Informa&ccedil;&otilde;es completas sobre o produto podem ser encontradas na se&ccedil;&atilde;o <a href="../features/index.html">Produtos</a>.</p>

<p>O projeto NetBeans &eacute; tamb&eacute;m uma <a href="../community/index.html">comunidade</a> vibrante, onde as pessoas ao redor do mundo, fazem perguntas, d&atilde;o conselhos, fazer diversas <a href="../community/contribute/">contribui&ccedil;&otilde;es</a>, e por &uacute;ltimo compartilham do sucesso de nossos produtos. Em nossas <a href="../community/lists/">listas de correio e f&oacute;rums</a>, voc&ecirc; encontrar&aacute; postagens de estudantes, desenvolvedores de <a href="../community/partners/index.html">empresas de primeira linha</a> e indiv&iacute;duis que procuram expandir seus conhecimentos.</p>

<p></p>



<p>Com mais de 18 milh&otilde;es de downloads do NetBeans IDE at&eacute; a data, e mais de 800,000 desenvolvedores <a href="https://netbeans.org/projects">participantes</a> <a href="https://netbeans.org/projects"></a>, o projeto NetBeans est&aacute; prosperando e continua a crescer, gra&ccedil;as aos indiv&iacute;duos e <a href="../community/partners/index.html">empresas parceiras</a>. Para fazer parte da comunidade, basta se <a href="https://netbeans.org/people/new">registrar de gra&ccedil;a</a>.</p><p>Para encontrar avisos &agrave; imprensa e artigos da m&iacute;dia sobre o NetBeans, visite nosso <a href="press/index.html">Centro de Imprensa</a>.</p></body></html>