<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>



  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>M&iacute;dia de DVD do NetBeans</title>
  <meta name="DESCRIPTION" content="Online order form for free NetBeans media">
  <link rel="STYLESHEET" type="text/css" href="../netbeans.css" media="screen"></head><body>
    
<a href="media_form.html"></a>
<h1>DVD do Programa do Kit Multilingue do Iniciante do NetBeans</h1>


<p>
</p>Obrigado por seu interesse no DVD do Programa do Kit Multilingue do Iniciante do NetBeans Desde Agosto de 2005, o NetBeans.org forneceu mais de 225.000 CDs e DVDs gr&aacute;tis para desenvolvedores ao redor do mundo atrav&eacute;s do Programa Kit do Iniciante. <br>


<p>Ao longo deste tempo, o NetBeans passou por um explosivo crescimento como uma comunidade e tamb&eacute;m a demanda por nosso software. </p>


<p>N&oacute;s n&atilde;o mais oferecemos o fornecimento gr&aacute;tis do DVD do Kit do Iniciante do NetBeans, mas fornecemos diversas formas para a comunidade ainda receber nossa ferramenta premiada:</p>
<ul>
  <li><p>Visite a <a href="https://netbeans.org/downloads/index.html">p&aacute;gina de download do NetBeans IDE</a> para obter conjuntos gr&aacute;tis de instala&ccedil;&atilde;o com baixo peso como 23MB. Voc&ecirc; pode sempre <a href="http://wiki.netbeans.org/FaqDownloadingUCModule">adicionar mais recursos</a> ao IDE mais tarde.</p></li>
  <li><p>Fa&ccedil;a o download e grave uma <a href="http://edu.netbeans.org/dvd/">imagem ISO</a> gr&aacute;tis do DVD do Programa do Kit Multilingue do Iniciante do NetBeans.</p></li>
  <li><p>Fa&ccedil;a o download do conjunto NetBeans IDE + JDK usando o <a href="http://java.sun.com/javase/downloads/">Gerenciador de download do JavaSE</a> da Oracle, que permite que voc&ecirc; pause, reinicie, e verifique arquivos baixados. </p></li>
</ul>

<p> 
Obrigado novamente por seu cont&iacute;nuo suporte e por seu interesse no projeto NetBeans! Voc&ecirc; &eacute; bem-vindo e encorajado a <a href="https://netbeans.org/about/contact_form.html?to=2">compartilhar seus coment&aacute;rios e perguntas</a> com a equipe do NetBeans, participe em nossas <a href="https://netbeans.org/community/lists/top.html">listas de correios e f&oacute;rums</a>, e explore a formas para <a href="https://netbeans.org/community/index.html">contribuir com o comunidade</a>.
</p>

</body></html>