<html>
<head>
<title>Rastreamento de uso de dados no NetBeans </title>
<link rel="stylesheet" type="text/css" HREF="../netbeans.css">
</head>

<body>

<h1>Rastreamento de uso de dados no NetBeans </h1>
<p>O objetivo de rastrear o uso de dados &eacute; o de coletar e analisar informa&ccedil;&otilde;es estat&iacute;sticas sobre os recursos de alto n&iacute;vel que s&atilde;o utilizados pelo usu&aacute;rio do NetBeans. Uma melhor compreens&atilde;o de quais recursos s&atilde;o mais e menos utilizados com frequ&ecirc;ncia nos ajuda a melhor planejar futuras vers&otilde;es. Os dados coletados s&atilde;o estritamente an&ocirc;nimos e enviados automaticamente para o servidor netbeans.org. A coleta e submiss&atilde;o de dados n&atilde;o tem impacto no desempenho e, portanto, n&atilde;o afetam o fluxo de trabalho regular.
</p>
<h3>Qual tipo de dados de utiliza&ccedil;&atilde;o est&atilde;o sendo coletados?</h3>
<p>
<ul>
<li>Configura&ccedil;&atilde;o do IDE - n&uacute;mero do build, informa&ccedil;&otilde;es do SO, lista de plug-ins ativados</li>
<li>Use de tipos de projetos (exemplo, Java SE, Java SE Freeform, Java Web Application, Java Enterprise Application, Ruby / Rails Application, PHP, C/C++, projeto NB Module, etc.)</li>
<li>Uso de estruturas de aplicativo da Web (exemplo Struts, JSF, Visual JSF, Spring, Hibernate, etc.)</li>
<li>Tipos e vers&otilde;es de servidores e execut&aacute;veis usados para a implementa&ccedil;&atilde;o (exemplo, GlassFish, Tomcat, WebSphere, JBoss, WebLogic, WEBrick, etc.)</li>
<li>Tipos de drivers JDBC usados para conex&otilde;es com bancos de dados (exemplo, MySQL, JavaDB, Oracle, etc.)</li>
<li>Use de recursos de produtividade espec&iacute;ficos (exemplo Debugger, Profiler, GUI Builder)</li>
<li>Tipos de sistemas de controle de vers&atilde;o utilizados por usu&aacute;rios (CVS, Subversion, Mercurial, ClearCase, etc.)</li>
<li>Acessos aos t&oacute;picos da Ajuda.</li>
</ul>
<h3>Quais dados N&Atilde;O est&atilde;o sendo coletados.</h3>
<p>
<ul>
<li>Nomes e senhas de usu&aacute;rios.</li>
<li>Caminhos, nomes de arquivos e nomes de classes.</li>
<li>Fragmentos do c&oacute;digo-fonte do usu&aacute;rio.</li>
</ul>
</p>
<p>
A equipe do NetBeans realmente aprecia sua participa&ccedil;&atilde;o no programa de rastreamento de uso dos dados!
</p>
</body>
</html>
