<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>

<meta http-equiv="content-type" content="text/html; charset=UTF-8">

<title>Instru&ccedil;&otilde;es de instala&ccedil;&atilde;o do NetBeans Enterprise Pack 5.5</title>
<meta name="description" content="Instru&ccedil;&otilde;es de instala&ccedil;&atilde;o do NetBeans Enterprise Pack 5.5 Beta">
<link rel="stylesheet" type="text/css" href="../../../netbeans.css" media="screen">
<meta http-equiv="Content-Language" content="pt-br">
</head>
<body>
<!-- Begin Content Area -->
<a name="top"></a>
<h1>Instru&ccedil;&otilde;es de instala&ccedil;&atilde;o do NetBeans Enterprise Pack 5.5</h1>
<blockquote>
<p>O NetBeans Enterprise Pack 5.5 inclui m&oacute;dulos de ferramentas do esquema XML, m&oacute;dulos BPEL, m&oacute;dulos de servi&ccedil;os de seguran&ccedil;a da Web, Sun Java System Application Server Platform Edition 9 atualiza&ccedil;&atilde;o 1, Project Open ESB Starter Kit, Sun Java System Access Manager 7.1 e Sun Java System Policy Agent 2.2 for Sun Web Services.</p>

<p><b>Observa&ccedil;&atilde;o:</b> A funcionalidade UML j&aacute; n&atilde;o est&aacute; dispon&iacute;vel na vers&atilde;o final (primeira remessa a clientes) para download do NetBeans Enterprise Pack 5.5. Mas &eacute; oferecida separadamente na Central de atualiza&ccedil;&otilde;es autom&aacute;ticas.</p>
</blockquote>
<p><b>Conte&uacute;do</b></p>
	<ul>
		<li><a href="#prerequisites" title="Pr&eacute;-requisitos">Pr&eacute;-requisitos</a></li>
		<li><a href="#configinfo" title="Informa&ccedil;&otilde;es de configura&ccedil;&atilde;o">Informa&ccedil;&otilde;es de configura&ccedil;&atilde;o</a></li>
		<li><a href="#installation" title="Instala&ccedil;&atilde;o do software">Instala&ccedil;&atilde;o do software</a>
		<div>
		  <ul>
		    <li><a href="#install_windows" title="Windows">Windows</a></li>
		    <li><a href="#install_sollinux" title="Solaris&trade; OS, Linux">Solaris&#8482; OS, Linux</a></li>
		    <li><a href="#install_macos" title="Macintosh OS X">Macintosh OS X</a></li>
		  </ul>
		</div></li>
		<li><a href="#uninstallation" title="Desinstala&ccedil;&atilde;o do software">Desinstala&ccedil;&atilde;o do software</a></li>
		<li><a href="#troubleshoot" title="Solu&ccedil;&otilde;es de problemas">Solu&ccedil;&otilde;es de problemas</a></li>
	</ul>
<blockquote>
<p><b>Observa&ccedil;&atilde;o:</b> Para obter informa&ccedil;&otilde;es sobre os requisitos do sistema para o software inclu&iacute;do neste pacote, consulte as <a href="entpack_relnotes_pt_BR.html">Notas da vers&atilde;o do NetBeans Enterprise Pack 5.5</a>.</p>
</blockquote>
<!-- PREREQUISITES -->
<h2><a name="prerequisites"></a>Pr&eacute;-requisitos</h2>
<p>Esse t&oacute;pico especifica os pr&eacute;-requisitos que devem ser cumpridos antes de iniciar a instala&ccedil;&atilde;o do NetBeans Enterprise Pack 5.5.</p>
<blockquote>
<h3>Software necess&aacute;rio</h3>
<p>Antes da instala&ccedil;&atilde;o do NetBeans Enterprise Pack 5.5, o software abaixo deve ser instalado:</p>
	<ul>
		<li>NetBeans IDE 5.5 (daqui em diante denominado IDE) <br> <br></li>
		<li>O JDK 5.0 atualiza&ccedil;&atilde;o 9 (vers&atilde;o 1.5.0_09; daqui em diante denominado JDK) ou superior deve ser instalado. Se tiver o JDK vers&atilde;o 5.0 atualiza&ccedil;&atilde;o 9 ou superior<span class="new"><!--update from A.Fomenko reflected --></span> instalado, n&atilde;o &eacute; poss&iacute;vel prosseguir com a instala&ccedil;&atilde;o. Para obter detalhes, consulte o t&oacute;pico <a href="entpack_relnotes_pt_BR.html#req_sw">Software&nbsp;necess&aacute;rio</a> em <a href="entpack_relnotes_pt_BR.html" title="Notas da vers&atilde;o">Notas&nbsp;da&nbsp;vers&atilde;o</a>.<br> <br> <b>Observa&ccedil;&atilde;o:</b> Para Mac OS X, &eacute; necess&aacute;rio ter como m&iacute;nimo o JDK 5.0 vers&atilde;o 3.</li>
	</ul>
<h3>Aplicativos firewall</h3>
<p>Os aplicativos firewall ativados podem impedir que alguns componentes sejam configurados corretamente durante o processo de instala&ccedil;&atilde;o. Desative os aplicativos firewall antes iniciar a instala&ccedil;&atilde;o.</p>
</blockquote>
<br>
<p align="center"><a href="#top">superior</a></p>

<br>
<!-- CONFIG INFO -->
<h2><a name="configinfo"></a>Informa&ccedil;&otilde;es de configura&ccedil;&atilde;o</h2>
<p>Este t&oacute;pico oferece informa&ccedil;&otilde;es sobre a configura&ccedil;&atilde;o que podem ser necess&aacute;rias para configurar o software.</p>
<blockquote>
<h3>Servidor de aplicativo Sun Java System</h3>
<p>Os valores da senha e do nome de usu&aacute;rio padr&atilde;o do dom&iacute;nio padr&atilde;o do servidor de aplicativos, <tt>domain1</tt>, s&atilde;o os seguintes: <br> nome de usu&aacute;rio: <tt>admin</tt><br> senha: <tt>adminadmin</tt></p>
<h3>Gerenciador de acesso Sun Java System</h3>
<p>Se precisar acessar o console da administra&ccedil;&atilde;o do servidor do gerenciador de acesso, use os valores seguintes:<br> nome de usu&aacute;rio: <tt>amadmin</tt><br> senha: <tt>admin123</tt> </p>
</blockquote>

<br>
<p align="center"><a href="#top">superior</a></p>

<br>
<!-- INSTALLATION -->
<h2><a name="installation"></a>Instala&ccedil;&atilde;o do software</h2>
<p>Essa se&ccedil;&atilde;o apresenta as instru&ccedil;&otilde;es para a instala&ccedil;&atilde;o do NetBeans Enterprise Pack 5.5 em todas as plataformas suportadas.</p>

<!-- INSTALLATION: WINDOWS -->
<blockquote>
<h3><a name="install_windows"></a>Windows</h3>
<p>Encontram-se abaixo as instru&ccedil;&otilde;es para a instala&ccedil;&atilde;o do NetBeans Enterprise Pack 5.5 na plataforma Microsoft Windows.</p>
<p><b>Antes de come&ccedil;ar</b></p>
<p>A instala&ccedil;&atilde;o na plataforma Microsoft Windows apresenta as seguintes restri&ccedil;&otilde;es:</p>
<ul>
<li>O instalador extrai os arquivos necess&aacute;rios para o diret&oacute;rio tempor&aacute;rio padr&atilde;o definido pela vari&aacute;vel de ambiente <tt>TEMP</tt>. Se o espa&ccedil;o em disco no diret&oacute;rio tempor&aacute;rio &eacute; menor que o necess&aacute;rio, a instala&ccedil;&atilde;o pode falhar ou ser feita de forma incorreta.<br> Se tiver este problema, voc&ecirc; pode aumentar o espa&ccedil;o alocado da vari&aacute;vel de ambiente <tt>TEMP</tt> ou especificar outro diret&oacute;rio tempor&aacute;rio com espa&ccedil;o suficiente. Para especificar um diret&oacute;rio tempor&aacute;rio para a instala&ccedil;&atilde;o, use os seguintes comandos de uma janela de comando:<br> <br> <tt>&gt;&nbsp;cd&nbsp;/d &nbsp;<i>local-do-instalador</i></tt><br> <tt>&gt;&nbsp;netbeans-ent_pack-5_5-windows.exe&nbsp;-is:tempdir&nbsp;<i>diret&oacute;rio-tempor&aacute;rio</i></tt><br>
</li>
</ul>
<p><b>Para instalar</b></p>
<ol>
<li>Depois de fazer o download do arquivo de instala&ccedil;&atilde;o, <tt>netbeans-ent_pack-5_5-windows.exe</tt><!--To verify the filename-->, clique duas vezes no &iacute;cone do instalador para inici&aacute;-lo.<br> <br></li>
<li>Na p&aacute;gina de boas-vindas do assistente de instala&ccedil;&atilde;o, clique em Pr&oacute;ximo.<br><br></li>

<li>Responda o contrato de licen&ccedil;a e clique em Pr&oacute;ximo.<br> A p&aacute;gina de sele&ccedil;&atilde;o da pasta de instala&ccedil;&atilde;o do NetBeans IDE 5.5 do assistente se abre.<br> <br></li>

<li>Na lista de instala&ccedil;&otilde;es compat&iacute;veis, escolha o IDE no qual o NetBeans Enterprise Pack ser&aacute; instalado e clique em Pr&oacute;ximo.<span class="new"><br></span>Tamb&eacute;m &eacute; poss&iacute;vel digitar o caminho de outro IDE instalado ou usar o bot&atilde;o Explorar para ir at&eacute; outra instala&ccedil;&atilde;o e selecion&aacute;-la.<br> <br></li>

<li>Selecione os componentes do NetBeans Enterprise Pack que deseja instalar e clique em Pr&oacute;ximo.<br> <b>Observa&ccedil;&atilde;o:</b> Desmarque as caixas de sele&ccedil;&atilde;o BPEL e Servi&ccedil;os de seguran&ccedil;a da Web se n&atilde;o tiver a inten&ccedil;&atilde;o de usar esses m&oacute;dulos. Isto ativa o bot&atilde;o de op&ccedil;&atilde;o Ignorar servidor de aplicativos na etapa seguinte e acelera o processo de instala&ccedil;&atilde;o.<br> <b>Observa&ccedil;&atilde;o:</b> Certifique-se de observar as depend&ecirc;ncias listadas na tabela abaixo ao selecionar os componentes para instala&ccedil;&atilde;o.<br> <br>

  <table width="600" border="1">
  <tr>
    <th scope="col">Nome do componente necess&aacute;rio</th>
    <th scope="col">Nome do componente dependente</th>
  </tr>
  <tr>
      <td>Componente XML do NetBeans Enterprise Pack 5.5  </td>
        <td>Componente BPEL do NetBeans Enterprise Pack 5.5 </td>
  </tr>
  <tr>
    <td>Sun Java System Application Server Platform Edition 9</td>
    <td>
	<p>
	Os componentes do NetBeans Enterprise Pack 5.5 seguintes: <br>
	</p>
    <ul>
        <li>BPEL</li>
        <li>Servi&ccedil;os de seguran&ccedil;a da Web<br><br></li>
    </ul>  </td>
  </tr>
</table>
<br><br></li>


<li>Adote um dos seguintes procedimentos:<br><br>
<ul>
<li>Para instalar o servidor de aplicativos incorporado, siga as instru&ccedil;&otilde;es em <a href="#continueinstallwithbundledas" title="Para continuar a instala&ccedil;&atilde;o com servidor de aplicativos incorporado">Para continuar a instala&ccedil;&atilde;o com o servidor de aplicativos incorporado</a>.<br><br></li>
<li>Se tiver um servidor de aplicativos Sun Java System Application Server Platform Edition 9 ou do Project Glassfish pr&eacute;-instalados siga as instru&ccedil;&otilde;es em <a href="#continueinstallwithpreinstalledas" title="Para continuar a instala&ccedil;&atilde;o com o servidor de aplicativos pr&eacute;-instalado">Para continuar a instala&ccedil;&atilde;o com o servidor de aplicativos pr&eacute;-instalado</a>.<br><br></li>
<!--<li>To continue the installation without the BPEL and Secure Web Services modules, follow the instructions in <a href="#continueinstallwithoutsoaidentity" title="To Continue the Installation Without the SOA and Identity Modules">To Continue the Installation Without the BPEL and Secure Web Services Modules </a>.<br><br></li>-->
</ul>
</li>
</ol>
<p><b><a name="continueinstallwithbundledas"></a>Para continuar a instala&ccedil;&atilde;o com o servidor de aplicativos incorporado</b></p>
<ol>
<li>Na p&aacute;gina das op&ccedil;&otilde;es de instala&ccedil;&atilde;o do NetBeans Enterprise Pack do assistente de instala&ccedil;&atilde;o, selecione o bot&atilde;o de op&ccedil;&atilde;o Instalar o servidor de aplicativos incorporado e clique em Pr&oacute;ximo.<br> <br>
  </li>

<li>Na p&aacute;gina da pasta de instala&ccedil;&atilde;o do servidor de aplicativos do assistente de instala&ccedil;&atilde;o, aceite a pasta de instala&ccedil;&atilde;o padr&atilde;o do servidor de aplicativos, especifique outra pasta, esvazie a pasta de instala&ccedil;&atilde;o ou use o bot&atilde;o Explorar para ir at&eacute; a pasta de instala&ccedil;&atilde;o e selecion&aacute;-la, e clique em Pr&oacute;ximo. <br> <br></li>

<li>Na lista de instala&ccedil;&otilde;es compat&iacute;veis, escolha o JDK que o servidor de aplicativos ir&aacute; usar e clique em Pr&oacute;ximo.<br> Voc&ecirc; tamb&eacute;m pode digitar o caminho de outro JDK instalado ou usar o bot&atilde;o Explorar para ir at&eacute; outra instala&ccedil;&atilde;o e selecion&aacute;-la.<span class="new"><br> <br></span></li>
<li>Defina o nome de usu&aacute;rio e a senha do dom&iacute;nio padr&atilde;o do servidor de aplicativos, <tt>domain1</tt>, ou aceite os padr&otilde;es e clique em Pr&oacute;ximo.<br> O nome de usu&aacute;rio e a senha padr&atilde;o s&atilde;o <tt>admin</tt> e <tt>adminadmin</tt>.<br><br></li>

<li>Verifique os valores da porta (<tt>Admin</tt>, <tt>HTTP</tt> e <tt>HTTPS</tt>) do dom&iacute;nio padr&atilde;o do servidor de aplicativos e altere-os se necess&aacute;rio. Em seguida clique em Pr&oacute;ximo.<br> <br></li>

<li>Verifique se a lista dos componentes que ser&atilde;o instalados est&aacute; correta e se h&aacute; espa&ccedil;o suficiente no sistema para a instala&ccedil;&atilde;o.<br><br></li>

<li>Clique em Instalar para iniciar a instala&ccedil;&atilde;o. <br><br></li>

<li>Quando a instala&ccedil;&atilde;o estiver conclu&iacute;da, clique em Finalizar para sair do assistente.</li>
</ol>
<p><b><a name="continueinstallwithpreinstalledas"></a>Para continuar a instala&ccedil;&atilde;o com o servidor de aplicativos pr&eacute;-instalado</b></p>
<ol>
<li>Na p&aacute;gina das op&ccedil;&otilde;es de instala&ccedil;&atilde;o do NetBeans Enterprise Pack do assistente de instala&ccedil;&atilde;o, selecione bot&atilde;o de op&ccedil;&atilde;o Instalar o servidor de aplicativos pr&eacute;-instalado e clique em Pr&oacute;ximo.<br> <br>
</li>

<li>Na p&aacute;gina da pasta de instala&ccedil;&atilde;o do servidor de aplicativos do assistente de instala&ccedil;&atilde;o, escolha o servidor de aplicativos que deseja usar na lista de instala&ccedil;&otilde;es compat&iacute;veis ou use o bot&atilde;o Explorar para ir at&eacute; outra pasta de instala&ccedil;&atilde;o de servidor de aplicativos e selecion&aacute;-la, e clique em Pr&oacute;ximo.<br> <br>
</li>


<li>Se o dom&iacute;nio padr&atilde;o, <tt>domain1</tt>, j&aacute; existir no servidor de aplicativos selecionado, insira o nome de usu&aacute;rio e a senha de tal dom&iacute;nio e clique em Pr&oacute;ximo.<br> O assistente de instala&ccedil;&atilde;o verifica as informa&ccedil;&otilde;es introduzidas do nome de usu&aacute;rio e da senha.<br> <b>Observa&ccedil;&atilde;o:</b> O processo de verifica&ccedil;&atilde;o pode demorar alguns minutos.<br> <br>

-ou-<br><br>

Se o dom&iacute;nio padr&atilde;o, <tt>domain1</tt>, ainda n&atilde;o existir no servidor de aplicativos selecionado, adote o seguinte procedimento:<br><br>
<ol type="a">
<li>Defina o nome de usu&aacute;rio e a senha do dom&iacute;nio padr&atilde;o do servidor de aplicativos, <tt>domain1</tt>, ou aceite os padr&otilde;es e clique em Pr&oacute;ximo.<br> O nome de usu&aacute;rio e a senha padr&atilde;o s&atilde;o <tt>admin</tt> e <tt>adminadmin</tt>.<br><br></li>
<li>Verifique os valores da porta (<tt>Admin</tt>, <tt>HTTP</tt> e <tt>HTTPS</tt>) do servidor de aplicativos e altere-os se necess&aacute;rio. Em seguida clique em Pr&oacute;ximo.</li>
</ol>
<br><br></li>
<li>Verifique se a lista dos componentes que ser&atilde;o instalados est&aacute; correta e se h&aacute; espa&ccedil;o suficiente no sistema para a instala&ccedil;&atilde;o.<br><br></li>
<li>Clique em Instalar para iniciar a instala&ccedil;&atilde;o. <br><br></li>
<li>Quando a instala&ccedil;&atilde;o estiver conclu&iacute;da, clique em Finalizar para sair do assistente. <br><br></li>
</ol>

<!--<p>
<b><a name="continueinstallwithoutsoaidentity"></a>To Continue the Installation Without the BPEL and Secure Web Services Modules</b>
</p>

<ol>
<li>At the NetBeans Enterprise Pack installation options page of the installation wizard, select the Skip Application Server configuration radio button, and click Next.<br>
  <br>
</li>

<li>Verify that the list of components to be installed  is correct and that you have adequate space on your system for the installation.<br>
  <br></li>

<li>Click Install to begin the installation.<br>
  <br></li>
</ol>-->

<div class="greybox"> <b>Observa&ccedil;&atilde;o: </b>Se tiver problemas para concluir com sucesso a instala&ccedil;&atilde;o do software, consulte <a href="#troubleshoot">Solu&ccedil;&otilde;es de problemas</a> para obter descri&ccedil;&otilde;es completas e solu&ccedil;&otilde;es sugeridas para problemas n&atilde;o solucionados que poderiam afetar o processo de instala&ccedil;&atilde;o. </div>
<br><br>
</blockquote>
<p align="center"><a href="#top">superior</a></p>

<!-- INSTALLATION: SOLARIS OS and LINUX ---------------------------------->
<h3><a name="install_sollinux"></a>Solaris OS, Linux</h3>
<p>Encontram-se abaixo as instru&ccedil;&otilde;es para a instala&ccedil;&atilde;o do NetBeans Enterprise Pack 5.5 nas plataformas Solaris OS e Linux.</p>
<p>Nas instru&ccedil;&otilde;es abaixo, substitua <tt><i>seu_execut&aacute;vel_bin&aacute;rio</i></tt> por um dos seguintes:</p>
<ul>
<li>Linux: <tt>netbeans-ent_pack-5_5-linux.sh</tt></li>
<li>Solaris OS, SPARC&reg;: <tt>netbeans-ent_pack-5_5-solaris-sparc.sh</tt></li>
<li>Solaris OS, x86/x64 Platform Edition: <tt>netbeans-ent_pack-5_5-solaris-x86.sh</tt></li>
</ul>
<blockquote>
<p><b>Para instalar</b></p>
<ol>
<li>Depois de fazer o download o arquivo de instala&ccedil;&atilde;o, <tt><i>seu_execut&aacute;vel_bin&aacute;rio</i></tt>, navegue at&eacute; a pasta que cont&eacute;m este arquivo. <br> <br></li>
<li>Se necess&aacute;rio, altere as permiss&otilde;es do arquivo de instala&ccedil;&atilde;o para tornar o execut&aacute;vel bin&aacute;rio usando o comando abaixo em um prompt de comando.<br> <br> <tt>$&nbsp;chmod&nbsp;+x&nbsp;<i>seu_execut&aacute;vel_bin&aacute;rio</i></tt><br> <br>
</li>
<li>Inicie o instalador usando o comando mostrado abaixo em um prompt de comando.<br> <br> <tt>$&nbsp;./<i>seu_execut&aacute;vel_bin&aacute;rio</i></tt><br> <br>
</li>
<li>Na p&aacute;gina de boas-vindas do assistente de instala&ccedil;&atilde;o, clique em Pr&oacute;ximo.<br><br></li>
<li>Responda o contrato de licen&ccedil;a e clique em Pr&oacute;ximo.<br> A p&aacute;gina de sele&ccedil;&atilde;o da pasta de instala&ccedil;&atilde;o do NetBeans IDE 5.5 do assistente se abre.<br> <br></li>

<li>Na lista de instala&ccedil;&otilde;es compat&iacute;veis, escolha o IDE no qual o NetBeans Enterprise Pack ser&aacute; instalado e clique em Pr&oacute;ximo.<br> Voc&ecirc; tamb&eacute;m pode digitar o caminho de outro IDE instalado ou usar o bot&atilde;o Explorar para ir at&eacute; outra instala&ccedil;&atilde;o e selecion&aacute;-la.<br> <br></li>

<li>Selecione os componentes do NetBeans Enterprise Pack que deseja instalar e clique em Pr&oacute;ximo. <br> <b>Observa&ccedil;&atilde;o:</b> Desmarque as caixas de sele&ccedil;&atilde;o BPEL e Servi&ccedil;os de seguran&ccedil;a da Web se n&atilde;o tiver a inten&ccedil;&atilde;o de usar esses m&oacute;dulos. Isto ativa o bot&atilde;o de op&ccedil;&atilde;o Ignorar servidor de aplicativos na etapa seguinte e acelera o processo de instala&ccedil;&atilde;o.<br> <b>Observa&ccedil;&atilde;o:</b> Certifique-se de observar as depend&ecirc;ncias listadas na tabela abaixo ao selecionar os componentes para instala&ccedil;&atilde;o.<br> <br>

  <table width="600" border="1">
  <tr>
    <th scope="col">Nome do componente necess&aacute;rio</th>
    <th scope="col">Nome do componente dependente</th>
  </tr>
  <tr>
      <td>Componente XML do NetBeans Enterprise Pack 5.5  </td>
        <td>Componente BPEL do NetBeans Enterprise Pack 5.5 </td>
  </tr>
  <tr>
    <td>Sun Java System Application Server Platform Edition 9</td>
    <td>
	<p>
	Os componentes do NetBeans Enterprise Pack 5.5 seguintes: <br>
	</p>
    <ul>
        <li>BPEL</li>
        <li>Servi&ccedil;os de seguran&ccedil;a da Web<br><br></li>
    </ul>   </td>
  </tr>
</table>
<br><br></li>


<li>Adote um dos seguintes procedimentos:<br><br>
<ul>
<li>Para instalar o servidor de aplicativos incorporado, siga as instru&ccedil;&otilde;es em <a href="#unix_continueinstallwithbundledas" title="Para continuar a instala&ccedil;&atilde;o com servidor de aplicativos incorporado">Para continuar a instala&ccedil;&atilde;o com o servidor de aplicativos incorporado</a>.<br><br></li>
<li>Se tiver um servidor de aplicativos Sun Java System Application Server Platform Edition 9 ou do Project Glassfish pr&eacute;-instalados siga as instru&ccedil;&otilde;es em <a href="#unix_continueinstallwithpreinstalledas" title="Para continuar a instala&ccedil;&atilde;o com o servidor de aplicativos pr&eacute;-instalado">Para continuar a instala&ccedil;&atilde;o com o servidor de aplicativos pr&eacute;-instalado</a>.<br> <br></li>
<!--<li>To continue the installation without the BPEL and Secure Web Services modules, follow the instructions in <a href="#unix_continueinstallwithoutsoaidentity" title="To Continue the Installation Without the SOA and Identity Modules">To Continue the Installation Without the BPEL and Secure Web Services Modules </a>.<br><br></li>-->
</ul>
</li>
</ol>
<p><b><a name="unix_continueinstallwithbundledas"></a>Para continuar a instala&ccedil;&atilde;o com o servidor de aplicativos incorporado</b></p>
<ol>
<li>Na p&aacute;gina das op&ccedil;&otilde;es de instala&ccedil;&atilde;o do NetBeans Enterprise Pack do assistente de instala&ccedil;&atilde;o, selecione o bot&atilde;o de op&ccedil;&atilde;o Instalar o servidor de aplicativos incorporado e clique em Pr&oacute;ximo.<br> <br>
  </li>

<li>Na p&aacute;gina da pasta de instala&ccedil;&atilde;o do servidor de aplicativos do assistente de instala&ccedil;&atilde;o, aceite a pasta de instala&ccedil;&atilde;o padr&atilde;o do servidor de aplicativos, especifique outra pasta, esvazie a pasta de instala&ccedil;&atilde;o ou use o bot&atilde;o Explorar para ir at&eacute; outra pasta de instala&ccedil;&atilde;o e selecion&aacute;-la. Em seguida clique em Pr&oacute;ximo. <br> <br></li>

<li>Na lista de instala&ccedil;&otilde;es compat&iacute;veis, escolha o JDK que o servidor de aplicativos ir&aacute; usar e clique em Pr&oacute;ximo.<br> Voc&ecirc; tamb&eacute;m pode digitar o caminho de outro JDK instalado ou usar o bot&atilde;o Explorar para ir at&eacute; outra instala&ccedil;&atilde;o e selecion&aacute;-la.<br> <br>
</li>
<li>Defina o nome de usu&aacute;rio e a senha do dom&iacute;nio padr&atilde;o do servidor de aplicativos, <tt>domain1</tt>, ou aceite os padr&otilde;es e clique em Pr&oacute;ximo.<br> O nome de usu&aacute;rio e a senha padr&atilde;o s&atilde;o <tt>admin</tt> e <tt>adminadmin</tt>.<br><br></li>
<li>Verifique os valores da porta (<tt>Admin</tt>, <tt>HTTP</tt> e <tt>HTTPS</tt>) do servidor de aplicativos e altere-os se necess&aacute;rio. Em seguida clique em Pr&oacute;ximo.<br><br></li>
<li>Verifique se a lista dos componentes que ser&atilde;o instalados est&aacute; correta e se h&aacute; espa&ccedil;o suficiente no sistema para a instala&ccedil;&atilde;o.<br> <br></li>
<li>Clique em Instalar para iniciar a instala&ccedil;&atilde;o. <br><br></li>
<li>Quando a instala&ccedil;&atilde;o estiver conclu&iacute;da, clique em Finalizar para sair do assistente.<br><br></li>
</ol>
<p><b><a name="unix_continueinstallwithpreinstalledas"></a>Para continuar a instala&ccedil;&atilde;o com o servidor de aplicativos pr&eacute;-instalado</b></p>
<ol>
  <li>Na p&aacute;gina das op&ccedil;&otilde;es de instala&ccedil;&atilde;o do NetBeans Enterprise Pack do assistente de instala&ccedil;&atilde;o, selecione bot&atilde;o de op&ccedil;&atilde;o Instalar o servidor de aplicativos pr&eacute;-instalado e clique em Pr&oacute;ximo.<br> <br>
  </li>

<li>Na p&aacute;gina da pasta de instala&ccedil;&atilde;o do servidor de aplicativos do assistente de instala&ccedil;&atilde;o, escolha o servidor de aplicativos que deseja usar na lista de instala&ccedil;&otilde;es compat&iacute;veis ou use o bot&atilde;o Explorar para ir at&eacute; outra pasta de instala&ccedil;&atilde;o de servidor de aplicativos e selecion&aacute;-la. Em seguida clique em Pr&oacute;ximo.<br> <span class="new">    <br></span></li>


<li>Se o dom&iacute;nio padr&atilde;o, <tt>domain1</tt>, j&aacute; existir no servidor de aplicativos selecionado, insira o nome de usu&aacute;rio e a senha de tal dom&iacute;nio e clique em Pr&oacute;ximo.<br> O assistente de instala&ccedil;&atilde;o verifica as informa&ccedil;&otilde;es introduzidas do nome de usu&aacute;rio e da senha.<br> <b>Observa&ccedil;&atilde;o:</b> O processo de verifica&ccedil;&atilde;o pode demorar alguns minutos.<br> <br>

-ou-<br><br> Se o dom&iacute;nio padr&atilde;o, <tt>domain1</tt>, ainda n&atilde;o existir no servidor de aplicativos selecionado, adote o seguinte procedimento:<br><br>
<div>
<ol type="a">
<li>Defina o nome de usu&aacute;rio e a senha do dom&iacute;nio padr&atilde;o do servidor de aplicativos, <tt>domain1</tt>, ou aceite os padr&otilde;es e clique em Pr&oacute;ximo.<br> O nome de usu&aacute;rio e a senha padr&atilde;o s&atilde;o <tt>admin</tt> e <tt>adminadmin</tt>.<br><br></li>
<li>Verifique os valores da porta (<tt>Admin</tt>, <tt>HTTP</tt> e <tt>HTTPS</tt>) do servidor de aplicativos e altere-os se necess&aacute;rio. Em seguida clique em Pr&oacute;ximo.</li>
</ol>
</div><br><br>
</li>

<li>Verifique se a lista dos componentes que ser&atilde;o instalados est&aacute; correta e se h&aacute; espa&ccedil;o suficiente no sistema para a instala&ccedil;&atilde;o.<br> <br></li>
<li>Clique em Instalar para iniciar a instala&ccedil;&atilde;o. <br><br></li>
<li>Quando a instala&ccedil;&atilde;o estiver conclu&iacute;da, clique em Finalizar para sair do assistente.<br><br></li>
</ol>

<!--<p>
<b><a name="unix_continueinstallwithoutsoaidentity"></a>To Continue the Installation Without the BPEL and Secure Web Services Modules</a></b>
</p>

<ol>
<li>At the NetBeans Enterprise Pack installation options page of the installation wizard, select the Skip Application Server configuration radio button, and click Next.<br>
  <br></li>

<li>Verify that the list of components to be installed  is correct and that you have adequate space on your system for the installation.<br>
  <br></li>

<li>Click Install to begin the installation.<br>
  <br></li>
</ol>
-->

<div class="greybox"> <b>Observa&ccedil;&atilde;o: </b>Se tiver problemas para concluir com sucesso a instala&ccedil;&atilde;o do software, consulte <a href="#troubleshoot">Solu&ccedil;&otilde;es de problemas</a> para obter descri&ccedil;&otilde;es completas e solu&ccedil;&otilde;es sugeridas para problemas n&atilde;o solucionados que poderiam afetar o processo de instala&ccedil;&atilde;o. </div>
<br><br>
</blockquote>
<p align="center"><a href="#top">superior</a></p>

<!-- Installation: Mac OS -->
<h3><a name="install_macos"></a>Macintosh OS X</h3>
<p>Encontram-se abaixo as instru&ccedil;&otilde;es para a instala&ccedil;&atilde;o do NetBeans Enterprise Pack 5.5 nas plataformas Solaris OS e Linux.</p>
<blockquote>
<p><b>Antes de come&ccedil;ar</b></p>
<p>A instala&ccedil;&atilde;o na plataforma Mac OS X apresenta as seguintes restri&ccedil;&otilde;es:</p>
<ul>
<li>Para garantir a correta opera&ccedil;&atilde;o do instalador e do desinstalador, voc&ecirc; deve configurar o Java para que use o JDK 5.0:
<ol type="a">
<li>Na janela Localizador, v&aacute; para Aplicativos | Utilit&aacute;rios | Java | J2SE5.0 e abra o utilit&aacute;rio Prefer&ecirc;ncias de Java.</li>
<li>Na se&ccedil;&atilde;o Configura&ccedil;&otilde;es em tempo de execu&ccedil;&atilde;o do aplicativo Java, mova o J2SE5.0 para a parte superior da lista.<br><br></li>

</ol>
</li>
<li>Para permitir que os sistema operacional reorganize corretamente os componentes do NetBeans 5.5, a pasta de instala&ccedil;&atilde;o deve terminar com a seq&uuml;&ecirc;ncia <tt>.app</tt>.</li>
</ul>
<p><b>Para instalar</b></p>
<ol>
<li>Depois de fazer o download do arquivo de instala&ccedil;&atilde;o, <tt>netbeans-ent_pack-5_5-macosx.jar</tt>, navegue at&eacute; a pasta que cont&eacute;m o arquivo e clique duas vezes no &iacute;cone do instalador para inici&aacute;-lo.<br> <b>Observa&ccedil;&atilde;o:</b> Se a vers&atilde;o padr&atilde;o de Java do seu sistema for 1.4, n&atilde;o ser&aacute; poss&iacute;vel iniciar a instala&ccedil;&atilde;o com um duplo clique no arquivo <tt>.jar</tt>. Nesse caso, execute o arquivo <tt>.jar</tt> manualmente a partir da linha de comando que usa o Java 1.5.<br><br></li>
<li>Na p&aacute;gina de boas-vindas do assistente de instala&ccedil;&atilde;o, clique em Pr&oacute;ximo.<br><br></li>
<li>Responda o contrato de licen&ccedil;a e clique em Pr&oacute;ximo. <br> A p&aacute;gina de sele&ccedil;&atilde;o da pasta de instala&ccedil;&atilde;o do NetBeans IDE 5.5 do assistente se abre.<br> <br></li>

<li>Na lista de instala&ccedil;&otilde;es compat&iacute;veis, escolha o IDE no qual o NetBeans Enterprise Pack ser&aacute; instalado e clique em Pr&oacute;ximo.<br> Voc&ecirc; tamb&eacute;m pode digitar o caminho de outro IDE instalado ou usar o bot&atilde;o Explorar para ir at&eacute; outra instala&ccedil;&atilde;o e selecion&aacute;-la.<br> <br></li>

<li>Selecione os componentes do NetBeans Enterprise Pack que deseja instalar e clique em Pr&oacute;ximo. <br> <b>Observa&ccedil;&atilde;o:</b> Desmarque as caixas de sele&ccedil;&atilde;o BPEL e Servi&ccedil;os de seguran&ccedil;a da Web se n&atilde;o tiver a inten&ccedil;&atilde;o de usar esses m&oacute;dulos. Isto ativa o bot&atilde;o de op&ccedil;&atilde;o Ignorar servidor de aplicativos na etapa seguinte e acelera o processo de instala&ccedil;&atilde;o.<br> <b>Observa&ccedil;&atilde;o:</b> Certifique-se de observar as depend&ecirc;ncias listadas na tabela abaixo ao selecionar os componentes para instala&ccedil;&atilde;o.<br> <br>

  <table width="600" border="1">
  <tr>
    <th scope="col">Nome do componente necess&aacute;rio</th>
    <th scope="col">Nome do componente dependente</th>
  </tr>
  <tr>
      <td>Componente XML do NetBeans Enterprise Pack 5.5  </td>
        <td>Componente BPEL do NetBeans Enterprise Pack 5.5 </td>
  </tr>
  <tr>
    <td>Sun Java System Application Server Platform Edition 9</td>
    <td>
	<p>
	Os componentes do NetBeans Enterprise Pack 5.5 seguintes: <br>
	</p>
    <ul>
        <li>BPEL</li>
        <li>Servi&ccedil;os de seguran&ccedil;a da Web<br><br></li>
    </ul> </td>
  </tr>
</table>
<br><br></li>


<li>Adote um dos seguintes procedimentos:<br><br>
<ul>
<li>Para instalar o servidor de aplicativos incorporado, siga as instru&ccedil;&otilde;es em <a href="#mac_continueinstallwithbundledas" title="Para continuar a instala&ccedil;&atilde;o com servidor de aplicativos incorporado">Para continuar a instala&ccedil;&atilde;o com o servidor de aplicativos incorporado</a>.<br><br></li>
<li>Se tiver um servidor de aplicativos Sun Java System Application Server Platform Edition 9 ou do Project Glassfish pr&eacute;-instalados siga as instru&ccedil;&otilde;es em <a href="#mac_continueinstallwithpreinstalledas" title="Para continuar a instala&ccedil;&atilde;o com o servidor de aplicativos pr&eacute;-instalado">Para continuar a instala&ccedil;&atilde;o com o servidor de aplicativos pr&eacute;-instalado</a>.<br> <br></li>
<!--<li>To continue the installation without the BPEL and Secure Web Services modules, follow the instructions in <a href="#mac_continueinstallwithoutsoaidentity" title="To Continue the Installation Without the SOA and Identity Modules">To Continue the Installation Without the BPEL and Secure Web Services Modules</a>.<br>
  <br></li>-->
</ul>
</li>
</ol>
<p><b><a name="mac_continueinstallwithbundledas"></a>Para continuar a instala&ccedil;&atilde;o com o servidor de aplicativos incorporado</b></p>
<ol>
<li>Na p&aacute;gina das op&ccedil;&otilde;es de instala&ccedil;&atilde;o do NetBeans Enterprise Pack do assistente de instala&ccedil;&atilde;o, selecione o bot&atilde;o de op&ccedil;&atilde;o Instalar o servidor de aplicativos incorporado e clique em Pr&oacute;ximo.<br> <br>
</li>

<li>Na p&aacute;gina da pasta de instala&ccedil;&atilde;o do servidor de aplicativos do assistente de instala&ccedil;&atilde;o, aceite a pasta de instala&ccedil;&atilde;o padr&atilde;o do servidor de aplicativos, especifique outra pasta, esvazie a pasta de instala&ccedil;&atilde;o ou use o bot&atilde;o Explorar para ir at&eacute; outra pasta de instala&ccedil;&atilde;o e selecion&aacute;-la. Em seguida clique em Pr&oacute;ximo. <br> <br></li>

<li>Escolha o JDK que o servidor de aplicativos ir&aacute; usar na lista de instala&ccedil;&otilde;es compat&iacute;veis e clique em Pr&oacute;ximo.<br> Voc&ecirc; tamb&eacute;m pode digitar o caminho de outro JDK instalado ou usar o bot&atilde;o Explorar para ir at&eacute; outra instala&ccedil;&atilde;o e selecion&aacute;-la.<span class="new"><br> <br></span></li>
<li>Defina o nome de usu&aacute;rio e a senha do dom&iacute;nio padr&atilde;o do servidor de aplicativos, <tt>domain1</tt>, ou aceite os padr&otilde;es e clique em Pr&oacute;ximo.<br> O nome de usu&aacute;rio e a senha padr&atilde;o s&atilde;o <tt>admin</tt> e <tt>adminadmin</tt>.<br><br></li>
<li>Verifique os valores da porta (<tt>Admin</tt>, <tt>HTTP</tt> e <tt>HTTPS</tt>) do servidor de aplicativos e altere-os se necess&aacute;rio. Em seguida clique em Pr&oacute;ximo.<br><br></li>
<li>Verifique se a lista dos componentes que ser&atilde;o instalados est&aacute; correta e se h&aacute; espa&ccedil;o suficiente no sistema para a instala&ccedil;&atilde;o.<br><br></li>
<li>Clique em Instalar para iniciar a instala&ccedil;&atilde;o. <br><br></li>
<li>Quando a instala&ccedil;&atilde;o estiver conclu&iacute;da, clique em Finalizar para sair do assistente.<br><br></li>
</ol>
<p><b><a name="mac_continueinstallwithpreinstalledas"></a>Para continuar a instala&ccedil;&atilde;o com o servidor de aplicativos pr&eacute;-instalado</b></p>
<ol>
  <li>Na p&aacute;gina das op&ccedil;&otilde;es de instala&ccedil;&atilde;o do NetBeans Enterprise Pack do assistente de instala&ccedil;&atilde;o, selecione bot&atilde;o de op&ccedil;&atilde;o Instalar o servidor de aplicativos pr&eacute;-instalado e clique em Pr&oacute;ximo.<br> <br>
  </li>

<li>Na p&aacute;gina da pasta de instala&ccedil;&atilde;o do servidor de aplicativos do assistente de instala&ccedil;&atilde;o, escolha o servidor de aplicativos que deseja usar na lista de instala&ccedil;&otilde;es compat&iacute;veis ou use o bot&atilde;o Explorar para ir at&eacute; outra pasta de instala&ccedil;&atilde;o de servidor de aplicativos e selecion&aacute;-la. Em seguida clique em Pr&oacute;ximo.<span class="new"><br> <br></span></li>


<li>Se o dom&iacute;nio padr&atilde;o, <tt>domain1</tt>, j&aacute; existir no servidor de aplicativos selecionado, insira o nome de usu&aacute;rio e a senha de tal dom&iacute;nio e clique em Pr&oacute;ximo.<br> O assistente de instala&ccedil;&atilde;o verifica as informa&ccedil;&otilde;es introduzidas do nome de usu&aacute;rio e da senha.<br> <b>Observa&ccedil;&atilde;o:</b> O processo de verifica&ccedil;&atilde;o pode demorar alguns minutos.<span class="new"><br></span><br>

-ou-<br><br> Se o dom&iacute;nio padr&atilde;o, <tt>domain1</tt>, ainda n&atilde;o existir no servidor de aplicativos selecionado, adote o seguinte procedimento:<br><br>
<ol type="a">
<li>Defina o nome de usu&aacute;rio e a senha do dom&iacute;nio padr&atilde;o do servidor de aplicativos, <tt>domain1</tt>, ou aceite os padr&otilde;es e clique em Pr&oacute;ximo.<br> O nome de usu&aacute;rio e a senha padr&atilde;o s&atilde;o <tt>admin</tt> e <tt>adminadmin</tt>.<br><br></li>
<li>Verifique os valores da porta (<tt>Admin</tt>, <tt>HTTP</tt> e <tt>HTTPS</tt>) do servidor de aplicativos e altere-os se necess&aacute;rio. Em seguida clique em Pr&oacute;ximo.</li>
</ol>
<br><br></li>
<li>Verifique se a lista dos componentes que ser&atilde;o instalados est&aacute; correta e se h&aacute; espa&ccedil;o suficiente no sistema para a instala&ccedil;&atilde;o.<br><br></li>
<li>Clique em Instalar para iniciar a instala&ccedil;&atilde;o. <br><br></li>
<li>Quando a instala&ccedil;&atilde;o estiver conclu&iacute;da, clique em Finalizar para sair do assistente.<br><br></li>
</ol>

<!--<p>
<b><a name="mac_continueinstallwithoutsoaidentity"></a>To Continue the Installation Without the BPEL and Secure Web Services Modules</b>
</p>

<ol>
<li>At the NetBeans Enterprise Pack installation options page of the installation wizard select the Skip Application Server configuration radio button, and click Next.<br>
  <br></li>

<li>Verify that the list of components to be installed  is correct and that you have adequate space on your system for the installation.<br><br></li>

<li>Click Install to begin the installation.<br>
  <br></li>
</ol>

-->
</blockquote>
<div class="greybox"> <b>Observa&ccedil;&atilde;o: </b>Se tiver problemas para concluir com sucesso a instala&ccedil;&atilde;o do software, consulte <a href="#troubleshoot">Solu&ccedil;&otilde;es de problemas</a> para obter descri&ccedil;&otilde;es completas e solu&ccedil;&otilde;es sugeridas para problemas n&atilde;o solucionados que poderiam afetar o processo de instala&ccedil;&atilde;o. </div>
<br><br>

<p align="center"><a href="#top">superior</a></p>
<br>

<!-- Uninstallation -->

<h2><a name="uninstallation">Desinstala&ccedil;&atilde;o do software</a></h2>
<p>Se tiver instalado os servidor de aplicativos incorporado, a desinstala&ccedil;&atilde;o remove o NetBeans Enterprise Pack 5.5, o Sun Java System Application Server Platform Edition 9, o Project Open ESB Starter Kit e Sun Java System Access Manager do sistema. Se tiver preferido usar o servidor de aplicativos pr&eacute;-instalado, a desinstala&ccedil;&atilde;o remove o NetBeans Enterprise Pack 5.5 do sistema. Neste caso, para remover o Project Open ESB Starter Kit, voc&ecirc; deve desinstalar o servidor de aplicativos pr&eacute;-instalado.</p>

<!-- Deinstallation: Windows -->
<h3><a name="uninstall_windows">Microsoft Windows</a></h3>
<blockquote>
<p><b>Para desinstalar o software</b></p>
<ol>
<li>Feche o IDE.<br><br></li>
<li>No Painel de controle, selecione Adicionar ou remover programas, em seguida, selecione NetBeans Enterprise Pack 5.5 e clique em Alterar/Remover.<br> <br></li>
<li>Siga as instru&ccedil;&otilde;es no desinstalador.<br><br></li>
</ol>
</blockquote>
<!-- Uninstallation: Solaris and Linux -->
<h3><a name="uninstall_sollinux">Solaris OS, Linux</a></h3>
<blockquote>
<p><b>Para desinstalar o software</b></p>
<ol>
<li>Feche o IDE.<br><br></li>
<li>Navegue at&eacute; a subpasta <tt>bin/_uninst_entpack</tt> da pasta de instala&ccedil;&atilde;o do NetBeans Enterprise Pack 5.5.<br> <br></li>
<li>Execute o script <tt>uninstall.sh</tt>.<br><br></li>
</ol>
</blockquote>
<!-- UNINSTALLATION: MAC OS ---------------------------------------------->
<h3><a name="uninstall_macos">Mac OS X</a></h3>
<blockquote>
<p><b>Para desinstalar o software</b></p>
<ol>
<li>Feche o IDE.<br><br></li>
<li>Navegue at&eacute; a subpasta <tt>bin/_uninst_entpack</tt> da pasta de instala&ccedil;&atilde;o do NetBeans 5.5.<br> <br></li>
<li>Execute o arquivo execut&aacute;vel <tt>uninstall.jar</tt>.<br> <b>Observa&ccedil;&atilde;o:</b> Se a vers&atilde;o padr&atilde;o de Java do seu sistema for 1.4, n&atilde;o ser&aacute; poss&iacute;vel iniciar a desinstala&ccedil;&atilde;o com um duplo clique no arquivo <tt>.jar</tt>. Nesse caso, execute o arquivo <tt>.jar</tt> manualmente a partir da linha de comando que usa o Java 1.5.<br><br></li>
</ol>
</blockquote>

<p align="center"><a href="#top">superior</a></p>
<br>
<h2><a name="troubleshoot">Solu&ccedil;&atilde;o de problemas</a></h2>
<p>Se tiver problemas ao instalar ou executar o software, consulte a lista de problemas abaixo para ver as solu&ccedil;&otilde;es. Para obter uma lista completa dos problemas conhecidos, dos requisitos do sistema e outras informa&ccedil;&otilde;es &uacute;teis, consulte <a href="entpack_relnotes_pt_BR.html">Notas&nbsp;da&nbsp;vers&atilde;o&nbsp;do&nbsp;NetBeans&nbsp;Enterprise&nbsp;Pack&nbsp;5.5</a>. </p>

<p>Encontram-se abaixo os problemas n&atilde;o solucionados desta vers&atilde;o que podem afetar ou interromper o processo de instala&ccedil;&atilde;o: </p>
<ul>

<!-- Bug Id: 6348694 http://bt2ws.central.sun.com/CrPrint?id=6348694 - checked for TPR3 --> <!-- Bug Id: 6381305 http://bt2ws.central.sun.com/CrPrint?id=6381305 - checked for TPR3 -->
<li><b><span style="color: #045491;">O instalador n&atilde;o se inicia corretamente com pouco ou nenhum espa&ccedil;o livre em disco no diret&oacute;rio <tt>temp</tt>.</span></b>
<blockquote>
<p><strong>Descri&ccedil;&atilde;o: </strong> No Microsoft Windows, se o sistema estiver configurado para usar um diret&oacute;rio tempor&aacute;rio no drive <tt>C</tt> e este diret&oacute;rio tempor&aacute;rio n&atilde;o tiver espa&ccedil;o suficiente para os arquivos tempor&aacute;rios que o instalador necessita, o instalador notifica que n&atilde;o h&aacute; espa&ccedil;o em disco suficiente no drive <tt>C</tt>, mesmo se voc&ecirc; tiver optado por realizar a instala&ccedil;&atilde;o em outro drive. O instalador est&aacute;, na verdade, avisando que necessita mais espa&ccedil;o tempor&aacute;rio. <br> O problema encontra-se na estrutura do InstallShield.</p>
<p><strong>Solu&ccedil;&atilde;o: </strong> Inicie o instalador com o par&acirc;metro de linha de comando <tt>-is:tempdir <i>dir-temp-personalizado</i></tt>. O <tt><i>dir-temp-personalizado</i></tt> deve ter como m&iacute;nimo 130 MB de espa&ccedil;o livre em disco.</p>
</blockquote>
</li>


<!-- Bug Id: 6420381 http://bt2ws.central.sun.com/CrPrint?id=6420381-->
<li><b><span style="color: #045491;"><tt>NoClassDefFoundError: n&atilde;o foi poss&iacute;vel acessar amserver</tt> ocorre durante a instala&ccedil;&atilde;o.</span></b>
<blockquote>
<p><strong>Descri&ccedil;&atilde;o: </strong> Se tentar instalar o software pela segunda vez sem limpar o diret&oacute;rio do gerenciador de acesso, a configura&ccedil;&atilde;o do gerenciador de acesso pode falhar durante a instala&ccedil;&atilde;o.</p>
<p><strong>Solu&ccedil;&atilde;o: </strong></p>
<ul>
<li>No Microsoft Windows:<br> Exclua o diret&oacute;rio especificado: <tt><i>%SystemDrive%</i>\Documentos&nbsp;e&nbsp;configura&ccedil;&otilde;es\<i>nome-de-usu&aacute;rio</i>\AMConfig_server_amserver_</tt> e remova o arquivo <tt><i>%SystemDrive%</i>\Documentos e configura&ccedil;&otilde;es\<i>nome-de-usu&aacute;rio</i>\AMConfig_server_amserver_</tt>.<br> <br></li>
<li>No UNIX/Mac:<br> Exclua o diret&oacute;rio especificado: <tt><i>$HOME</i>/AMConfig_server_amserver_</tt> e remova o arquivo <tt><i>$HOME</i>/AMConfig_server_amserver_</tt>.</li>
</ul>
</blockquote>
</li>



<!-- Bug Id: 6383530 http://bt2ws.central.sun.com/CrPrint?id=6383530 - checked for TPR3 -->
<li><span style="color: #045491;"><b>O instalador falha ao usar as op&ccedil;&otilde;es <tt>-console</tt> e <tt>-silent</tt>.</b></span>
<blockquote>
<p><strong>Descri&ccedil;&atilde;o: </strong> Nas plataformas UNIX, se o instalador n&atilde;o puder executar o processo de instala&ccedil;&atilde;o sem o modo de gr&aacute;ficos, o pr&oacute;prio instalador sugere que voc&ecirc; o execute com as op&ccedil;&otilde;es <tt>-console</tt> e <tt>-silent</tt>. Ao tentar fazer desta maneira, o instalador falha.</p>
<p><strong>Solu&ccedil;&atilde;o: </strong> Ignore a mensagem do instalador e configura o ambiente de GUI conforme descrito abaixo para continuar a instala&ccedil;&atilde;o.<br> Este problema se deve na maioria das vezes a que a conex&atilde;o ao destino est&aacute; sendo realizada via telnet/ssh/rlogin, o que quer dizer que voc&ecirc; deve redirecionar a GUI ao sistema original. Para ter sucesso, os dois requisitos seguintes devem ser cumpridos:</p>
<ol>
<li>Um servidor X deve estar configurado e em execu&ccedil;&atilde;o no sistema a partir do qual est&aacute; realizando a conex&atilde;o.<br><br></li>
<li>A vari&aacute;vel de ambiente DISPLAY deve estar definida com o valor correto no sistema de destino. Adotando um shell bash, o valor e o comando corretos da vari&aacute;vel s&atilde;o:<br> <tt>export DISPLAY=<i>nome-da-m&aacute;quina</i>:<i>n&uacute;mero-da-exibi&ccedil;&atilde;o</i></tt><br> Em que <tt><i>n&uacute;mero-da-m&aacute;quina</i></tt> &eacute; o endere&ccedil;o IP do sistema no qual est&aacute; se conectando e <tt><i>n&uacute;mero-da-exibi&ccedil;&atilde;o</i></tt> &eacute; o n&uacute;mero da exibi&ccedil;&atilde;o, geralmente <tt>0.0</tt>. </li>
</ol>
</blockquote>
</li>

<!-- Bug Id: 6383504 http://bt2ws.central.sun.com/CrPrint?id=6383504 - checked for TPR3 -->
<li><span style="color: #045491;"><b>A instala&ccedil;&atilde;o falha ap&oacute;s a desinstala&ccedil;&atilde;o manual.</b></span>
<blockquote>
<p><strong>Descri&ccedil;&atilde;o: </strong> Se tentar instalar o produto ap&oacute;s desinstalar manualmente removendo arquivos, a instala&ccedil;&atilde;o falhar&aacute; porque os dados no registro VPD (dados vitais do produto) do InstallShield n&atilde;o foram apagados.</p>
<p><strong>Solu&ccedil;&atilde;o:</strong> Antes de iniciar uma nova instala&ccedil;&atilde;o, remova o registro VPD do InstallShield. Este registro encontra-se em <tt>%SystemDrive%\Arquivo&nbsp;de&nbsp;programas\Arquivos&nbsp;comuns\InstallShield\Universal</tt> ou em <tt>~/InstallShield</tt>.</p>
</blockquote>
</li>

<!-- Bug Id: 6383294 http://bt2ws.central.sun.com/CrPrint?id=6383294 - checked for TPR3 -->
<li><span style="color: #045491;"><b>No Mac OS X, n&atilde;o &eacute; poss&iacute;vel iniciar a instala&ccedil;&atilde;o clicando duas vezes no arquivo <tt>.jar</tt>.</b></span>
<blockquote>
<p><strong>Descri&ccedil;&atilde;o: </strong> Se a vers&atilde;o padr&atilde;o de Java do seu sistema for 1.4, n&atilde;o ser&aacute; poss&iacute;vel iniciar a instala&ccedil;&atilde;o com um duplo clique no arquivo <tt>.jar</tt>.</p>
<p><strong>Solu&ccedil;&atilde;o:</strong>  Nesse caso, execute o arquivo <tt>.jar</tt> manualmente a partir da linha de comando que usa o Java 1.5.</p>
</blockquote>
</li>

<!--Bug Id: 6379579 http://bt2ws.central.sun.com/CrPrint?id=6379579 - checked for TPR3 -->
<li><span style="color: #045491;"><b>H&aacute; exce&ccedil;&otilde;es no instalador ao executar em JRE 1.4.</b></span>
<blockquote>
<p><strong>Descri&ccedil;&atilde;o: </strong> No Microsoft Windows, se n&atilde;o houver um JDK compat&iacute;vel pr&eacute;-instalado na m&aacute;quina de destino, o iniciador InstallShield Windows permite selecionar um <tt>java.exe</tt> personalizado. Ap&oacute;s selecionar um <tt>java.exe</tt> personalizado o instalador n&atilde;o realiza valida&ccedil;&atilde;o de compatibilidade. Isso significa que se selecionar um <tt>java.exe</tt> de um JRE 1.4, que n&atilde;o &eacute; compat&iacute;vel com o instalador, voc&ecirc; encontrar&aacute; v&aacute;rias exce&ccedil;&otilde;es. O problema encontra-se na estrutura do InstallShield.</p>
<p><strong>Solu&ccedil;&atilde;o: </strong> Selecione um <tt>java.exe</tt> de um JRE 1.5. Consulte <a href="entpack_relnotes_pt_BR.html#req_sw" title="Software&nbsp;necess&aacute;rio">Software&nbsp;necess&aacute;rio</a> para obter informa&ccedil;&otilde;es sobre o download e a instala&ccedil;&atilde;o de um JDK compat&iacute;vel.</p>
</blockquote>
</li>

<!-- Bug Id: 6375086 http://bt2ws.central.sun.com/CrPrint?id=6375086 - checked for TPR3 -->
<li><span style="color: #045491;"><b>O instalador n&atilde;o se inicia corretamente no UNIX.</b></span>
<blockquote>
<p><strong>Descri&ccedil;&atilde;o: </strong>O instalador apresenta falhas ao se iniciar corretamente no UNIX quando h&aacute; pouco ou nenhum espa&ccedil;o em disco no diret&oacute;rio raiz do sistema de arquivos. O problema encontra-se na estrutura do InstallShield. Este problema foi observado em m&aacute;quinas com menos de 2,5 MB livres na raiz do sistema de arquivos.</p>
<p><strong>Solu&ccedil;&atilde;o: </strong> Libere suficiente espa&ccedil;o em disco na raiz do sistema de arquivos e reinicie o instalador.<br><br></p>
</blockquote>
</li>
</ul>

<div class="feedback-box"><a href="https://netbeans.org/about/contact_form.html?to=5&amp;subject=Feedback:%20NetBeans%20Enterprise%20Pack%205.5%20Installation%20Instructions">Envie-nos seus coment&aacute;rios</a></div>
<br style="clear:both;">

<p align="center"><a href="#top">superior</a></p>
<br> <!-- End Content Area -->


<b class="dkgrey">Consulte tamb&eacute;m</b>:


<ul>
<li><a href="entpack_relnotes_pt_BR.html">Notas da vers&atilde;o do NetBeans Enterprise Pack 5.5</a></li>
</ul>

</body>
</html>
