<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>

<meta http-equiv="content-type" content="text/html; charset=UTF-8">

<title>Notas da vers&atilde;o do NetBeans Enterprise Pack 5.5</title>
<meta name="description" content="Notas da vers&atilde;o do NetBeans Enterprise Pack 5.5">
<link rel="stylesheet" type="text/css" href="https://netbeans.org/netbeans.css" media="screen">
<meta http-equiv="Content-Language" content="pt-br">
</head>
<body>

<!-- Begin Content Area --> <a name="top"></a>

<h1>Notas da vers&atilde;o do NetBeans Enterprise Pack 5.5</h1>

<div class="articledate" style="margin-left: 0px;">&Uacute;ltima atualiza&ccedil;&atilde;o: 18 de Dezembro de 2006</div>
<blockquote>
<a name="as9u1"></a>
<p>O NetBeans Enterprise Pack 5.5 inclui m&oacute;dulos de ferramentas do esquema XML, m&oacute;dulos BPEL, m&oacute;dulos de servi&ccedil;os de seguran&ccedil;a da Web, Sun Java System Application Server Platform Edition 9 atualiza&ccedil;&atilde;o 1, Project Open ESB Starter Kit, Sun Java System Access Manager 7.1 e Sun Java System Policy Agent 2.2 para Sun Java System Application Server 9.0 atualiza&ccedil;&atilde;o 1/ Servi&ccedil;os da Web.</p>
<a name="UC"></a>
<p><b>Observa&ccedil;&atilde;o:</b> A funcionalidade UML j&aacute; n&atilde;o est&aacute; dispon&iacute;vel na vers&atilde;o final (primeira remessa a clientes) do NetBeans Enterprise Pack 5.5. Mas &eacute; oferecida separadamente na Central de atualiza&ccedil;&otilde;es autom&aacute;ticas.</p>
</blockquote>

<p><b>Conte&uacute;do</b></p>
<ul>

<li><a href="#system_requirements">Requisitos do sistema</a></li>
<li><a href="#configinfo">Informa&ccedil;&otilde;es de configura&ccedil;&atilde;o</a></li>
<li><a href="#limitations">Limita&ccedil;&otilde;es</a></li>
<li><a href="#known_issues">Problemas conhecidos</a></li>
<li><a href="#documentation">Documenta&ccedil;&atilde;o</a></li>
<li><a href="#more_information">Mais informa&ccedil;&otilde;es</a></li>
</ul>
<blockquote>
<p><b>Observa&ccedil;&atilde;o: </b> Se quiser informa&ccedil;&otilde;es sobre a instala&ccedil;&atilde;o do software inclu&iacute;do neste pacote, consulte as <a href="entpack_install_pt_BR.html">Notas da vers&atilde;o do NetBeans Enterprise Pack 5.5</a>.</p>

</blockquote>
<h2><a name="system_requirements">Requisitos do sistema</a></h2>
<blockquote>
<!--<a name="req_os"></a>-->
<h5>Sistemas operacionais suportados</h5>
<p>O NetBeans IDE 5.5 pode ser executado nos sistemas operacionais que oferecem suporte &agrave; m&aacute;quina virtual Java. Encontra-se abaixo uma lista de plataformas nas quais o NetBeans Enterprise Pack 5.5 foi testado. </p>
<ul>
<li>Microsoft Windows XP Professional SP2 ou mais recente</li>
<li>Mac OS X 10.4.5 ou mais recente</li>
<li>Red Hat Fedora Core 3 (exceto quando estiver sendo executado no local zh_CN e possivelmente em outros locais asi&aacute;ticos)</li>
<li>Solaris™ 10 Operating System (Solaris OS) 7/05 (SPARC&reg; e x86/x64 Platform Edition)</li>

</ul>
<p>O NetBeans Enterprise Pack tamb&eacute;m pode ser executado nas seguintes plataformas: </p>
<ul>
<li>Microsoft Windows 2000 Professional SP4</li>
<li>Solaris™ 8 OS (SPARC&reg; e x86/x64 Platform Edition) e Solaris™ 9 OS (SPARC&reg; e x86/x64 Platform Edition)</li>
<li>V&aacute;rias distribui&ccedil;&otilde;es do Linux</li>

</ul>
<a name="min_hw"></a>
<h5>Configura&ccedil;&atilde;o m&iacute;nima de hardware</h5>

<div class="greybox">
<p><b>Observa&ccedil;&atilde;o:</b> A resolu&ccedil;&atilde;o m&iacute;nima da tela do IDE do NetBeans &eacute; de 1024x768 pixels.</p>
</div>

<ul>
<li><b>Sistemas operacionais Microsoft Windows</b>:
<ul>
<li><b>Processador: </b>500 MHz Intel Pentium III ou equivalente</li>

<li><b>Mem&oacute;ria: </b>512 MB</li>
<li><b>Espa&ccedil;o em disco: </b>850 MB de espa&ccedil;o em disco dispon&iacute;vel</li>
</ul>
<br>
</li>
<li><b>Sistema operacional Linux</b>:
<ul>
<li><b>Processador: </b>500 MHz Intel Pentium III ou equivalente</li>
<li><b>Mem&oacute;ria: </b>512 MB</li>

<li><b>Espa&ccedil;o em disco: </b>450 MB de espa&ccedil;o em disco dispon&iacute;vel</li>
</ul>
<br>
</li>
<li><b>Solaris OS (SPARC)</b>:
<ul>
<li><b>Processador: </b> UltraSPARC II 450 MHz</li>
<li><b>Mem&oacute;ria: </b>512 MB</li>
<li><b>Espa&ccedil;o em disco: </b>450 MB de espa&ccedil;o em disco dispon&iacute;vel</li>

</ul>
<br>
</li>
<li><b>Solaris OS (x86/x64 Platform Edition)</b>:
<ul>
<li><b>Processador: </b>AMD Opteron 100 Series 1,8 GHz</li>
<li><b>Mem&oacute;ria: </b>512 MB</li>
<li><b>Espa&ccedil;o em disco: </b>450 MB de espa&ccedil;o em disco dispon&iacute;vel</li>
</ul>
<br>

</li>
<li><b>Sistema operacional Macintosh OS X</b>:
<ul>
<li><b>Processador: </b>PowerPC G4</li>
<li><b>Mem&oacute;ria: </b>512 MB</li>
<li><b>Espa&ccedil;o em disco: </b>450 MB de espa&ccedil;o em disco dispon&iacute;vel</li>
</ul>
</li>
</ul>
<a name="req_hw"></a>

<h5>Configura&ccedil;&atilde;o de hardware recomendada</h5>
<ul>
<li><b>Sistemas operacionais Microsoft Windows</b>:
<ul>
<li><b>Processador: </b>1,4 GHz Intel Pentium III ou equivalente</li>
<li><b>Mem&oacute;ria: </b>1 GB</li>
<li><b>Espa&ccedil;o em disco: </b>1 GB de espa&ccedil;o em disco dispon&iacute;vel</li>
</ul>
<br>

</li>
<li><b>Sistema operacional Linux</b>:
<ul>
<li><b>Processador: </b>1,4 GHz Intel Pentium III ou equivalente</li>
<li><b>Mem&oacute;ria: </b>1 GB</li>
<li><b>Espa&ccedil;o em disco: </b>850 MB de espa&ccedil;o em disco dispon&iacute;vel</li>
</ul>
<br>
</li>
<li><b>Solaris OS (SPARC&reg;)</b>:

<ul>
<li><b>Processador: </b>UltraSPARC IIIi 1 GHz</li>
<li><b>Mem&oacute;ria: </b>1 GB</li>
<li><b>Espa&ccedil;o em disco: </b>850 MB de espa&ccedil;o em disco dispon&iacute;vel</li>
</ul>
<br>
</li>
<li><b>Solaris OS (x86/x64 Platform Edition)</b>:
<ul>
<li><b>Processador: </b>AMD Opteron 100 Series 1,8 GHz</li>

<li><b>Mem&oacute;ria: </b>1 GB</li>
<li><b>Espa&ccedil;o em disco: </b>850 MB de espa&ccedil;o em disco dispon&iacute;vel</li>
</ul>
<br>
</li>
<li><b>Sistema operacional Macintosh OS X</b>:
<ul>
<li><b>Processador: </b>PowerPC G5</li>
<li><b>Mem&oacute;ria: </b>1 GB</li>

<li><b>Espa&ccedil;o em disco: </b>850 MB de espa&ccedil;o em disco dispon&iacute;vel</li>
</ul>
</li>
</ul>
<a name="req_sw"></a>
<h5>Software necess&aacute;rio</h5>
<p>O NetBeans Enterprise Pack 5.5 pode ser executado no Java SE Development Kit 5.0 atualiza&ccedil;&atilde;o 9 ou superior (JDK 5.0, vers&atilde;o 1.5.0_09 ou superior), que compreende o Java Runtime Environment (JRE) mais as ferramentas de desenvolvedores para compila&ccedil;&atilde;o, depura&ccedil;&atilde;o e execu&ccedil;&atilde;o de aplicativos escritos na linguagem Java. O Sun Java System Application Server Platform Edition 9 atualiza&ccedil;&atilde;o 1 foi testado com o JDK 5.0 atualiza&ccedil;&atilde;o 6.</p>
<ul>
<li>Para <b>Solaris</b>, <b>Windows</b> e <b>Linux</b>, voc&ecirc; pode fazer o download do JDK para a sua plataforma em <a href="http://java.sun.com/javase/downloads/index.jsp">http://java.sun.com/javase/downloads/index.jsp</a></li>

<li>Para <b>Mac OS X</b>, &eacute; necess&aacute;rio Java SE Development Kit 5.0 vers&atilde;o 4. Voc&ecirc; pode fazer o download do JDK no site Developer Connection da Apple. Iniciar aqui: <a href="http://developer.apple.com/java">http://developer.apple.com/java</a> (voc&ecirc; deve se registrar para fazer o download do JDK). </li>
</ul>
<a name="req_appserver"></a>
<h5>Requisitos do servidor de aplicativos Sun Java System</h5>
<p>Para poder usar os recursos de desenvolvimento do J2EE do NetBeans Enterprise Pack 5.5, voc&ecirc; deve ter o Sun Java System Application Server Platform&nbsp;Edition&nbsp;9 atualiza&ccedil;&atilde;o 1. Esse servidor de aplicativos &eacute; oferecido com o download do NetBeans Enterprise Pack 5.5.</p>
</blockquote>
<p align="center"><a href="#top">superior</a></p>

<br>

<!-- Config Info -->
<h2><a name="configinfo"></a>Informa&ccedil;&otilde;es de configura&ccedil;&atilde;o</h2>
<p>Este t&oacute;pico oferece informa&ccedil;&otilde;es sobre a configura&ccedil;&atilde;o que podem ser necess&aacute;rias para configurar o software.</p>
<blockquote>
<h5>Servidor de aplicativo Sun Java System</h5>
<p>Os valores da senha e do nome de usu&aacute;rio padr&atilde;o do dom&iacute;nio padr&atilde;o do servidor de aplicativos, <tt>domain1</tt>, s&atilde;o os seguintes: <br> nome de usu&aacute;rio: <tt>admin</tt><br>

senha: <tt>adminadmin</tt></p>
<h5>Gerenciador de acesso Sun Java System</h5>
<p>Se precisar acessar o console da administra&ccedil;&atilde;o do servidor do gerenciador de acesso, use os valores seguintes:<br> nome de usu&aacute;rio: <tt>amadmin</tt><br> senha: <tt>admin123</tt> </p>
</blockquote>

<br>

<br> <a name="limitations"></a>
<h2>Limita&ccedil;&otilde;es</h2>
<p>As limita&ccedil;&otilde;es dessa vers&atilde;o do NetBeans Enterprise Pack 5.5 s&atilde;o as seguintes:</p>
<blockquote>


<ul>
<li><a name="6478989"></a>N&atilde;o oferece suporte &agrave; edi&ccedil;&atilde;o dos atributos de seguran&ccedil;a do cliente de servi&ccedil;os da Web usados por um jsp nos aplicativos da Web do Java EE 5.</li>
<!-- http://bt2ws.central.sun.com/CrPrint?id=6478989-->


<!--https://netbeans.org/bugzilla/show_bug.cgi?id=84560-->

<li><a name="84560"></a>O perfil de s&iacute;mbolo do Liberty n&atilde;o &eacute; suportado nos servi&ccedil;os da Web do Java EE5.</li>

<!-- https://netbeans.org/bugzilla/show_bug.cgi?id=84075-->

<li><a name="84075"></a>O recurso de execu&ccedil;&atilde;o de teste de aplicativos compostos do NetBeans Enterprise Pack 5.5 usa a classpath do sistema. O que pode causar falhas na execu&ccedil;&atilde;o de teste devido &agrave; inclus&atilde;o de arquivos jar incompat&iacute;veis.</li>
<!-- https://netbeans.org/bugzilla/show_bug.cgi?id=81190-->

<li><a name="81190"></a>A valida&ccedil;&atilde;o BPEL n&atilde;o se inicia automaticamente ap&oacute;s a modifica&ccedil;&atilde;o dos arquivos WSDL.</li>
<!-- https://netbeans.org/bugzilla/show_bug.cgi?id=86882-->

<li><a name="86882"></a>Os elementos Sair, OnMessage, Receber e OnEvent n&atilde;o s&atilde;o totalmente suportados ou t&ecirc;m uso restringido nessa vers&atilde;o do BPEL Designer. <br> Consulte a se&ccedil;&atilde;o <a href="https://netbeans.org/kb/55/bpel_gsg_overview_pt_BR.html#bpel20elsnotpresent">Elementos do BPEL 2.0 que n&atilde;o est&atilde;o presentes nessa vers&atilde;o</a> do <a href="https://netbeans.org/kb/55/bpel_gsg_pt_BR.html">Guia do desenvolvedor do BPEL Designer</a> para obter uma lista completa de elementos e atributos do BPEL 2.0 que n&atilde;o est&atilde;o presentes nessa vers&atilde;o do BPEL Designer.</li>

<!-- http://bt2ws.central.sun.com/CrPrint?id=6484940-->

<li><a name="6484940"></a>O manipulador de eventos OnAlarm do tipo Repetir a cada interrompe a execu&ccedil;&atilde;o do processo BPEL.</li>



</ul>
</blockquote>

<a name="known_issues"></a>
<h2>Problemas conhecidos</h2>
<p>Essa vers&atilde;o do NetBeans Enterprise Pack 5.5 <!--is, as its name implies, a technology preview release that--> permite explorar e avaliar a nova funcionalidade no IDE. Pedimos que voc&ecirc; participe e nos d&ecirc; a sua opini&atilde;o registrando qualquer problema que tenha encontrado no sistema de rastreamento de problemas em <a href="https://netbeans.org/community/issues.html">https://netbeans.org/community/issues.html</a>.</p>

<p><b>Observa&ccedil;&atilde;o:</b> Consulte <a href="https://netbeans.org/community/releases/55/relnotes_pt_BR.html#known_issues">Notas da vers&atilde;o do NetBeans™ IDE 5.5</a> para ver a lista de problemas espec&iacute;ficos do IDE. </p>
<p>Os problemas n&atilde;o solucionados dessa vers&atilde;o s&atilde;o os seguintes: </p>
<blockquote>
<a name="issues_installation"></a>
<h5>Instala&ccedil;&atilde;o</h5>

<ul>

<!-- Bug Id: 6348694 http://bt2ws.central.sun.com/CrPrint?id=6348694 --> <!-- Bug Id: 6381305 http://bt2ws.central.sun.com/CrPrint?id=6381305 -->
<li>O instalador n&atilde;o se inicia corretamente com pouco ou nenhum espa&ccedil;o livre em disco no diret&oacute;rio <tt>temp</tt>.
<blockquote>
<p><b>Descri&ccedil;&atilde;o: </b> No Microsoft Windows, se o sistema estiver configurado para usar um diret&oacute;rio tempor&aacute;rio no drive <tt>C</tt> e este diret&oacute;rio tempor&aacute;rio n&atilde;o tiver espa&ccedil;o suficiente para os arquivos tempor&aacute;rios que o instalador necessita, o instalador notifica que n&atilde;o h&aacute; espa&ccedil;o em disco suficiente no drive <tt>C</tt>, mesmo que voc&ecirc; tenha optado por realizar a instala&ccedil;&atilde;o em outro drive. O instalador est&aacute;, na verdade, avisando que necessita mais espa&ccedil;o tempor&aacute;rio. <br>

O problema encontra-se na estrutura do InstallShield.</p>
<p><b>Solu&ccedil;&atilde;o: </b> Inicie o instalador com o par&acirc;metro de linha de comando <tt>-is:tempdir <i>dir-temp-personalizado</i></tt>. O <tt><i>dir-temp-personalizado</i></tt> deve ter no m&iacute;nimo 130 MB de espa&ccedil;o livre em disco.</p>
</blockquote>
</li>

<!-- Bug Id: 6420381 http://bt2ws.central.sun.com/CrPrint?id=6420381-->
<li><tt>NoClassDefFoundError: n&atilde;o foi poss&iacute;vel acessar amserver</tt> ocorre durante a instala&ccedil;&atilde;o.

<blockquote>
<p><b>Descri&ccedil;&atilde;o: </b> Ao tentar instalar o software pela segunda vez sem limpar o diret&oacute;rio do gerenciador de acesso, a configura&ccedil;&atilde;o do gerenciador de acesso pode falhar durante a instala&ccedil;&atilde;o.</p>
<p><b>Solu&ccedil;&atilde;o: </b></p>
<ul>
<li>No Microsoft Windows:<br> Exclua o diret&oacute;rio especificado: <tt><i>%SystemDrive%</i>\Documentos&nbsp;e&nbsp;configura&ccedil;&otilde;es\<i>nome-de-usu&aacute;rio</i>\AMConfig_server_amserver_</tt> e remova o arquivo <tt><i>%SystemDrive%</i>\Documentos e configura&ccedil;&otilde;es\<i>nome-de-usu&aacute;rio</i>\AMConfig_server_amserver_</tt>.</li>

<li>No UNIX/Mac:<br> Exclua o diret&oacute;rio especificado: <tt><i>$HOME</i>/AMConfig_server_amserver_</tt> e remova o arquivo <tt><i>$HOME</i>\AMConfig_server_amserver_</tt>.</li>
</ul>
</blockquote>
</li>




<!-- Bug Id: 6383530 http://bt2ws.central.sun.com/CrPrint?id=6383530-->
<li>O instalador falha ao usar as op&ccedil;&otilde;es <tt>-console</tt> e <tt>-silent</tt>.
<blockquote>
<p><b>Descri&ccedil;&atilde;o: </b> Nas plataformas UNIX, se o instalador n&atilde;o puder executar o processo de instala&ccedil;&atilde;o sem o modo de gr&aacute;ficos, o pr&oacute;prio instalador sugere que voc&ecirc; o execute com as op&ccedil;&otilde;es <tt>-console</tt> e <tt>-silent</tt>. Ao tentar fazer desta maneira, o instalador falha.</p>

<p><b>Solu&ccedil;&atilde;o: </b> Ignore a mensagem do instalador e configure o ambiente de GUI conforme descrito abaixo para continuar a instala&ccedil;&atilde;o.<br> Este problema se deve na maioria das vezes a que a conex&atilde;o ao destino est&aacute; sendo realizada via telnet/ssh/rlogin, o que quer dizer que voc&ecirc; deve redirecionar a GUI ao sistema original. Para ter sucesso, os dois requisitos seguintes devem ser cumpridos:</p>
<ol>
<li>Um servidor X deve estar configurado e em execu&ccedil;&atilde;o no sistema a partir do qual est&aacute; realizando a conex&atilde;o.</li>
<li>A vari&aacute;vel de ambiente DISPLAY deve estar definida com o valor correto no sistema de destino. Adotando um shell bash, o valor e o comando corretos da vari&aacute;vel s&atilde;o:<br> <tt>export DISPLAY=<i>nome-da-m&aacute;quina</i>:<i>n&uacute;mero-da-exibi&ccedil;&atilde;o</i></tt><br> Em que <tt><i>n&uacute;mero-da-m&aacute;quina</i></tt> &eacute; o endere&ccedil;o IP do sistema no qual est&aacute; se conectando e <tt><i>n&uacute;mero-da-exibi&ccedil;&atilde;o</i></tt> &eacute; o n&uacute;mero da exibi&ccedil;&atilde;o, geralmente <tt>0.0</tt>. </li>

</ol>
</blockquote>
</li>

<!-- Bug Id: 6383504 http://bt2ws.central.sun.com/CrPrint?id=6383504-->
<li>A instala&ccedil;&atilde;o falha ap&oacute;s a desinstala&ccedil;&atilde;o manual.
<blockquote>
<p><b>Descri&ccedil;&atilde;o: </b> Se tentar instalar o produto depois de ter removido arquivos durante uma desinstala&ccedil;&atilde;o manual, a instala&ccedil;&atilde;o falhar&aacute; porque os dados no registro VPD (dados vitais do produto) do InstallShield n&atilde;o ser&atilde;o apagados.</p>
<p><b>Solu&ccedil;&atilde;o:</b> Antes de iniciar uma nova instala&ccedil;&atilde;o, remova o registro VPD do InstallShield. No Microsoft Windows, este registro est&aacute; em <tt>%SystemDrive%\Arquivos&nbsp;de&nbsp;programas\Arquivos&nbsp;comuns\InstallShield\Universal</tt> e, no Linux/Solaris/Mac OS X, em <tt>~/InstallShield</tt>.</p>

<p>Observe que outros aplicativos (por exemplo, o IDE do NetBeans) podem usar o registro VPD do InstallShield para armazenar os dados de desinstala&ccedil;&atilde;o. A remo&ccedil;&atilde;o do registro VPD do InstallShield impede que tais aplicativos sejam desinstalados corretamente. &Eacute; bastante aconselh&aacute;vel desinstalar os aplicativos que usam o mecanismo de instala&ccedil;&atilde;o InstallShield Universal antes de remover o registro VPD.</p>
</blockquote>
</li>

<!-- Bug Id: 6383294 http://bt2ws.central.sun.com/CrPrint?id=6383294-->
<li>No Mac OS, n&atilde;o &eacute; poss&iacute;vel iniciar a instala&ccedil;&atilde;o com duplo clique no instalador.
<blockquote>
<p><b>Descri&ccedil;&atilde;o:</b> No Mac OS, se a vers&atilde;o padr&atilde;o de Java do seu sistema for 1.4, n&atilde;o ser&aacute; poss&iacute;vel iniciar a instala&ccedil;&atilde;o com um duplo clique no arquivo <tt>.jar</tt>.</p>
<p><b>Solu&ccedil;&atilde;o:</b> Execute o arquivo <tt>.jar</tt> manualmente a partir da linha de comando que usa o Java 1.5.</p>

</blockquote>
</li>

<!--Bug Id: 6379579 http://bt2ws.central.sun.com/CrPrint?id=6379579-->
<li>H&aacute; exce&ccedil;&otilde;es no instalador ao executar em JRE 1.4.
<blockquote>
<p><b>Descri&ccedil;&atilde;o: </b> No Microsoft Windows, se n&atilde;o houver um JDK compat&iacute;vel pr&eacute;-instalado na m&aacute;quina de destino, o iniciador InstallShield Windows permite selecionar um <tt>java.exe</tt> personalizado. Ap&oacute;s selecionar um <tt>java.exe</tt> personalizado, o instalador n&atilde;o realiza valida&ccedil;&atilde;o de compatibilidade. Isso significa que se selecionar um <tt>java.exe</tt> de um JRE 1.4, que n&atilde;o &eacute; compat&iacute;vel com o instalador, voc&ecirc; encontrar&aacute; v&aacute;rias exce&ccedil;&otilde;es. O problema encontra-se na estrutura do InstallShield.</p>

<p><b>Solu&ccedil;&atilde;o: </b> Selecione um <tt>java.exe</tt> de um JRE 1.5. Consulte <a href="#req_sw" title="Software&nbsp;necess&aacute;rio">Software&nbsp;necess&aacute;rio</a> para obter informa&ccedil;&otilde;es sobre o download e a instala&ccedil;&atilde;o de um JDK compat&iacute;vel.</p>
</blockquote>
</li>

<!-- Bug Id: 6375086 http://bt2ws.central.sun.com/CrPrint?id=6375086-->
<li>O instalador n&atilde;o se inicia corretamente no UNIX.
<blockquote>

<p><b>Descri&ccedil;&atilde;o: </b>O instalador falha ao se iniciar corretamente no UNIX quando h&aacute; pouco ou nenhum espa&ccedil;o em disco no diret&oacute;rio raiz do sistema de arquivos. O problema encontra-se na estrutura do InstallShield. Este problema foi observado em m&aacute;quinas com menos de 2,5 MB livres na raiz do sistema de arquivos.</p>
<p><b>Solu&ccedil;&atilde;o: </b> Libere suficiente espa&ccedil;o em disco na raiz do sistema de arquivos e reinicie o instalador.</p>
</blockquote>
</li>
<!-- https://netbeans.org/bugzilla/show_bug.cgi?id=86858-->

<li><a name="86858"></a><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=86858">Erro #86858: Problemas em redesenhar no MacOS X com JDK 1.6.</a>
<blockquote>
<p><b>Descri&ccedil;&atilde;o: </b>Ao arrastar uma guia, uma &aacute;rea quadrada negra tamb&eacute;m &eacute; arrastada. Ap&oacute;s soltar a guia, aparecem os problemas em redesenhar a tela de boas-vindas.</p>

<p><b>Solu&ccedil;&atilde;o: </b> Defina <tt>-J-Dapple.awt.graphics.UseQuartz=true</tt> ou use o Java 1.5 para executar o IDE (ou <tt> _select_ Java 1.5</tt> durante a instala&ccedil;&atilde;o do NetBeans Enterprise Pack).</p>
</blockquote>
</li>

</ul>








<a name="issues_orchestration"></a>
<h5>BPEL</h5>

<ul>





<!-- Bug Id: 6478483  http://monaco.sfbay/detail.jsf?cr=6478483-->

<li><a name="6478483"></a>As express&otilde;es prefixadas e n&atilde;o-prefixadas se misturam ao editar uma vers&atilde;o mais antiga da ferramenta BPEL.
  <blockquote>

<p>
<b>Descri&ccedil;&atilde;o:</b>  Hoje todas as express&otilde;es xpath criadas na ferramenta BPEL t&ecirc;m prefixo de nome de espa&ccedil;o. Em todas as vers&otilde;es anteriores da ferramenta, as express&otilde;es xpath n&atilde;o foram prefixadas com espa&ccedil;o de nome. Se editar um BPEL mais antigo (criado com uma vers&atilde;o mais antiga da ferramenta) e lhe adicionar novas atribui&ccedil;&otilde;es, as express&otilde;es prefixadas e n&atilde;o-prefixadas se misturar&atilde;o visto que o mecanismo n&atilde;o pode manipular esta mistura. Pode ocorrer a seguinte combina&ccedil;&atilde;o de problemas:</p>
<ul>
<li>
Voc&ecirc; n&atilde;o consegue obter os resultados esperados porque as express&otilde;es n&atilde;o-prefixadas n&atilde;o podem devolver um resultado.</li>
<li>
Pode ocorrer uma exce&ccedil;&atilde;o devido a que o c&oacute;digo espera que um resultado seja devolvido e devido a que a aus&ecirc;ncia de prefixo faz com que nenhum resultado seja devolvido.</li>
</ul>
<p>
<b>Solu&ccedil;&atilde;o:</b> Edite manualmente as express&otilde;es n&atilde;o-prefixadas a fim de adicionar um prefixo.</p>

  </blockquote>
</li>
<!-- http://monaco.sfbay/detail.jsf?cr=6479743-->

<li><a name="6479743"></a>Erros &quot;Encontrada atividade Responder inesperada&quot; no mecanismo de servi&ccedil;os BPEL durante a execu&ccedil;&atilde;o de teste de longevidade JBI.
  <blockquote>
<p><b>Descri&ccedil;&atilde;o: </b> O erro ao lado do servidor <tt>Encontrada atividade Responder inesperada. Causa poss&iacute;vel: v&aacute;rias atividades responder para dada atividade receber.</tt> ocorre ao executar o projeto de refer&ecirc;ncia em um ambiente multissegmentado, isto &eacute;: </p>
<ul>

<li>O BPEL-SE est&aacute; configurado com mais de 1 segmento (o padr&atilde;o s&atilde;o 10 segmentos)</li>
<li>O BPEL-SE est&aacute; sendo executado em uma m&aacute;quina com multiprocessador (deve ocorrer tamb&eacute;m em uma m&aacute;quina muito potente com CPU simples)</li>
</ul>
<p>
Este problema pode ocorrer em qualquer processo comercial que recebe uma falha de outro processo comercial ou do servi&ccedil;o da Web externo e est&aacute; sendo executado em um ambiente multissegmentado. <br> Visto que o projeto de refer&ecirc;ncia tem um processo comercial que recebe uma falha de outro processo comercial, este erro &eacute; exibido durante a execu&ccedil;&atilde;o do teste de longevidade. <br> O problema se reproduz no Solaris e no Windows.

</p>
<p><b>Solu&ccedil;&atilde;o: </b> Altere o projeto de refer&ecirc;ncia de modo que os processos comerciais n&atilde;o se comuniquem usando falhas, mas sim usando respostas normais.</p>
</blockquote>

</li>
<!-- http://monaco.sfbay/detail.jsf?cr=6481797-->

<li><a name="6481797"></a>Os processos BPEL continuam em execu&ccedil;&atilde;o depois que a execu&ccedil;&atilde;o de teste &eacute; conclu&iacute;da.
  <blockquote>
<p><b>Descri&ccedil;&atilde;o: </b>O tempo de execu&ccedil;&atilde;o atual n&atilde;o oferece suporte aos tempos-limites na execu&ccedil;&atilde;o de um processo. Isso faz com que o processo comercial espere um evento determinado por um per&iacute;odo ilimitado.</p>
<p><b>Solu&ccedil;&atilde;o: </b>Considere o uso das atividades Selecionar com as ramifica&ccedil;&otilde;es onAlarm onde aplic&aacute;vel.</p>
</blockquote>
</li>
<li><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=79530">Erro #79530: O mapeador n&atilde;o &eacute; atualizado ap&oacute;s a adi&ccedil;&atilde;o de um novo elemento em um arquivo de esquema XML.</a>
  <blockquote>

<p>
<b>Descri&ccedil;&atilde;o:</b> O mapeador n&atilde;o &eacute; atualizado ap&oacute;s a adi&ccedil;&atilde;o de um novo elemento em um arquivo XSD.</p>

<p>
<b>Solu&ccedil;&atilde;o:</b> Feche e reabra a janela Mapeador. </p>

  </blockquote>
</li>

<li><a name="80208"></a><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=80208">Erro #80208: No UNIX, &agrave;s vezes n&atilde;o &eacute; poss&iacute;vel editar o campo de texto INPUT da literal de seq&uuml;&ecirc;ncia.</a>

  <blockquote>

<p>
<b>Descri&ccedil;&atilde;o:</b> No UNIX, ap&oacute;s clicar duas vezes no campo de texto na literal de seq&uuml;&ecirc;ncia, a caixa fica edit&aacute;vel por alguns segundos e, em seguida, volta ao modo n&atilde;o edit&aacute;vel.</p>

<p>
<b>Solu&ccedil;&atilde;o:</b> Clique duas vezes no campo de texto da caixa da literal de seq&uuml;&ecirc;ncia e clique rapidamente em um espa&ccedil;o em branco dentro do campo do editor do mapeador BPEL (antes que o campo de texto volte ao modo n&atilde;o edit&aacute;vel). A caixa da literal de seq&uuml;&ecirc;ncia permanecer&aacute; no modo de edi&ccedil;&atilde;o.</p>

  </blockquote>
</li>
<li><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=81298">Erro #81298: O modelo WSDL n&atilde;o pode resolver o portType.</a>
  <blockquote>

<p>
<b>Descri&ccedil;&atilde;o:</b> O modelo WSDL n&atilde;o pode resolver o portType quando o principal WSDL importado tem o mesmo targetNamespace.</p>

<p>
<b>Solu&ccedil;&atilde;o:</b> Atribua um espa&ccedil;o de nome para o arquivo WSDL importado, diferente do espa&ccedil;o de nome do arquivo WSDL de importa&ccedil;&atilde;o. </p>
  </blockquote>

</li>



<li> <a href="https://netbeans.org/bugzilla/show_bug.cgi?id=81528">Erro #81528: Erro de gera&ccedil;&atilde;o e valida&ccedil;&atilde;o ao importar arquivos WSDL.</a>
  <blockquote>

<p>
<b>Descri&ccedil;&atilde;o:</b> A importa&ccedil;&atilde;o de um arquivo WSDL para outro arquivo WSDL n&atilde;o &eacute; validada. A mensagem de erro correspondente &eacute; exibida.</p>

<p>
<b>Solu&ccedil;&atilde;o:</b> V&aacute; &agrave; exibi&ccedil;&atilde;o Fonte do editor WSDL, remova a importa&ccedil;&atilde;o e espa&ccedil;o de nome que acabaram de ser adicionados. V&aacute; ao modo em &aacute;rvore da exibi&ccedil;&atilde;o WSDL e adicione a mesma importa&ccedil;&atilde;o novamente.</p>
  </blockquote>
</li>




<!--https://netbeans.org/bugzilla/show_bug.cgi?id=87698-->
<li><a name="82612"></a><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=82612">Erro #82612: Os testes falham no projeto BluePrint4Application.</a>
<blockquote>
<p><b>Descri&ccedil;&atilde;o: </b>Depois de implantar o projeto BluePrint4Application no servidor de aplicativos, os testes de amostra ir&atilde;o falhar se n&atilde;o forem executados em uma ordem determinada. A causa disso se deve ao uso de correla&ccedil;&atilde;o nos processos BPEL BluePrint 4.</p>
<p><b>Solu&ccedil;&atilde;o: </b> Execute os testes do BluePrint4Application em qualquer uma das ordens especificadas abaixo:</p>
<ul><li>poServiceRequest -&gt; poRequestCancel<br></li>

<li>poServiceRequest -&gt; poRequestConfirm</li></ul>

</blockquote>
</li>




<!-- https://netbeans.org/bugzilla/show_bug.cgi?id=84622 -->
<li><a name="84622"></a><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=84622">Erro #84622: O IDE n&atilde;o reverte a recupera&ccedil;&atilde;o do(s) arquivo(s) WSDL ap&oacute;s cancelar a caixa de di&aacute;logo PartnerLink.</a>
<blockquote>
<p><b>Descri&ccedil;&atilde;o: </b>Ao cancelar a caixa de di&aacute;logo PartnerLink que aparece ao se arrastar um arquivo WSDL ou um n&oacute; do servi&ccedil;o da Web de um projeto NetBeans para um diagrama, o IDE n&atilde;o reverte a recupera&ccedil;&atilde;o do(s) arquivo(s) WSDL.</p>
<p>
<b>Solu&ccedil;&atilde;o:</b> Se estes arquivos n&atilde;o forem necess&aacute;rios para o projeto, simplesmente exclua-os manualmente na janela Projetos, como faria com outro recurso do projeto.</p>

</blockquote>
</li>
<li><a name="86499"></a><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=86499">Erro #86499: Os processos BPEL travam no caso em que a interface de um servi&ccedil;o de parceiro sofre altera&ccedil;&otilde;es.</a>
  <blockquote>

<p>
<b>Descri&ccedil;&atilde;o:</b> Se a interface do servi&ccedil;o de parceiro sofrer altera&ccedil;&otilde;es, por exemplo, quando a assinatura de uma opera&ccedil;&atilde;o de servi&ccedil;o da Web &eacute; alterada e voc&ecirc; n&atilde;o tiver importado o arquivo WSDL modificado, o processo BPEL trava.</p>

<p>
<b>Solu&ccedil;&atilde;o:</b> Importe um novo arquivo WSDL e reimplante o aplicativo. Pode ser necess&aacute;rio reiniciar o mecanismo de servi&ccedil;os BPEL.</p>
  </blockquote>
</li>



<li><a name="87221"></a><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=87221">Erro #87221: Ao excluir uma propriedade de um conjunto de correla&ccedil;&otilde;es no navegador, a propriedade &eacute; incorretamente exclu&iacute;da do WSDL.</a>
  <blockquote>

<p>
<b>Descri&ccedil;&atilde;o:</b> Ao excluir uma propriedade de um conjunto de correla&ccedil;&otilde;es usando os comandos do menu pop-up no navegador, a propriedade &eacute; incorretamente exclu&iacute;da do arquivo WSDL.</p>

<p>

<b>Solu&ccedil;&atilde;o:</b> Use o editor de propriedades do conjunto de correla&ccedil;&otilde;es para excluir corretamente uma propriedade de um conjunto de correla&ccedil;&otilde;es.</p>
  </blockquote>
</li>

<!-- https://netbeans.org/bugzilla/show_bug.cgi?id=87624-->
<li><a name="87624"></a><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=87624">Erro #87624: Chamar a&ccedil;&otilde;es do navegador do BPEL interrompido causa exce&ccedil;&otilde;es e o IDE trava.</a>

  <blockquote>

<p>
<b>Descri&ccedil;&atilde;o:</b> Ao chamar a&ccedil;&otilde;es do navegador de um BPEL interrompido s&atilde;o lan&ccedil;adas exce&ccedil;&otilde;es ou o IDE trava.</p>

<p>
<b>Solu&ccedil;&atilde;o:</b> Todas as a&ccedil;&otilde;es devem ser desativadas no navegador quando o BPEL for interrompido. N&atilde;o chame as a&ccedil;&otilde;es do BPEL interrompido a partir do navegador. Primeiro corrija o BPEL.</p>
  </blockquote>
</li>

<li><a name="87719"></a><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=87719">Erro #87719: A mensagem Imposs&iacute;vel mostrar diagrama aparece quando o processo BPEL &eacute; v&aacute;lido.</a>
  <blockquote>

<p>

<b>Descri&ccedil;&atilde;o:</b> A mensagem Imposs&iacute;vel mostrar diagrama &eacute; exibida embora o arquivo BPEL seja v&aacute;lido.</p>

<p>
<b>Solu&ccedil;&atilde;o:</b> Reinicie o IDE.</p>
  </blockquote>
</li>
<li><a name="90292"></a><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=90292">Erro #90292: NetBeans Visual Web Pack 5.5 interrompe a funcionalidade arrastar-e-soltar nos projetos BPEL/SOA do Enterprise Pack 5.5.</a>
  <blockquote>

<p>

<b>Descri&ccedil;&atilde;o:</b> NetBeans Visual Web Pack 5.5 interrompe a funcionalidade arrastar-e-soltar nos projetos BPEL/SOA do Enterprise Pack 5.5.</p>

<p>
<b>Solu&ccedil;&atilde;o:</b> Escolha Ferramentas &gt; Central de atualiza&ccedil;&otilde;es no menu principal do NetBeans IDE para iniciar o assistente Central de atualiza&ccedil;&otilde;es. Instalar a Atualiza&ccedil;&atilde;o 1 do NetBeans Visual Web Pack 5.5 vers&atilde;o final atrav&eacute;s da Central de atualiza&ccedil;&otilde;es. <br> Observe que, embora a Atualiza&ccedil;&atilde;o 1 possa ser vista pelos usu&aacute;rios da Visualiza&ccedil;&atilde;o da tecnologia NetBeans Visual Web Pack 5.5, voc&ecirc; precisa desinstalar a vers&atilde;o de Visualiza&ccedil;&atilde;o de tecnologia e fazer o download e instalar a vers&atilde;o final do NetBeans Visual Web Pack 5.5 na p&aacute;gina de <a href="http://services.netbeans.org/downloads/all.php?b_id=2283" target="_blank">Download do NetBeans Visual Web Pack 5.5</a> para que a Atualiza&ccedil;&atilde;o 1 funcione.</p>
  </blockquote>
</li>


</ul>



<a name="issues_identity"></a>
<h5>Servi&ccedil;os da Web seguros</h5>


<ul>

<!-- Bug Id: 6457039 http://bt2ws.central.sun.com/CrPrint?id=6457039 -->

<li><a name="6457039"></a> O gerenciador de acesso n&atilde;o &eacute; suportado pela vers&atilde;o 1.6 do Java.
  <blockquote>
<p><b>Descri&ccedil;&atilde;o:</b> O gerenciador de acesso n&atilde;o &eacute; suportado pela vers&atilde;o 1.6 do Java.</p>

<p><b>Solu&ccedil;&atilde;o: </b> Use Java 1.5.x para executar o gerenciador de acesso.</p>
</blockquote>
</li>


<!-- Bug Id: http://monaco.sfbay/detail.jsf?cr=6464322 -->
<li><a name="am"></a>H&aacute; problemas com o configurador AM e com o instalador em rela&ccedil;&atilde;o ao AMConfig.properties.
<blockquote>
<p><b>Descri&ccedil;&atilde;o: </b>Se a configura&ccedil;&atilde;o do servidor do gerenciador de acesso for alterada ap&oacute;s a instala&ccedil;&atilde;o, o arquivo AMConfig.properties se modifica para refletir tais altera&ccedil;&otilde;es. Isso pode causar discrep&acirc;ncias entre o servidor do gerenciador de acesso configurado e o arquivo AMConfig.properties fazendo com que o IDE n&atilde;o possa se comunicar com o servidor do gerenciador de acesso atrav&eacute;s do SDK do cliente.</p>
<p>
<b>Solu&ccedil;&atilde;o:</b> Sincronize manualmente o arquivo AMConfig.properties do cliente para que reflita as informa&ccedil;&otilde;es apropriadas do servidor do gerenciador de acesso.</p>

</blockquote>
</li>

<li><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=82233">Erro #82233: A execu&ccedil;&atilde;o do aplicativo ativado com servi&ccedil;os de seguran&ccedil;a da Web com perfil do Liberty falha se o URL estiver baseado em &quot;localhost&quot;.</a>
  <blockquote>
<p><b>Descri&ccedil;&atilde;o: </b>A execu&ccedil;&atilde;o do aplicativo ativado com servi&ccedil;os de seguran&ccedil;a da Web com perfil do Liberty falha se o URL estiver baseado em &quot;localhost&quot;. Quando o Executar projeto &eacute; chamado a partir do IDE, o URL padr&atilde;o gerado pelo IDE inclui localhost. </p>
<p><b>Solu&ccedil;&atilde;o: </b>Acesse o cliente de finan&ccedil;as a partir do navegador com o nome de host que n&atilde;o inclua o nome de localhost.</p>
</blockquote>
</li>

<!--https://netbeans.org/bugzilla/show_bug.cgi?id=83497 -->

<li><a name="83497"></a><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=83497">Erro #83497: A edi&ccedil;&atilde;o dos perfis do gerenciador de acesso pode n&atilde;o estar dispon&iacute;vel se as configura&ccedil;&otilde;es do proxy do sistema forem usadas no IDE.</a>
  <blockquote>
<p><b>Descri&ccedil;&atilde;o: </b> No Windows, o NetBeans Enterprise Pack 5.5 usa as configura&ccedil;&otilde;es de proxy do Internet Explorer como configura&ccedil;&otilde;es do proxy do sistema. Isso pode provocar falha na conex&atilde;o e desativar a edi&ccedil;&atilde;o dos perfis do gerenciador de acesso se as configura&ccedil;&otilde;es de proxy do Internet Explorer n&atilde;o forem corretas. </p>

<p><b>Solu&ccedil;&atilde;o: </b> Defina as suas pr&oacute;prias configura&ccedil;&otilde;es de proxy no IDE.  Abra a caixa de di&aacute;logo Ferramentas &gt; Op&ccedil;&otilde;es, alterne para Proxy HTTP e insira as configura&ccedil;&otilde;es de proxy corretas.</p>

</blockquote>
</li>
<li><a name="86234"></a><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=86234">Erro #86234: Os aplicativos da Web J2EE 1.4 incorporados em um EAR e que usam a seguran&ccedil;a de perfil de s&iacute;mbolo do Liberty exigem adi&ccedil;&atilde;o manual do mapeamento da fun&ccedil;&atilde;o de seguran&ccedil;a.</a>

  <blockquote>
<p><b>Descri&ccedil;&atilde;o: </b>Ao adicionar m&oacute;dulos J2EE com seguran&ccedil;a de perfil de s&iacute;mbolo do Liberty ao projeto de aplicativo empresarial, as fun&ccedil;&otilde;es adicionadas aos m&oacute;dulos J2EE precisam ser adicionadas manualmente no aplicativo empresarial para que a seguran&ccedil;a atue do in&iacute;cio ao fim.</p>

<p><b>Solu&ccedil;&atilde;o: </b> Adicione manualmente as linhas abaixo em EnterpriseApplication-&gt;Arquivos de configura&ccedil;&atilde;o-&gt;sun-application.xml usando o editor de texto xml.</p>

<pre class="examplecode">
&lt;security-role-mapping&gt;
	&lt;role-name&gt;USU&Aacute;RIOS_AUTENTICADOS&lt;/role-name&gt;
	&lt;principal-name&gt;USU&Aacute;RIOS_AUTENTICADOS&lt;/principal-name&gt;
&lt;/security-role-mapping&gt;
</pre>

</blockquote>
</li>


<!--https://netbeans.org/bugzilla/show_bug.cgi?id=87160-->

<li><a name="87160"></a><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=87160">Erro #87160: O registro do Liberty falha durante a implanta&ccedil;&atilde;o WSP em um sistema remoto se h&aacute; diferen&ccedil;a nas configura&ccedil;&otilde;es do rel&oacute;gio do sistema.</a>
  <blockquote>
<p><b>Descri&ccedil;&atilde;o:</b> Trata-se de um recurso do gerenciador de acesso. H&aacute; uma configura&ccedil;&atilde;o em AMConfig.properties de um limite de tempo-limite na resposta do servi&ccedil;o de descoberta. A solicita&ccedil;&atilde;o de registro &eacute; rejeitada, segundo uma &quot;mensagem antiga&quot;, devido &agrave; diferen&ccedil;a entre os rel&oacute;gios do sistema.</p>

<p><b>Solu&ccedil;&atilde;o: </b> Sincronize os rel&oacute;gios do sistema.</p>
</blockquote>
</li>



</ul>

<a name="xml"></a>
<h5>Ferramentas do esquema XML</h5>


<ul>

<!-- https://netbeans.org/bugzilla/show_bug.cgi?id=83610-->


<li><a name="83610"></a><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=83610">Erro #83610: A exclus&atilde;o de v&aacute;rios n&oacute;s selecionados &agrave;s vezes falha na exibi&ccedil;&atilde;o em coluna.</a>

  <blockquote>
<p><b>Descri&ccedil;&atilde;o:</b> Ao usar a exibi&ccedil;&atilde;o em coluna, &agrave;s vezes somente um dos n&oacute;s selecionados &eacute; removido ap&oacute;s o comando Excluir do menu pop-up ter sido chamado.</p>
<p><b>Solu&ccedil;&atilde;o:</b> Selecione v&aacute;rios n&oacute;s e use a tecla Delete ou selecione sucessivamente um &uacute;nico n&oacute; e escolha Excluir no menu de contexto ou use o editor em &aacute;rvore.</p>
</blockquote>
</li>
</ul>

<a name="issues_modules"></a>
<h5>M&oacute;dulos BPEL, de servi&ccedil;os de seguran&ccedil;a da Web e de ferramentas do esquema XML</h5>


<p>Os problemas descritos abaixo ocorrem com o IDE ao usar os m&oacute;dulos do NetBeans Enterprise Pack 5.5.</p>

<ul>
<li> O IDE n&atilde;o reconhece os projetos criados sob diret&oacute;rio raiz &quot;/&quot;. <!-- 6394332 P1 MAC: There is no project tree in web report in Safari -->

<blockquote>
<p>
<b>Descri&ccedil;&atilde;o:</b> No Mac OS X, no Solaris e no Linux, o IDE n&atilde;o reconhece os projetos criados sob o diret&oacute;rio raiz <code>&quot;/&quot;</code>.</p>

<p>
<b>Solu&ccedil;&atilde;o:</b> Crie projetos em uma pasta.</p>
</blockquote>
</li>
<li>Os caracteres n&atilde;o s&atilde;o exibidos adequadamente em alguns locais asi&aacute;ticos.
<blockquote>
<p><b>Descri&ccedil;&atilde;o:</b> Quando o IDE &eacute; executado no Red Hat Fedora Core 3 no local zh_CN e possivelmente em outros locais asi&aacute;ticos, o texto pode n&atilde;o ser leg&iacute;vel devido a problemas de renderiza&ccedil;&atilde;o. Esse problema se deve &agrave; quest&atilde;o de suporte de fontes do JDK na distribui&ccedil;&atilde;o do Fedora Core, de modo que tal problema tamb&eacute;m pode ocorrer em outros aplicativos Java executados no Fedora Core.</p>
<p><b>Solu&ccedil;&atilde;o: </b>N&atilde;o existe solu&ccedil;&atilde;o segura para o problema de renderiza&ccedil;&atilde;o no Red Hat Fedora Core 3, de forma que o melhor &eacute; usar outro sistema operacional ou distribui&ccedil;&atilde;o do Linux nesses locais. Verificamos que este problema n&atilde;o ocorre no Red Hat Enterprise Linux 3.</p>
</blockquote></li>

</ul>




</blockquote>

<p align="center"><a href="#top">superior</a></p>

<br> <a name="documentation"></a>
<h2>Documenta&ccedil;&atilde;o</h2>
<blockquote>
<p>A documenta&ccedil;&atilde;o da vers&atilde;o do NetBeans Enterprise Pack 5.5 encontra-se na forma de guias com base na Web e do sistema de ajuda do IDE. Voc&ecirc; pode usar os documentos seguintes como introdu&ccedil;&atilde;o:</p>
<ul>
<li><a href="entpack_install_pt_BR.html">Instru&ccedil;&otilde;es de instala&ccedil;&atilde;o do NetBeans Enterprise Pack 5.5</a></li>
<li><a href="https://netbeans.org/kb/55/index_pt_BR.html">Documenta&ccedil;&atilde;o do NetBeans 5.5</a></li>
</ul>
</blockquote>
<p align="center"><a href="#top">superior</a></p>
<br>

<a name="more_information"></a>
<h2>Mais informa&ccedil;&otilde;es</h2>
<blockquote>
<p>Voc&ecirc; pode encontrar artigos e outras informa&ccedil;&otilde;es &uacute;teis no site do NetBeans Enterprise Pack. Para mais informa&ccedil;&otilde;es, visite <a href="http://enterprise.netbeans.org/">http://enterprise.netbeans.org/</a>. </p>
<p>Voc&ecirc; tamb&eacute;m pode encontrar informa&ccedil;&otilde;es &uacute;teis no site do projeto NetBeans. Visto que o NetBeans &eacute; um projeto de c&oacute;digo aberto, o site da Web tamb&eacute;m oferece acesso ao c&oacute;digo-fonte, a um banco de dados de erros, informa&ccedil;&otilde;es sobre a cria&ccedil;&atilde;o de m&oacute;dulos do NetBeans e muito mais. Para mais informa&ccedil;&otilde;es, visite <a href="https://netbeans.org/">https://netbeans.org/</a>. </p>
</blockquote>

<div class="feedback-box"><a href="https://netbeans.org/about/contact_form.html?to=5&amp;subject=Feedback:%20NetBeans%20Enterprise%20Pack%205.5%20Release%20Notes">Envie-nos seus coment&aacute;rios</a></div>
<br style="clear:both;">

<p align="center"><a href="#top">superior</a></p>
<br> <!-- sample top link
            <p align="center"><a href="#top">top</a></p><br>
            --> <!-- sample note box
            <div class="greybox">
            <p><b>Note:</b> Note text</p>
            </div>
            --> <!-- End Content Area -->



</body>
</html>

