<DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Guia de instala&ccedil;&atilde;o do Mobility Pack do NetBeans para CDC 5.5</title>
<link rel="stylesheet" type="text/css" href="../../../netbeans.css">

</head>
<body>
<a name=top></a>
<h1>Guia de instala&ccedil;&atilde;o do Mobility Pack do NetBeans para CDC 5.5</h1>
<p>O Mobility Pack do NetBeans para CDC 5.5 oferece um ambiente para a constru&ccedil;&atilde;o r&aacute;pida de aplicativos Java Micro Edition (Java ME) compat&iacute;veis com dispositivos que usam Connected Device Configuration (CDC) e os perfis Personal, Foundation e AGUI. </p>
<p><b>Conte&uacute;do</b></p>
<ul>
  <li> <a href="#prerequisites" title="Pr&eacute;-requisitos">Pr&eacute;-requisitos</a>  </li>
  <li> <a href="#installation" title="Instalando o software">Instalando o software</a> </li>
  <li><a href="#emulators">Instalando as plataformas do emulador</a></li>
  <li> <a href="#uninstallation" title="Desinstalando o software">Desinstalando o software</a>  </li>
  <li> <a href="#troubleshoot" title="Solu&ccedil;&atilde;o de problemas">Solu&ccedil;&atilde;o de problemas</a>  </li>
</ul>
<p><b>Observa&ccedil;&atilde;o:</b> Para obter informa&ccedil;&otilde;es sobre os requisitos do sistema do software inclu&iacute;do no pacote, consulte as <a href="relnotes-mobilitycdc_pt_BR.html">Notas de vers&atilde;o do Mobility Pack do NetBeans para CDC 5.5.1</a>.</p>
<h2><a name=prerequisites></a>Pr&eacute;-requisitos</h2>
<p>Este t&oacute;pico especifica os pr&eacute;-requisitos que devem ser atendidos antes de voc&ecirc; instalar o Mobility Pack do NetBeans para CDC 5.5. </p>
<blockquote>
  <h3>Software necess&aacute;rio</h3>
  <p>Os requisitos de hardware, software e sistema operacional est&atilde;o detalhados nas <a href="relnotes-mobilitycdc_pt_BR.html">Notas de vers&atilde;o do Mobility Pack do NetBeans para CDC 5.5</a>.</p>
  <p>Voc&ecirc; precisar&aacute; ter os softwares a seguir instalados antes de instalar o Mobility Pack do NetBeans para CDC 5.5.</p>
  <ul>
    <li><a href="http://java.sun.com/javase/downloads/index.jsp" target="_blank">Java SE Development Kit (JDK) 5.0</a></li>
    <li><a href="http://services.netbeans.org/downloads/index.php" target="_blank">NetBeans IDE 5.5</a></li>
  </ul>
  <p>O Sun Java Toolkit para CDC &eacute; integrado no Mobility Pack do NetBeans. Entretanto, se voc&ecirc; programar aplicativos para outras plataformas compat&iacute;veis, ser&aacute; necess&aacute;rio fazer o download e instalar um ou mais dos SDKs a seguir:</p>
  <ul>
    <li>Ricoh
      <ul>
        <li>Emulador de arquitetura de software incorporado (registro necess&aacute;rio para <a href="http://www.ricoh.com/esa/index.html">download</a>)</li>
      </ul>
    </li>
    <li>Sony Ericsson
      <ul>
        <li>UIQ 3 SDK (logon necess&aacute;rio para <a href="http://developer.uiq.com/">download</a>)</li>
        <li>Pacote de extens&atilde;o M600 para UIQ 3 SDK Beta 3 (<a href="http://developer.sonymobile.com/downloads/sdks/">download</a>)</li>
        <li>Pacote de extens&atilde;o P990 para UIQ 3 SDK Beta 3 (<a href="http://developer.sonymobile.com/downloads/sdks/">download</a>)</li>
      </ul>
    </li>
    <li>Nokia
      <ul>
        <li>Plataforma Nokia Series 80 SDK para sistema operacional Symbian, para Java, perfil Personal (<a href="http://www.forum.nokia.com/info/sw.nokia.com/id/449a2f84-2a8a-44fa-a7f4-93b53cb9c89a/Series_80_Platform_SDK_s_for_Symbian_OS_for_Java.html">download</a>)
        </li>
      </ul>
    </li>
    <li> SavaJe
      <ul>
        <li>
          O sistema operacional SavaJe (registro necess&aacute;rio para download)<br> <br>
        </li>
      </ul>
    </li>
  </ul>
</blockquote>

<p align=center><a href="#top">superior</a></p>
<h2><a name=installation></a>Instala&ccedil;&atilde;o do software</h2>
<p>A seguir h&aacute; instru&ccedil;&otilde;es para a instala&ccedil;&atilde;o do Mobility Pack do NetBeans para CDC 5.5. Estas instru&ccedil;&otilde;es presumem que voc&ecirc; j&aacute; instalou o <a href="http://java.sun.com/javase/downloads/index.jsp">Java SE Development Kit</a> e o <a href="https://netbeans.org/community/releases/55/install_pt_BR.html">NetBeans IDE 5.5</a>.
<blockquote>
  <p><b>Para instalar o Mobility Pack do NetBeans para CDC 5.5:</b></p>

  <ol>
    <li> Fa&ccedil;a o download do arquivo do instalador no endere&ccedil;o <a href="http://services.netbeans.org/downloads/index.php?rs=11&p=10">http://services.netbeans.org/downloads/index.php?rs=11&amp;p=10</a></li>
    <li>Navegue em seu sistema at&eacute; o local do arquivo do instalador e clique duas vezes no &iacute;cone do instalador para inici&aacute;-lo. </li>
    <li> Na p&aacute;gina de boas-vindas do assistente para instala&ccedil;&atilde;o, clique em Pr&oacute;ximo. </li>
    <li> Aceite o contrato de licen&ccedil;a e clique em Pr&oacute;ximo. </li>
    <li> Na p&aacute;gina do diret&oacute;rio de instala&ccedil;&atilde;o do assistente para instala&ccedil;&atilde;o, especifique o local de instala&ccedil;&atilde;o do NetBeans IDE 5.5. </li>
    <li> O assistente para instala&ccedil;&atilde;o procura as instala&ccedil;&otilde;es compat&iacute;veis do JDK. Se o JDK n&atilde;o estiver no local padr&atilde;o, voc&ecirc; precisar&aacute; especificar o local do Java JDK 1.5.0 ou superior. Voc&ecirc; tamb&eacute;m pode digitar o caminho de outro JDK instalado ou usar o bot&atilde;o Explorar para ir at&eacute; outra instala&ccedil;&atilde;o e selecion&aacute;-la. </li>
    <li>Quando a instala&ccedil;&atilde;o estiver conclu&iacute;da, clique em Finalizar para sair do assistente.</li>
  </ol>
<p>O diret&oacute;rio de projeto padr&atilde;o &eacute; <tt>C:\Documentos e configura&ccedil;&otilde;es\<i>nome de usu&aacute;rio</i></tt>. Se voc&ecirc; desinstalar o Mobility Pack do NetBeans para CDC, esse diret&oacute;rio n&atilde;o ser&aacute; exclu&iacute;do, e ser&aacute; identificado da pr&oacute;xima vez que voc&ecirc; instalar o Mobility Pack do NetBeans para CDC.</p>
<div class=greybox>
    <p><b>Observa&ccedil;&atilde;o: </b>Se voc&ecirc; encontrar problemas durante a instala&ccedil;&atilde;o do software, consulte <a href="#troubleshoot">Solu&ccedil;&atilde;o de problemas</a> para obter descri&ccedil;&otilde;es completas e solu&ccedil;&otilde;es sugeridas para problemas n&atilde;o resolvidos que poderiam afetar a instala&ccedil;&atilde;o.</p>
  </div>
    <p>&nbsp;</p>
    <p><b>Instalando o Mobility Pack do NetBeans para CDC 5.5 em plataformas que n&atilde;o s&atilde;o do Windows</b></p>
    <p>Atualmente, o Mobility Pack para CDC n&atilde;o est&aacute; dispon&iacute;vel em plataformas que n&atilde;o s&atilde;o do Windows porque n&atilde;o h&aacute; suporte a emuladores de terceiros para outras plataformas. Entretanto, oferecemos um zip bin&aacute;rio, sem suporte, do pacote para aqueles que quiserem instal&aacute;-lo em outros sistemas operacionais. Observe que n&atilde;o h&aacute; documenta&ccedil;&atilde;o nem suporte ao zip bin&aacute;rio. Para obter informa&ccedil;&otilde;es sobre como fazer o download e instalar o zip bin&aacute;rio, visite a <a href="http://wiki.netbeans.org/wiki/view/MobilityFromZipToNB">p&aacute;gina de perguntas freq&uuml;entes</a> deste t&oacute;pico. A <a href="https://netbeans.org/projects/mobility/lists/users/archive">lista de usu&aacute;rios do Mobility</a> tamb&eacute;m est&aacute; dispon&iacute;vel caso haja mais perguntas sobre este t&oacute;pico.</p>

</blockquote>
<p align=center><a href="#top">superior</a></p>
<h2><a name="emulators"></a>Instalando as plataformas do emulador</h2>
<p>Para desenvolver aplicativos CDC, voc&ecirc; precisa ter a plataforma CDC registrada no IDE. As instru&ccedil;&otilde;es a seguir descrevem o processo para a instala&ccedil;&atilde;o de cada plataforma de emulador aceitas atualmente pelo IDE.</p>
<blockquote>
  <h3>Sun Java Toolkit para CDC<a name="cdctk"></a></h3>
  <p>O Sun Java Toolkit para CDC vem integrado ao Mobility Pack do NetBeans, sendo assim, n&atilde;o &eacute; necess&aacute;rio fazer o download e instalar esse emulador. </p>
  <p>Entretanto, se voc&ecirc; quiser ter uma instala&ccedil;&atilde;o separada do Toolkit, siga estas instru&ccedil;&otilde;es: </p>
  <ol>
    <li>Fa&ccedil;a o download do Sun Java Toolkit para CDC<font color="#FF0000"> </font>1.0 da rede de desenvolvedores da Sun (<a href="http://java.sun.com/products/cdctoolkit/overview.html">download</a>).</li>
    <li>Instale o emulador da plataforma de acordo com as instru&ccedil;&otilde;es fornecidas.
    </li>
    <li>No Menu principal, escolha Ferramentas &gt; Gerenciador de plataformas Java. </li>
    <li>Clique em Adicionar plataforma. A caixa de di&aacute;logo Adicionar plataforma Java &eacute; aberta. </li>
    <li>Selecione Emulador de plataforma Java Micro Edition CDC e clique em Pr&oacute;ximo. </li>
    <li>Selecione a pasta que cont&eacute;m o SDK da plataforma. O diret&oacute;rio padr&atilde;o &eacute; <code>C:\CDCTK10\.</code> Clique em Pr&oacute;ximo.<code> </code></li>
    <li>Se desejar, use a caixa de di&aacute;logo Nome da plataforma para adicionar ou remover as bibliotecas de recursos adicionais. </li>
    <li>Clique em Finalizar. O IDE registra a plataforma CDC.</li>
  </ol>
  <p align=center><a href="#top">superior</a></p>
  <h3>Ricoh Embedded Software Architecture</h3>
  <p>O Mobility Pack para CDC &eacute; compat&iacute;vel com a Ricoh Embedded Software Architecture. Para integrar o suporte a essa arquitetura, siga estas instru&ccedil;&otilde;es: </p>
  <ol>
    <li>Fa&ccedil;a o download dos arquivos a seguir no <a href="http://www.ricoh.com/esa/index.html">site do programa do desenolvedor do Ricoh</a>: </li></ul>
    <ul>
      <li><a href="http://developer.sonyericsson.com/site/global/docstools/symbian/p_symbian.jsp"></a>Emulador da Embedded Software Architecture (logon necess&aacute;rio para <a href="http://www.ricoh.com/esa/index.html">download</a>)<font color="#FF0000"></font></li>
    </ul>
    <li>Descompacte o arquivo <code>Embedded_Software_Architecture_Emulator_1.14c.zip.<br></code>Os arquivos s&atilde;o extra&iacute;dos para uma pasta <code> <em>&lt;raiz&gt;</em>\Embedded_Software_Architecture_Emulator_1.14c\.</code></li>
    <li> No Menu principal do NetBeans IDE, escolha Ferramentas &gt; Gerenciador de plataformas Java. </li>
    <li>Clique em Adicionar plataforma. A caixa de di&aacute;logo Adicionar plataforma Java &eacute; aberta. </li>
    <li>Selecione Emulador de plataforma Java Micro Edition CDC e clique em Pr&oacute;ximo. </li>
    <li>Selecione a pasta que cont&eacute;m o SDK da plataforma. O diret&oacute;rio padr&atilde;o &eacute; <code>C:\Embedded_Software_Architecture_Emulator_1.14c\.</code> Clique em Pr&oacute;ximo.<code> </code></li>
    <li>Se desejar, use a caixa de di&aacute;logo Nome da plataforma para adicionar ou remover as bibliotecas de recursos adicionais. </li>
    <li>Clique em Finalizar. O IDE registra a plataforma CDC.</li>
  </ol>
  <p align=center><a href="#top">superior</a></p>
  <h3>Plataforma CDC Sony Ericsson para o UIQ SDK 3</h3>
  <p>O Mobility Pack para CDC &eacute; compat&iacute;vel com a plataforma CDC 1 Sony Ericsson. Para integrar o suporte aos dispositivos das s&eacute;ries M600 e P990, siga estas instru&ccedil;&otilde;es: </p>
  <ol>
    <li>Fa&ccedil;a o download dos arquivos a seguir no site da Web <a href="http://developer.sonyericsson.com">developer.sonyericsson.com</a>: </li>
    <ul>
      <li><a href="http://developer.sonyericsson.com/site/global/docstools/symbian/p_symbian.jsp"></a>UIQ 3 SDK (logon necess&aacute;rio para <a href="http://developer.uiq.com/">download</a>)<font color="#FF0000"></font></li>
      <li>Pacote de extens&atilde;o M600 para UIQ 3 SDK (<a href="http://developer.sonymobile.com/downloads/sdks/">download</a>)</li>
      <li>Pacote de extens&atilde;o P990 para UIQ 3 SDK (<a href="http://developer.sonymobile.com/downloads/sdks/">download</a>)</li>
    </ul>
    <li>Descompacte o arquivo <code>UIQ3SDK_final.zip</code>. </li>
    <li>Navegue at&eacute; o local em seu sistema onde os arquivos foram extra&iacute;dos e clique duas vezes em <code>UIQS3SDK.exe</code>.<br> O Assistente para instala&ccedil;&atilde;o do UIQ 3 SDK &eacute; aberto. </li>
    <li>Siga as instru&ccedil;&otilde;es do assistente para instalar o SDK. <br> O diret&oacute;rio padr&atilde;o da instala&ccedil;&atilde;o &eacute; <code>C:\Symbian\UIQ3SDK\</code></li>
    <li>Para instalar os pacotes de extens&atilde;o M600 e P990, navegue at&eacute; os locais de download em seu sistema e clique duas vezes nos &iacute;cones do instalador para iniciar os assistentes para instala&ccedil;&atilde;o. </li>
    <li>Siga as instru&ccedil;&otilde;es do assistente para instalar cada SDK. </li>
    <li>No Menu principal do NetBeans IDE, escolha Ferramentas &gt; Gerenciador de plataformas Java. </li>
    <li>Clique em Adicionar plataforma. A caixa de di&aacute;logo Adicionar plataforma Java &eacute; aberta. </li>
    <li>Selecione Emulador de plataforma Java Micro Edition CDC e clique em Pr&oacute;ximo. </li>
    <li>Selecione a pasta que cont&eacute;m o SDK da plataforma. O diret&oacute;rio padr&atilde;o &eacute; <code>C:\Symbian\UIQ3SDK\.</code> Clique em Pr&oacute;ximo.</li>
    <li>Se desejar, use a caixa de di&aacute;logo Nome da plataforma para adicionar ou remover as bibliotecas de recursos adicionais. <br> <br> <strong>Observa&ccedil;&atilde;o:</strong> Se voc&ecirc; vir a mensagem, &quot;A plataforma n&atilde;o est&aacute; configurada corretamente. Use as ferramentas de configura&ccedil;&atilde;o do SDK para instalar as ferramentas necess&aacute;rias&quot;, &eacute; porque n&atilde;o foi selecionado um estilo de emulador.<br> <br> Para corrigir o problema:
      <ol>
        <li>Clique na guia Configura&ccedil;&otilde;es e clique no bot&atilde;o Ferramenta de configura&ccedil;&atilde;o do SDK. </li>
        <li>Na Configura&ccedil;&atilde;o do SDK, clique na guia Estilo e escolha um estilo em Estilos do emulador. Escolha Aplicar estilos. </li>
        <li>Feche o Configurador do SDK. </li>
      </ol>
    </li>
    <li>Clique em Finalizar. O IDE registra as plataformas CDC.</li>
  </ol>
  <p align=center><a href="#top">superior</a></p>
  <h3>Plataforma Nokia Series 80 SDK para sistema operacional Symbian, para Java, perfil Personal</h3>
  <p>O Mobility Pack para CDC &eacute; compat&iacute;vel com a plataforma Series 80 SDK para sistema operacional Symbian, para Java, perfil Personal. Para integrar o suporte aos dispositivos Nokia Series 80, siga estas instru&ccedil;&otilde;es: </p>
  <ol>
    <li>Fa&ccedil;a download da plataforma Nokia Series 80 SDK para sistema operacional Symbian, para Java, perfil Personal da rede de desenvolvedores da Sun (<a href="http://www.forum.nokia.com/info/sw.nokia.com/id/449a2f84-2a8a-44fa-a7f4-93b53cb9c89a/Series_80_Platform_SDK_s_for_Symbian_OS_for_Java.html">download</a>). O nome do arquivo &eacute; <code>S80_DP_2_0_PP_SDK.zip.</code></li>
    <li>Descompacte o arquivo. </li>
    <li>Navegue para o local em seu sistema em que voc&ecirc; descompactou o arquivo. Clique duas vezes no &iacute;cone do arquivo <code>setup.exe</code>. <br> O assistente do instalador da Nokia &eacute; aberto. </li>
    <li>Siga as instru&ccedil;&otilde;es do assistente para instalar o SDK. <br> O assistente solicitar&aacute; que voc&ecirc; escolha o dispositivo que deseja definir como padr&atilde;o. Escolha o <code>Series80_DP2_0_PP_SDK</code>.</li>
    <li>No Menu principal do NetBeans IDE, escolha Ferramentas &gt; Gerenciador de plataformas Java. </li>
    <li>Clique em Adicionar plataforma. A caixa de di&aacute;logo Adicionar plataforma Java &eacute; aberta. </li>
    <li>Selecione Emulador de plataforma Java Micro Edition CDC e clique em Pr&oacute;ximo. </li>
    <li>Selecione a pasta que cont&eacute;m o SDK da plataforma. O diret&oacute;rio padr&atilde;o &eacute; <code>C:\Symbian\S80_DP2_0_PP_SDK.</code> Clique em Pr&oacute;ximo.<code> </code></li>
    <li>Se desejar, use a caixa de di&aacute;logo Nome da plataforma para adicionar ou remover as bibliotecas de recursos adicionais. </li>
    <li>Clique em Finalizar. O IDE registra a plataforma CDC.</li>
  </ol>
  <p align=center><a href="#top">superior</a></p>
  <h3 align=center>Plataforma m&oacute;vel SavaJe</h3>
  <p>O Mobility Pack para CDC aceita a cria&ccedil;&atilde;o de Xlets usando o sistema operacional SavaJe. O suporte ao sistema operacional SavaJe &eacute; incorporado no Sun Java Wireless Toolkit para CDC. Como o Jasper S20 est&aacute; dispon&iacute;vel atualmente apenas como uma edi&ccedil;&atilde;o de visualiza&ccedil;&atilde;o, n&atilde;o h&aacute; skin do emulador para o Jasper S20. Em vez disso, voc&ecirc; pode usar o dispositivo <code>DefaultColorPhone</code> para simular o comportamento do Jasper S20.</p>
  <div class="indent">
    <p>Se voc&ecirc; possui o Jasper S20, estas instru&ccedil;&otilde;es mostram como implantar o aplicativo em seu dispositivo. Eis aqui o que voc&ecirc; precisa: </p>
  <ul>
    <li>
      O telefone Jasper S20.
    </li>
    <li>
      O sistema operacional SavaJe (registro necess&aacute;rio)
    </li>
    <li>
      Software de dispositivo m&oacute;vel GSPDA (drivers USB MCCI).
    </li>
  </ul>
  <h4></a>Configurando o aparelho </h4>
  <p>As etapas a seguir descrevem o processo de instala&ccedil;&atilde;o do software necess&aacute;rio para o tutorial do telefone Jasper S20. </p>
    <h4 class="tutorial">Instalando o sistema operacional SavaJE</h4>
    <p><strong>OBSERVA&Ccedil;&Atilde;O: </strong>Este procedimento &eacute; para os aparelhos Jasper S20 que possuem uma vers&atilde;o anterior do sistema operacional SavaJe instalado e voc&ecirc; deseja manter a calibragem e as configura&ccedil;&otilde;es de f&aacute;brica existentes.</p>
    <p>Existem tr&ecirc;s compila&ccedil;&otilde;es do sistema operacional SavaJe que devem estar dispon&iacute;veis em www.SavaJe.com: </p>
  <ul>
    <li>
      <code>JasperS20.zip</code><br> A compila&ccedil;&atilde;o comercial que vem no telefone.
    </li>
    <li>
      <code>JasperS20_EA_Developer.zip</code><br> A compila&ccedil;&atilde;o do desenvolvedor JavaOne Early Access sem o Java Debug Wire Protocol (JDWP) ativado.
    </li>
    <li>
      <code>JasperS20_EA_Developer_debug.zip</code><br> A compila&ccedil;&atilde;o do desenvolvedor JavaOne Early Access com o JDWP ativado. Para executar um pacote com a depura&ccedil;&atilde;o JDWP, ser&aacute; necess&aacute;rio carregar essa compila&ccedil;&atilde;o.
    </li>
  </ul>
    <p>Siga estas etapas para instalar uma compila&ccedil;&atilde;o atualizada do sistema operacional SavaJE no telefone. </p>
    <ol>
      <li> Extraia (descompacte) o arquivo zip que cont&eacute;m a compila&ccedil;&atilde;o desejada para a raiz do cart&atilde;o mini-SD. </li>
      <li>Conecte um cabo USB ou de for&ccedil;a ao aparelho.</li>
      <li>Ligue o aparelho enquanto mant&eacute;m pressionada a tecla da c&acirc;mera.</li>
      <li>Na tela do menu do atualizador, selecione Redefini&ccedil;&atilde;o de f&aacute;brica, movendo o controle para baixo at&eacute; que a op&ccedil;&atilde;o &quot;Redefini&ccedil;&atilde;o de f&aacute;brica&quot; esteja real&ccedil;ada. Inicie a redefini&ccedil;&atilde;o de f&aacute;brica movendo o controle para a direita. Use o controle para navegar at&eacute; Sim e selecione Sim movendo o controle para a direita. <br> O telefone deve come&ccedil;ar a carregar a nova compila&ccedil;&atilde;o. Depois que a carga estiver completa, talvez voc&ecirc; seja solicitado a pressionar qualquer tecla para reinicializar o telefone. </li>
      <li>O aparelho &eacute; reinicializado e exibe a tela Xplore. Se a tela de carregamento da bateria for exibida durante a reinicializa&ccedil;&atilde;o, pressione o bot&atilde;o de for&ccedil;a para continuar a reinicializar o telefone. </li>
    </ol>
    <p>Na primeira vez em que o aparelho &eacute; inicializado depois de uma redefini&ccedil;&atilde;o de f&aacute;brica, &eacute; exibido um menu de sele&ccedil;&atilde;o Idioma/Localidade. Fa&ccedil;a as suas sele&ccedil;&otilde;es, navegando com o controle e pressionando o bot&atilde;o do controle. Voc&ecirc; tamb&eacute;m ser&aacute; solicitado a definir a hora.
    </p>
    <h4 class="tutorial">Registrando a plataforma CDC</h4>
    <p>Siga as instru&ccedil;&otilde;es fornecidas para o <a href="#cdctk"> Sun Java Wireless Toolkit para CDC 1.0</a>. <br>
    </p>
  </div>
  <p align=center><a href="#top">superior</a></p>
</blockquote>
<h2><a name=uninstallation>Desinstala&ccedil;&atilde;o do software</a></h2>
<p>Esta se&ccedil;&atilde;o cont&eacute;m informa&ccedil;&otilde;es sobre a desinstala&ccedil;&atilde;o do Mobility Pack do NetBeans para CDC 5.5 do seu sistema.
<blockquote>
  <ol>
    <li> Feche o IDE. </li>
    <li> No Painel de controle, inicie Adicionar ou remover programas, selecione Mobility Pack do NetBeans para CDC 5.5 e clique em Alterar/Remover. </li>
    <li> Siga as instru&ccedil;&otilde;es do desinstalador. </li>
  </ol>
</blockquote>
  <p><strong>Observa&ccedil;&atilde;o:</strong> Voc&ecirc; tamb&eacute;m pode desinstalar qualquer uma ou todas as plataformas do emulador atrav&eacute;s do Painel de controle do Windows. </p>
<p align=center><a href="#top">superior</a></p>
<h2><a name=troubleshoot>Solu&ccedil;&atilde;o de problemas</a></h2>
<p>Se tiver problemas ao instalar ou executar o software, consulte a lista de problemas abaixo para ver as solu&ccedil;&otilde;es. Para obter uma lista completa dos problemas conhecidos, dos requisitos do sistema e de informa&ccedil;&otilde;es de configura&ccedil;&atilde;o, consulte as <a href="relnotes-mobilitycdc_pt_BR.html">Notas da vers&atilde;o</a>. </p>
<p> Se encontrar um problema que n&atilde;o esteja listado nas notas da vers&atilde;o ou quiser solicitar uma melhoria, registre o problema no sistema de controle de erros do NetBeans, IssueZilla, em <a href="https://netbeans.org/community/issues.html">https://netbeans.org/community/issues.html</a>. Para problemas do Mobility Pack do NetBeans, selecione o componente &quot;mobility&quot;, selecione a vers&atilde;o &quot;5.5&quot; e, em seguida, selecione o subcomponente &quot;cdc pack&quot;. Se n&atilde;o tiver certeza do nome correto do subcomponente, escolha &quot;other&quot;.</p>
<p>Se j&aacute; estiver conectado ao netbeans.org, v&aacute; diretamente para a tela de entrada de problemas do Mobility Pack: <a href="https://netbeans.org/bugzilla/enter_bug.cgi?component=mobility&version=5.5">https://netbeans.org/bugzilla/enter_bug.cgi?component=mobility&amp;version=5.5</a>.</p>
<ul>
<p align=center><a href="#top">superior</a></p>
</ul>
</body>
</html>

