<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Notas da vers&atilde;o do Mobility Pack NetBeans 5.5</title>
<link rel="stylesheet" type="text/css" href="../../../netbeans.css">
<meta http-equiv="Content-Language" content="pt-br">
</head>

<body>

<h1>Notas da vers&atilde;o do Mobility Pack NetBeans 5.5</h1>
<blockquote>Bem-vindo ao NetBeans 5.5 Mobility Pack, um pacote suplementar que oferece ferramentas para criar aplicativos do Java Micro Edition (Java ME) compat&iacute;veis com as tecnologias Configura&ccedil;&atilde;o de dispositivo limitado conectado (CLDC) e Perfil de dispositivo de informa&ccedil;&atilde;o m&oacute;vel (MIDP).</blockquote>
<h2>Requisitos do sistema</h2>
<blockquote>
  <p>O Mobility Pack NetBeans 5.5 &eacute; executado no J2SE JDK 5.0 (Java 2 JDK, edi&ccedil;&atilde;o padr&atilde;o), composto pelo Java Runtime Environment e por ferramentas de desenvolvimento para compilar, depurar e executar aplicativos escritos na linguagem Java.</p>

<p>O Mobility Pack NetBeans 5.5 &eacute; executado em sistemas operacionais que oferecem suporte &agrave; m&aacute;quina virtual Java. Veja uma lista das plataformas nas quais o Mobility Pack j&aacute; foi testado. </p>
  <ul>
   <li> Microsoft Windows 2000 Professional SP4</li>
  <li>Microsoft Windows XP Professional SP2</li>
  <li>Red Hat Fedora Core 3</li>
</ul>


<p>O Mobility Pack inclui o <a href="http://java.sun.com/products/sjwtoolkit/download-2_2.html">J2ME Wireless Toolkit, vers&atilde;o 2.2</a>. </p>
  <p><b>Observa&ccedil;&atilde;o:</b> As plataformas compat&iacute;veis com o Mobility Pack NetBeans podem diferir das compat&iacute;veis com o emulador que voc&ecirc; planeja utilizar. &Eacute; preciso verificar se tanto o emulador quanto o Mobility Pack s&atilde;o compat&iacute;veis com determinada plataforma.</p>
</blockquote>


<h2><a name="BugsIssues">Erros e problemas</a></h2>
<blockquote>
  <p>Para arquivar um novo erro, solicitar um recurso novo ou o aprimoramento do recurso ou verificar o status do erro existente, use o sistema de rastreamento de erros Issuezilla:<a href="https://netbeans.org/bugzilla/enter_bug.cgi?component=mobility&version=5.5">https://netbeans.org/bugzilla/enter_bug.cgi?component=mobility&amp;version=5.5</a>
  </p>
  <p><strong>Observa&ccedil;&atilde;o:</strong> Projetos criados com o Visual Mobile Designer em vers&otilde;es anteriores do Mobility Pack ser&atilde;o atualizados para o formato novo quando abertos na vers&atilde;o 5.5. Depois de serem salvos, eles n&atilde;o podem ser abertos em vers&otilde;es anteriores do Mobility Pack. Para obter detalhes, consulte <a href="http://wiki.netbeans.org/wiki/view/MobilityVisualDesignerVersions">http://wiki.netbeans.org/wiki/view/MobilityVisualDesignerVersions</a>.</p>
  <p>A seguir, os principais problemas n&atilde;o resolvidos dessa vers&atilde;o:
 </p>

  <ul>
    <li>O Mobility Pack NetBeans n&atilde;o &eacute; executado se houver <br>caracteres n&atilde;o ASCII<br> no nome da pasta de instala&ccedil;&atilde;o ou do diret&oacute;rio de usu&aacute;rio ou no caminho para estes.
    </li>
    <li> O J2ME Wireless Toolkit n&atilde;o &eacute; executado se houver caracteres n&atilde;o ASCII no nome da pasta de instala&ccedil;&atilde;o do Toolkit ou do diret&oacute;rio de usu&aacute;rio ou no caminho para estes.<br>
    </li>
    <li>O emulador do J2ME Wireless Toolkit 2.2 n&atilde;o &eacute; compat&iacute;vel com caracteres multibyte no nome de um projeto do Mobility ou em uma classe Java que se tornar&aacute; o nome de um conjunto MIDlet ou MIDlet.a&Eacute; poss&iacute;vel desenvolver tal projeto usando o IDE, mas voc&ecirc; n&atilde;o conseguir&aacute; desenvolver e executar o aplicativo se estiver usando o J2ME Wireless Toolkit 2.2 como sua plataforma de destino.<br>
      <blockquote> <strong>Solu&ccedil;&atilde;o:</strong> Use caracteres ASCII somente no nome do projeto e em nomes de classe de programas ou configure o projeto para usar um emulador que seja compat&iacute;vel com caracteres multibyte.</blockquote>
    </li>
    <li>&Eacute; preciso determinadas permiss&otilde;es para que seja poss&iacute;vel inserir emuladores externos do J2ME Wireless Toolkit na distribui&ccedil;&atilde;o do Linux.<br> <br> Ao adicionar a plataforma usando o Java Platform Manager (JPM), o navegador da ferramenta reconhece qualquer diret&oacute;rio do J2ME Wireless Toolkit e marca-os com um &iacute;cone apropriado na caixa de di&aacute;logo do arquivo. No entanto, se tentar inserir um Wireless Toolkit externo no Linux instalado na raiz ou uma conta de usu&aacute;rio diferente, o processo falha, mesmo que a instala&ccedil;&atilde;o do Wireless Toolkit pare&ccedil;a ser v&aacute;lida. Esse &eacute; um problema conhecido e &eacute; causado por permiss&otilde;es erradas definidas nos execut&aacute;veis do Wireless Toolkit. Como resultado, o JPM n&atilde;o consegue executar o emulador nem obter as informa&ccedil;&otilde;es necess&aacute;rias sobre a plataforma.
      <blockquote>
        <p><strong>Solu&ccedil;&atilde;o:</strong> Instale o J2ME Wireless Toolkit externo na mesma conta de usu&aacute;rio usada para executar o NetBeans IDE. Uma alternativa &eacute;, caso voc&ecirc; tenha acesso &agrave; raiz, alterar as permiss&otilde;es nos diret&oacute;rios e execut&aacute;veis do Wireless Toolkit. Entretanto, esse procedimento n&atilde;o &eacute; recomendado, pois pode causar problemas para outros usu&aacute;rios desta instala&ccedil;&atilde;o do Wireless Toolkit.</p>
      </blockquote>
    </li>
    <li>Projetos do Visual Mobile Designer salvos no Mobility Pack 5.0 ou Mobility Pack 5.5 Beta 2 n&atilde;o s&atilde;o compat&iacute;veis com projetos do Mobility Pack 4.1. Se salvar um projeto na vers&atilde;o 5.0 ou 5.5 Beta, n&atilde;o poder&aacute; abri-lo na vers&atilde;o 4.1.<br>
    </li>
    <li><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=79039">Erro #79039: N&atilde;o &eacute; poss&iacute;vel gerar cliente m&oacute;vel para aplicativos da Web para clientes de servi&ccedil;os da Web no J2EE 5 <br> <br></a>O assistente de cliente m&oacute;vel para aplicativos da Web n&atilde;o funciona com clientes de servi&ccedil;os da Web criados no formato J2EE 5. O assistente n&atilde;o apresenta esses clientes de servi&ccedil;os da Web na caixa de combina&ccedil;&atilde;o do primeiro painel. </li>
    <blockquote><strong>Solu&ccedil;&atilde;o:</strong> Criar um novo projeto da Web no J2EE 1.4 e inserir o cliente de servi&ccedil;os da Web no servi&ccedil;o desejado. No projeto do Mobility apenas selecione o cliente de servi&ccedil;os da Web inserido nesse novo projeto. </blockquote>
    <li>Executar pelo OTA pode levar muito tempo.<br>
    </li>
    <li>Se voc&ecirc; inserir diversos componentes personalizados na Paleta do componente do MIDP Visual Designer, o &uacute;ltimo desses componentes pode se tornar inutiliz&aacute;vel.
    </li>
    <blockquote>
      <p><strong>Solu&ccedil;&atilde;o:</strong> Remova o componente personalizado e insira-o novamente utilizando o Gerenciador da paleta de componentes.<br>
      </p>
    </blockquote>
    <li>O emulador &eacute; aberto, mas nenhum MIDlet &eacute; exibido quando o aplicativo multissegmentado &eacute; depurado ou quando um aplicativo est&aacute; sendo depurado em computadores biprocessados. Isso ocorre em raz&atilde;o de um erro no J2ME Wireless Toolkit 2.2.
      <blockquote>
        <p><strong>Solu&ccedil;&atilde;o:</strong> Desligue o hiperprocessamento ao depurar.</p>
      </blockquote>
    </li>
    <li>Ao criar um novo cliente m&oacute;vel para um aplicativo da Web, n&atilde;o &eacute; poss&iacute;vel gerar um MIDlet de amostra se o par&acirc;metro do servi&ccedil;o da Web for de um tipo que n&atilde;o possa ser representado facilmente no Visual Mobile Developer, por exemplo, uma matriz. </li>
  </ul>
</blockquote>
   <h2><a name="Documentation">Documenta&ccedil;&atilde;o</a></h2>
<blockquote> A documenta&ccedil;&atilde;o do Mobility Pack NetBeans &eacute; oferecida em guias baseados na Web e no sistema de ajuda do IDE. Voc&ecirc; pode usar os documentos seguintes como introdu&ccedil;&atilde;o:
  <ul>
    <li><a href="../../../kb/55/mobility_pt_BR.html">P&aacute;gina de download e recursos do Mobility Pack NetBeans 5.5</a></li>
    <li><a href="../../../kb/55/quickstart-mobility.html">Guia de in&iacute;cio r&aacute;pido do Mobility Pack NetBeans 5.5</a></li>
    <li><a href="../../../kb/55/import-mobility.html"> Importando c&oacute;digo-fonte do Java ME MIDP existente para o NetBeans IDE 5.5</a></li>
 <!--   <li><a href="https://netbeans.org/kb/articles/tutorial-currencyconverter-40.html">
	J2ME MIDP Currency Converter Tutorial</a></li>
    <li><a href="https://netbeans.org/kb/articles/tutorial-j2mefragmentation-50.html">
	J2ME MIDP Device Fragmentation Tutorial</a></li> -->
  </ul>
</blockquote>


</body>
</html>

