<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8">
<title>NetBeans 5.5, M&oacute;dulo de modelagem UML - Notas de vers&atilde;o da plataforma Mac OS</title>
<link rel="stylesheet" type="text/css" href="https://netbeans.org/netbeans.css">
<meta name="description" content="NetBeans 5.5, M&oacute;dulo de modelagem UML - Notas de vers&atilde;o da plataforma Mac OS">

</head>
<body onLoad="loginfocus()" class="composite">
<div id="contentLeft">
<!-- Begin Content Area --> <a name="top"></a>
<h1>NetBeans 5.5, M&oacute;dulo de modelagem UML - Notas de vers&atilde;o da plataforma Mac OS</h1>
<p>&Uacute;ltima atualiza&ccedil;&atilde;o: 23 de mar&ccedil;o de 2007</p>
<p>A plataforma Macintosh OS atualmente n&atilde;o &eacute; compat&iacute;vel com a vers&atilde;o do NetBeans™ 5.5, M&oacute;dulo de modelagem UML. Este documento de notas de vers&atilde;o fornece informa&ccedil;&otilde;es importantes sobre os problemas conhecidos e as solu&ccedil;&otilde;es no uso do m&oacute;dulo de modelagem UML em uma plataforma Macintosh OS X. Consulte as <a href="uml-relnotes_pt_BR.html">Notas de vers&atilde;o do NetBeans 5.5, M&oacute;dulo de modelagem UML</a> para obter mais informa&ccedil;&otilde;es sobre os problemas conhecidos e as solu&ccedil;&otilde;es das plataformas aceitas.</p>
<p><b>Conte&uacute;do</b></p>
<ul>
<li><a href="#sysreqs">Requisitos do sistema</a></li>
<li><a href="#known_issues">Problemas conhecidos e solu&ccedil;&otilde;es</a> </li>
</ul>
<br> <!-- ======================================================================================== -->
<h2><a name="sysreqs"></a>Requisitos do sistema</h2>
<p>O NetBeans™ 5.5, M&oacute;dulo de modelagem UML &eacute; compat&iacute;vel com todos os sistemas que atendam aos requisitos especificados na se&ccedil;&atilde;o Requisitos do sistema das <a href="https://netbeans.org/community/releases/55/relnotes_pt_BR.html#system_requirements">Notas de vers&atilde;o do NetBeans IDE 5.5</a>, com a exce&ccedil;&atilde;o do Macintosh OS. O m&oacute;dulo de modelagem UML atualmente n&atilde;o &eacute; compat&iacute;vel com a plataforma Macintosh OS X.</p>
<!-- ======================================================================================== --> <br>
<h2><a name="known_issues"></a>Problemas conhecidos e solu&ccedil;&otilde;es </h2>
<p>Os problemas n&atilde;o resolvidos descritos abaixo ocorrem durante o uso do m&oacute;dulo de modelagem UML no IDE executado na plataforma Macintosh OS X. </p>
<blockquote>
  <ul>
<li><b><span style="color: #045491;"><a name="scrollbarissue"></a>No Mac OS com JDK 1.5, o desempenho da modelagem UML se torna lento quando as barras de rolagem aparecem na janela do Editor de diagramas.</span></b> <!-- 78346 https://netbeans.org/bugzilla/show_bug.cgi?id=78346 P1 MAC: UML performance issue on MacOS when scroll bars exist for the diagram window -->
<blockquote>
<p><strong>Descri&ccedil;&atilde;o: </strong></p>
<blockquote>
<a href="https://netbeans.org/bugzilla/show_bug.cgi?id=78346">Erro #78346</a>: O desempenho da modelagem UML &eacute; mais lento em uma plataforma Mac OS que executa o JDK 1.5 quando as barras de rolagem s&atilde;o exibidas na janela do Editor de diagramas, como um resultado da movimenta&ccedil;&atilde;o manual dos elementos do diagrama. Depois que as barras de rolagem forem exibidas, qualquer a&ccedil;&atilde;o realizada nos diagramas leva um longo tempo para ser conclu&iacute;da. </blockquote>
<p><strong>Solu&ccedil;&atilde;o: </strong></p>
<blockquote>Clique em um dos bot&otilde;es de layout na barra de ferramentas do Editor de diagramas para refazer o layout do diagrama. Se estiver trabalhando com um diagrama grande, adicione a op&ccedil;&atilde;o da linha de comando <tt><br> -J-Dapple.awt.graphics.UseQuartz=false</tt> &agrave; declara&ccedil;&atilde;o <code>netbeans_default_options</code> no <code><i>diret&oacute;rio_de_instala&ccedil;&atilde;o_do_nb5.5</i>/Contents/Resources/NetBeans/etc/arquivo/arquivo </code>netbeans.conf</code>. Reinicie o IDE. <br> <br> <b>Observa&ccedil;&atilde;o:</b> O uso da op&ccedil;&atilde;o de linha de comando mencionada acima pode afetar negativamente o comportamento do NetBeans 5.5 IDE e de outros m&oacute;dulos. Esses comportamentos s&atilde;o descritos nos problemas seguintes:
  <ul>
    <li><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=73623">Erro #73623:</a> O explorador de arquivos atualiza aleatoriamente e embaralha o texto que fica em cima de outro texto na &aacute;rvore de arquivos. Um comando de atualiza&ccedil;&atilde;o for&ccedil;ada restaura a apar&ecirc;ncia da &aacute;rvore de arquivos, mas o embaralhamento ocorre com freq&uuml;&ecirc;ncia.</li>
    <li><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=83271">Erro #83271</a>: Depois de mover uma paleta de um local para outro, algumas &aacute;reas da tela parece que n&atilde;o s&atilde;o atualizadas corretamente e as informa&ccedil;&otilde;es ficam sobrepostas.</li>
    <li><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=88271">Erro #88271</a>: Desativar a renderiza&ccedil;&atilde;o de Quartz causa outros problemas, tais como problemas de renderiza&ccedil;&atilde;o na janela da ajuda.</li>
  </ul>
  Se tiver qualquer um dos problemas citados acima ou outros problemas ao usar a op&ccedil;&atilde;o <tt>-J-Dapple.awt.graphics.UseQuartz</tt>, remova a op&ccedil;&atilde;o do arquivo <tt>netbeans.conf</tt> e reinicie o IDE. </blockquote>
</blockquote>
</li>
<li><b><span style="color: #045491;"> Iniciar o IDE com o JDK 1.6 em uma plataforma Mac OS X afeta o desempenho da modelagem UML.</span></b> <!--82943 https://netbeans.org/bugzilla/show_bug.cgi?id=82943 P1 MAC ui performance on MacOS system is very slow when jdk 1.6 is used to start ide -->
<blockquote>
<p><strong>Descri&ccedil;&atilde;o:</strong></p>
<blockquote>
<a href="https://netbeans.org/bugzilla/show_bug.cgi?id=82943">Erro #82943</a>:  O problema de desempenho do UML descrito na <a href="#scrollbarissue">se&ccedil;&atilde;o anterior</a> &eacute; corrigido quando o IDE &eacute; iniciado com o JDK 1.6 em um Mac OS X em uma plataforma Intel. Entretanto, o desempenho do m&oacute;dulo de modelagem UML &eacute; altamente prejudicado quando o IDE &eacute; iniciado com o JDK 1.6 em um Mac OS X em uma plataforma Power PC. <br> <br> Existem tamb&eacute;m outros problemas que ocorrem no IDE quando ele &eacute; iniciado com o JDK 1.6 (<a href="https://netbeans.org/bugzilla/show_bug.cgi?id=86850">consulte o Problema #86850</a>). O IDE possui problemas gerais que ocorrem com o uso do JDK 1.6. </blockquote>
<p><strong>Solu&ccedil;&atilde;o: </strong>Use o JDK 1.5 ao iniciar o IDE.</p>
</blockquote>
</li>
<li><b><span style="color: #045491;">Criar um diagrama de classe a partir de elementos selecionados retorna uma exce&ccedil;&atilde;o em um Mac OS usando JDK 1.6.</span></b> <!-- 82831 https://netbeans.org/bugzilla/show_bug.cgi?id=82831 P1 MAC creating class diagram from selected elements returns StackOverflowError exception -->
<blockquote><strong>Descri&ccedil;&atilde;o:</strong>
<blockquote>
<a href="https://netbeans.org/bugzilla/show_bug.cgi?id=82831">Erro #82831</a>: Em uma plataforma Mac OS, criar um diagrama de classe a partir de elementos selecionados retorna uma exce&ccedil;&atilde;o StackOverflowError. Trata-se de um erro conhecido do Macintosh (ID #4647508) </blockquote>
<p><strong>Solu&ccedil;&atilde;o: </strong>Use o JDK 1.5 ao iniciar o IDE.</p>
</blockquote>
</li>
</ul>
</blockquote>
<br>
<p>A vers&atilde;o do NetBeans 5.5, M&oacute;dulo de modelagem UML, permite que voc&ecirc; explore e avalie a funcionalidade UML no IDE. Pedimos que voc&ecirc; participe e nos d&ecirc; a sua opini&atilde;o, registrando qualquer problema que tenha encontrado no sistema de rastreamento de problemas em <a href="https://netbeans.org/community/issues.html">https://netbeans.org/community/issues.html</a>.</p>

<p align="center"><a href="#top">superior</a></p>
</div>
</body>
</html>
