<!DOCTYPE HTML PUBLIC"-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
    <head>

        <title>Notas da vers&atilde;o do NetBeans Visual Web Pack 5.5</title>
        <link rel="stylesheet" type="text/css" href="../../../netbeans.css">
        <meta name="description" content="Este guia oferece informa&ccedil;&otilde;es em rela&ccedil;&atilde;o &agrave;s altera&ccedil;&otilde;es do NetBeans Visual Web Pack
        de vers&atilde;o &agrave; vers&atilde;o, notas sobre configura&ccedil;&atilde;o e problemas conhecidos e links de outra documenta&ccedil;&atilde;o do Visual Web Pack.">
        <meta name="keywords" content="perguntas freq&uuml;entes, configura&ccedil;&atilde;o, FAQ">
    <meta http-equiv="Content-Language" content="pt-br">
</head>
    <body>
        <a name=top></a>
        <h1>Notas da vers&atilde;o do NetBeans Visual Web Pack 5.5</h1>
        <!-- <p>Last Updated: October 2006</p> -->
        <p>O NetBeans Visual Web Pack 5.5 oferece um ambiente para a r&aacute;pida constru&ccedil;&atilde;o de aplicativos da Web com componentes JavaServer Faces ativados por AJAX, oferece suporte &agrave; vincula&ccedil;&atilde;o arrastar e soltar em fontes de dados e muito mais. </p>
        <p><b>Conte&uacute;do</b></p>
        <ul>
            <li> <a href="#sysreq" title="Pr&eacute;-requisitos">Requisitos do sistema</a> </li>
            <li> <a href="#configinfo" title="Informa&ccedil;&otilde;es de configura&ccedil;&atilde;o">Informa&ccedil;&otilde;es de configura&ccedil;&atilde;o</a> </li>
            <li><a href="#sampleapp">Aplicativos de amostra </a></li>
            <li><a href="#changenotes">Notas sobre altera&ccedil;&otilde;es </a></li>
            <li><a href="#knownissues">Problemas conhecidos</a></li>
            <li><a href="#documentation">Documenta&ccedil;&atilde;o</a></li>
            <li> <a href="#more_information">Mais informa&ccedil;&otilde;es</a></li>
        </ul>
        <br> <!--  FOR REVIEW   -->
        <p><b>Observa&ccedil;&atilde;o: </b>Os componentes AJAX inclu&iacute;dos no NetBeans Visual Web Pack 5.5 s&atilde;o apenas de amostra e n&atilde;o est&atilde;o destinados para aplicativos de produ&ccedil;&atilde;o. </p>
        <!-- PREREQUISITES -->
        <h2><a name=sysreq></a>Requisitos do sistema</h2>
        <p>Esse t&oacute;pico especifica os pr&eacute;-requisitos que devem ser cumpridos antes de iniciar a instala&ccedil;&atilde;o do NetBeans Visual Web Pack 5.5.</p>
        <blockquote>
            <h3>Configura&ccedil;&atilde;o do sistema</h3>
            <p>A tabela abaixo lista os requisitos m&iacute;nimos de hardware e sistema operacional necess&aacute;rios para executar o NetBeans Visual Web Pack 5.5:</p>
            <table BORDER=1 CELLPADDING=4 CELLSPACING=3 summary="minimum h/w and OS specs">
                <col width=36*>
                <col width=36*>
                <col width=36*>
                <col width=36*>
                <col width=36*>
                <col width=77*>
                <tr valign=top>
                    <th width=14%> <p>
                    Plataforma</p></th>
                    <th width=14%> <p>CPU</p></th>
                    <th width=8%> <p align="center">RAM</p></th>
                    <th width=8%> <p>Espa&ccedil;o em disco</p></th>
                    <th width=20%> <p>Sistema operacional</p></th>
                    <th width=24%> <p>Navegadores suportados</p></th>
                </tr>
                <tr valign=top>
                    <td width=14%> <p>Solaris SPARC</p></td>
                    <td width=14%> <p>UltraSPARC III com velocidade de processamento de 750 MHz</p></td>
                    <td width=8%> <p align="center">1 GB</p></td>
                    <td width=8%> <p align="center">130 MB</p></td>
                    <td width=20%> <p>Solaris 10 OS</p></td>
                    <td width=24%> <p> Mozilla 1.7 suportado pela Sun</p></td>
                </tr>
                <tr valign=top>
                    <td width=14%> <p>Solaris (x86/x64 Platform Edition)</p></td>
                    <td width=14%> <p>Intel Pentium 4 (ou equivalente) com velocidade de processamento de 1 GHz</p></td>
                    <td width=8%> <p align="center">1 GB</p></td>
                    <td width=8%> <p align="center">130 MB</p></td>
                    <td width=20%> <p>      Solaris 10 OS</p></td>
                    <td width=24%> <p> Mozilla 1.7 suportado pela Sun</p></td>
                </tr>
                <tr valign=top>
                    <td width=14%> <p>Microsoft Windows</p></td>
                    <td width=14%> <p>Intel Pentium 4 (ou equivalente) com velocidade de processamento de 1 GHz</p></td>
                    <td width=8%> <p align="center">1 GB</p></td>
                    <td width=8%> <p align="center">130 MB</p></td>
                    <td width=20%> <p>Windows 2000 Professional Edition (Service Pack 4), <br> Windows XP Professional Edition (Service Pack 2)<br>
                    </p></td>
                    <td width=24%> <p>Internet Explorer 5.5 Service Pack 2 (Windows 2000)<br> Internet Explorer 6 Service Pack 2 (Windows XP)
                    </p></td>
                </tr>
                <tr valign=top>
                    <td width=14%> <p>Linux</p></td>
                    <td width=14%> <p>Intel Pentium 4 (ou equivalente) com velocidade de processamento de 1 GHz</p></td>
                    <td width=8%> <p align="center">1 GB</p></td>
                    <td width=8%> <p align="center">130 MB</p></td>
                    <td width=20%> <p>Red Hat Fedora Core 3 (exceto quando estiver sendo executado no local zh_CN e possivelmente em outros locais asi&aacute;ticos - consulte abaixo o problema conhecido <a href="#render">Problemas de renderiza&ccedil;&atilde;o</a>.)
                    </p></td>
                    <td width=24%> <p>Firefox 1.0.4 (m&iacute;nimo) </p></td>
                </tr>
                <tr valign=top>
                    <td width=14%> <p>Mac OS</p></td>
                    <td width=14%> <p>1 GHz PowerPC G4<br> 1.83 GHz Intel Dual Core </p></td>
                    <td width=8%> <p align="center">1 GB</p></td>
                    <td width=8%> <p align="center">130 MB</p></td>
                    <td width=20%> <p>Macintosh OS 10.4, 10.4.5 </p></td>
                    <td width=24%> <p>Safari 1.2.1 no m&iacute;nimo (Safari 2 no m&iacute;nimo para OS 10.4.5), Mozilla 1.6</p></td>
                </tr>
            </table><br><br>
            <h3>Software necess&aacute;rio</h3>
            <p>Antes da instala&ccedil;&atilde;o do NetBeans Visual Web Pack 5.5, o software abaixo deve ser instalado:</p>
            <ul>
                <li><a href="http://services.netbeans.org/downloads/" target="_blank">NetBeans IDE 5.5</a>.</li>
                <li><a href="http://java.sun.com/javase/downloads/index.jsp" target="_blank">Java SE Development Kit (JDK) 5.0 atualiza&ccedil;&atilde;o 6 (vers&atilde;o 1.5.0_06)</a> ou superior.<br> <br> Se n&atilde;o tiver o JDK 5.0 atualiza&ccedil;&atilde;o 6 ou superior instalado, n&atilde;o &eacute; poss&iacute;vel prosseguir com a instala&ccedil;&atilde;o. Voc&ecirc; pode fazer o download deste JDK na p&aacute;gina de <a href="http://java.sun.com/javase/downloads/index.jsp" target="_blank">downloads do Java SE</a>. <br> <br> Observe que as instala&ccedil;&otilde;es do Mac OS X requer Java 2 Standard Edition (J2SE) 5.0 vers&atilde;o 4. Voc&ecirc; pode fazer o download deste JDK na p&aacute;gina de <a href="http://www.apple.com/support/downloads/" target="_blank">downloads da Apple</a>. Procure &quot;J2SE&quot; para encontrar essa vers&atilde;o. </li>
                <li> Um servidor de aplicativos <br> <br> Para tirar proveito dos bancos de dados e dos aplicativos de amostra do Visual Web Pack e para desenvolver aplicativos visuais da Web com o Java EE5, use o servidor de aplicativos Sun Java System 9, Platform Edition, o servidor de aplicativos do Java EE 5 de c&oacute;digo aberto. Para obter mais informa&ccedil;&otilde;es, consulte <a href="http://www.sun.com/software/products/appsrvr/index.xml" target="_blank">Downloads do Java EE</a>. </li>
            </ul>
            <br>
            <h3>Tecnologias compat&iacute;veis</h3>
            <p><b>O NetBeans Visual Web Pack 5.5 &eacute; compat&iacute;vel com as seguintes tecnologias:</b></p>
            <ul>
                <li>Enterprise JavaBeans (EJB) 3.0</li>
                <li>JAX-WS 2.0</li>
                <li>Java Persistence (JSR-220)</li>
                <li>JavaServer Faces 1.2 (JSR-127)</li>
                <li>Java Servlet 2.5</li>
                <li>JavaServer Pages (JSP) 2.1</li>
                <li>Struts 1.2.9</li>
                <li>API de Java para Chamadas de Procedimento Remoto (RPCs) baseadas em XML (JAX-RPC) 1.6.</li>
                <li>APIs de Java para registros de XML (JAXR) 1.0</li>
                <li>API de Java para processamento de XML (JAXR) 1.2</li>
                <li>JavaServer Pages Standard Tag Library 1.1</li>
            </ul>
            <div class="greybox" style="">
                <p><b>Observa&ccedil;&atilde;o:</b> o uso de vers&otilde;es do JBoss, WebLogic ou Struts que n&atilde;o as especificadas pode alterar o funcionamento do IDE de forma imprevis&iacute;vel, porque as interfaces externas n&atilde;o s&atilde;o controladas pela equipe do projeto. </p>
            </div>
            <p><b>O NetBeans IDE 5.5 foi testado com os seguintes servidores de aplicativo:</b></p>
            <ul>
                <li>Servidor de aplicativos Sun Java System PE 9.0, vers&atilde;o de atualiza&ccedil;&atilde;o 1</li>
                <!--<li>Sun Java System Application Server PE 8.1 update 2</li>-->
                <li>Servidor de aplicativos Sun Java System PE 8.2</li>
                <li>Tomcat 5.5.17</li>
                <li>JBoss 4.0.4</li>
                <li>WebLogic 9.1</li>
            </ul>
            <div class="greybox">
                <p>Se estiver usando o servidor de aplicativos GlassFish, recomenda-se executar a compila&ccedil;&atilde;o final do GlassFish V1 UR1 (compila&ccedil;&atilde;o 14) para trabalhar com o NetBeans IDE 5.5.</p>
            </div>
            <h3>Aplicativos firewall</h3>
            <p>Os aplicativos firewall ativados podem impedir que alguns componentes sejam configurados corretamente durante o processo de instala&ccedil;&atilde;o. Consulte a documenta&ccedil;&atilde;o do seu firewall para determinar se deve ser desativado antes da instala&ccedil;&atilde;o.</p>
        </blockquote> <p align=center><a href="#top">superior</a></p>
        <!-- CONFIG INFO -->
        <h2><a name=configinfo></a>Informa&ccedil;&otilde;es de configura&ccedil;&atilde;o</h2>
        <p>As informa&ccedil;&otilde;es sobre a configura&ccedil;&atilde;o de bancos de dados e servidores de aplicativos no NetBeans Visual Web Pack 5.5 podem ser encontradas no <a href="vwp-install_pt_BR.html#configinfo">Guia de instala&ccedil;&atilde;o</a>. </p>
        <p>Se o Visual Web Pack estiver configurado para usar o servidor de aplicativos Sun Java System 9, Platform Edition, ent&atilde;o um servidor de bancos de dados incorporado (Java DB) estar&aacute; inclu&iacute;do. Para obter mais informa&ccedil;&otilde;es sobre o Java DB, consulte <a href="http://developers.sun.com/prodtech/javadb/" title="Uma r&aacute;pida descri&ccedil;&atilde;o do Java DB" target="_blank">Uma r&aacute;pida descri&ccedil;&atilde;o do Java DB</a>. Ap&oacute;s a configura&ccedil;&atilde;o do servidor de aplicativos Sun Java System e a reinicializa&ccedil;&atilde;o do IDE, s&atilde;o configurados um banco de dados de amostra denominado <b>Travel</b> e uma conex&atilde;o de banco de dados para <b>Travel</b>. Se a pasta base, localizada em <tt>&lt;HOME&gt;/.netbeans/5.5</tt>, for removida, os bancos de dados permanecer&atilde;o intactos at&eacute; a pr&oacute;xima reconfigura&ccedil;&atilde;o do servidor de aplicativos Sun Java System. A pasta do banco de dados de amostra se localiza na pasta base <tt>.netbeans-derby</tt>. </p>
        <p><span class="bold"><b>Observa&ccedil;&atilde;o: </b></span>Antes de determinar uma conex&atilde;o de bancos de dados para o banco de dados Travel, voc&ecirc; deve iniciar o Java DB. </p>
        <blockquote>
            <h3><a name="bundledDB"></a>Banco de dados incorporado</h3>
            <p>Se instalar o servidor de aplicativos Sun Java System, voc&ecirc; poder&aacute; configurar o banco de dados Java DB incorporado para trabalhar tamb&eacute;m com o NetBeans Visual Web Pack 5.5. </p>
            <p>Para configurar o servidor Java DB de uma instala&ccedil;&atilde;o independente do NetBeans IDE 5.5:
            <ol>
                <li>Abra o IDE.</li>
                <li>Registre o servidor de aplicativos Sun Java System na janela Tempo de execu&ccedil;&atilde;o do NetBeans IDE conforme descrito no <a href="vwp-install_pt_BR.html#config_sjas">Guia de instala&ccedil;&atilde;o</a>.
                <li>Escolha Ferramentas &gt; Op&ccedil;&otilde;es e, na caixa de di&aacute;logo Op&ccedil;&otilde;es, clique em Op&ccedil;&otilde;es avan&ccedil;adas.</li>
                <li>Expanda Configura&ccedil;&atilde;o do IDE &gt; Configura&ccedil;&otilde;es de servidores e ferramentas externas e selecione Banco de dados Java DB para verificar as configura&ccedil;&otilde;es do banco de dados.</li>
            </ol>
            <h3>Restaurando conex&otilde;es de bancos de dados<a name="restdbcon"></a></h3>
            <p>Ao abrir projetos do Java Studio Creator que t&ecirc;m componentes vinculados aos conjuntos de linhas no Visual Web Pack, o IDE n&atilde;o encontra as fontes de dados. Ao importar um projeto para o Visual Web Pack, o IDE lhe aconselha a fazer backup desse projeto visto que n&atilde;o poder&aacute; ser aberto no Java Studio Creator. Para resolver o problema de conex&otilde;es de dados ausentes, adicione o driver do banco de dados e, em seguida, reconecte o projeto ao banco de dados. N&atilde;o &eacute; necess&aacute;rio adicionar o driver do banco de dados se o projeto usar o Java DB e se o servidor de aplicativos Sun Java System tiver sido instalado conforme o descrito em <a href="#bundledDB">Banco de dados incorporado</a>. </p>
            <div>Para adicionar um driver de banco de dados: </div>
            <ol>
                <li>Abra a janela Tempo de execu&ccedil;&atilde;o. </li>
                <li>Expanda o n&oacute; Banco de dados. Clique com o bot&atilde;o direito do mouse em Drivers e escolha Novo driver. </li>
                <li>Na janela Novo driver JDBC, clique em Adicionar. Navegue at&eacute; o arquivo <tt>.jar</tt> do banco de dados e clique em Abrir.</li>
                <li>Selecione Classe do driver, digite um nome para o banco de dados (ou mantenha o padr&atilde;o) e clique em OK. </li>
                <li>Clique com o bot&atilde;o direito do mouse no n&oacute; Bancos de dados e escolha Nova conex&atilde;o.</li>
                <li>
                    <p>Na caixa de di&aacute;logo Nova conex&atilde;o de banco de dados: </p>
                    <ol type="a">
                        <li>Selecione o banco de dados da lista suspensa Nome.</li>
                        <li>Digite a URL do banco de dados.</li>
                        <li>Digite o nome de usu&aacute;rio e a senha. </li>
                        <li>Clique em OK. </li>
                    </ol>
                </li>
                <li>No n&oacute; Bancos de dados, clique com o bot&atilde;o direito do mouse na URL de banco de dados associada ao banco de dados. Depois clique com o bot&atilde;o direito do mouse na conex&atilde;o de bancos de dados e escolha Conectar. Ser&aacute; solicitada uma senha.</li>
            </ol>
            <p>Consulte <a href="#sup_dat">Bancos de dados suportados, Drivers JDBC e Recipientes de implanta&ccedil;&atilde;o</a> para obter mais informa&ccedil;&otilde;es sobre os drivers e as URLs de banco de dados.</p>
            <div>Para resolver o problema da conex&atilde;o de bancos de dados:</div>
            <ol><li>
                    <p>Abra a janela Projetos. O IDE procura as conex&otilde;es de dados que est&atilde;o faltando. Observe que quanto maior for o projeto, mais tempo esse processo ir&aacute; demorar.</p>
                Quando o IDE verifica que essas conex&otilde;es de dados est&atilde;o faltando, ele marca com um &iacute;cone o n&oacute; do projeto e exibe o nome em vermelho.</li>
                <li>Clique com o bot&atilde;o direito do mouse no projeto com a conex&atilde;o de dados ausente e escolha Resolver problemas de banco de dados no menu pop-up.</li>
                <li>Na caixa de di&aacute;logo Resolver fonte(s) de dados, selecione o nome do banco de dados e clique em Adicionar conex&atilde;o de dados.</li>
                <li>
                    <p>Na caixa de di&aacute;logo Adicionar conex&atilde;o de banco de dados, selecione seu banco de dados na lista suspensa Tipo de servidor, forne&ccedil;a as informa&ccedil;&otilde;es solicitadas e clique em OK.</p>
                    Para os aplicativos de Java Studio Creator que usam Java DB, digite o ID de usu&aacute;rio e senha associados ao aplicativo. Por exemplo, o ID de usu&aacute;rio e a senha do projeto CorporateTravelCenter s&atilde;o <tt>travel</tt>. A URL de banco de dados possui o seguinte formato: <tt>jdbc:derby://<em>nome_do_host</em>:<em>n&uacute;mero_da_porta</em>/<em>nome_do_banco_de_dados</em></tt>. Por exemplo, a URL de banco de dados do banco de dados Travel incorporado ao Java DB na porta padr&atilde;o &eacute; <tt>jdbc:derby://localhost:1527/travel</tt>.</li>
            </ol>
            <h3><a name="sup_dat"></a>Bancos de dados suportados, Drivers JDBC e Recipientes de implanta&ccedil;&atilde;o</h3>
            <p>O NetBeans Visual Web Pack 5.5 &eacute; testado nos seguintes bancos de dados e drivers:
            <ul><li><a href="#oracleoracle">Driver Oracle / Banco de dados Oracle</a></li>
                <li><a href="#mssql">Driver Microsoft / Banco de dados SQL Server</a></li>
                <li><a href="#ibmdb2">Driver IBM / Banco de dados IBM</a></li>
                <li><a href="#dd">DataDirect / Oracle/SQLServer/DB2/Sybase </a></li>
            </ul>
            <p class="titlectable"><a name="oracleoracle"></a>Driver Oracle testado no banco de dados Oracle:
                <table BORDER=1 CELLPADDING=4 CELLSPACING=3 summary="oracle driver info">
                    <col width="1*"><col width="3*"><tr><td>Local do driver</td><td><a href="http://www.oracle.com/technology/software/tech/java/sqlj_jdbc/htdocs/jdbc_10201.html" target="_blank">Oracle Database 10g Release 2 JDBC Drivers</a></td>
                    </tr>
                    <tr>
                        <td>Vers&otilde;es do driver</td>
                        <td>Banco de dados Oracle 10g vers&atilde;o 2 (10.2.0.2)
                    </td></tr>
                    <tr>
                        <td>Arquivo JAR do driver</td>
                        <td><tt> ojdbc14.jar </tt></td>
                    </tr>
                    <tr>
                        <td>Nomes de classe do driver</td>
                        <td> oracle.jdbc.driver.OracleDriver </td>
                    </tr>
                    <tr>
                        <td>Formatos de URL</td>
                        <td> jdbc:oracle:thin:@//<em>nomedohost</em>:<em>porta</em>/<em>bancodedados</em></td>
                    </tr>
                    <tr>
                        <td>URL de exemplo</td>
                        <td> jdbc:oracle:thin:@//localhost:1521/ora9i </td>
                </tr></table>
            </p>
            <p><a name="mssql"></a><span class="titlectable">Driver Microsoft testado no banco de dados SQL Server:</span>
                <table BORDER=1 CELLPADDING=4 CELLSPACING=3 summary="ms sql driver info">
                    <col width="1*"><col width="3*"><tr><td>Local do driver</td>
                        <td><a href="http://www.microsoft.com/downloads/details.aspx?FamilyId=6D483869-816A-44CB-9787-A866235EFC7C&displaylang=en" target="_blank">Microsoft SQL Server 2005 JDBC Driver 1.1</a></td>
                    </tr>
                    <tr><td>Vers&atilde;o do driver</td>
                        <td>Microsoft SQL Server 2005 JDBC Driver 1.1<br> <tt>sqljdbc_1.1.1501.101_enu.tar.gz</tt></td>
                    </tr>
                    <tr>
                        <td>Arquivo JAR do driver</td>
                        <td><tt>sqljdbc.jar</tt></td>
                    </tr>
                    <tr><td>Nome de classe do driver</td><td> com.microsoft.sqlserver.jdbc.SQLServerDriver </td>
                    </tr>
                    <tr><td>Formato de URL</td>
                        <td> jdbc:sqlserver://<em>nomedohost</em>:1433;databaseName=<em>bancodedados</em>;selectMethod=cursor </td>
                    </tr>
                    <tr><td>URL de exemplo</td><td> jdbc:sqlserver://localhost:1433;databaseName=travel;selectMethod=cursor </td>
            </tr></table></p>
            <p class="titlectable"><a name="ibmdb2"></a>Drivers IBM testados com o banco de dados DB2:
                <table BORDER=1 CELLPADDING=4 CELLSPACING=3 summary="ibm driver info" ><col width="1*"><col width="3*"><tr><td>Local do driver</td><td><a href="https://www14.software.ibm.com/webapp/iwm/web/preLogin.do?pkgid=&S_SRCID=rjd&source=rjd&S_TACT=104AH+W42&S_CMP=&S_PKG=dl_82&s=z&ltype=input&l=All+Lang+per+ESD%2FPA+Media&mtype=input&m=download&id=2004-09-20+10%3A09%3A21.003415R&fam=&cat=" target="_blank">DB2 Personal Developer's Edition: Redistributable JDBC Type 4 Driver</a> (requer registro)</td>
                    </tr>
                    <tr><td>Vers&atilde;o do driver</td><td>Redistributable DB2 JDBC Type 4 driver v8 fixpack 11 <br> <tt>db2_jdbc_t4_fp11.zip</tt></td>
                    </tr>
                    <tr><td>Arquivos JAR do driver</td>
                        <td>Type 4<ul>
                                <li><tt>db2jcc.jar</tt></li>
                                <li><tt>2jcc_license_cu.jar</tt></li>
                        </ul></td>
                    </tr>
                    <tr><td>Nome de classe do driver</td><td> com.ibm.db2.jcc.DB2Driver </td>
                    </tr>
                    <tr>
                        <td>Formato de URL (Type 4) </td>
                        <td> jdbc:db2://<em>nomedohost</em>:<em>porta</em>/<em>bancodedados</em> </td>
                    </tr>
                    <tr><td>URL de exemplo</td>
                        <td>jdbc:db2://localhost:50002/sample</td>
            </tr></table> </p>
            <p><b>Observa&ccedil;&atilde;o: </b>Os drivers IBM oferecem suporte para Type 2 (nativo) e Type 4 (Java puro). Para obrigar os drivers a se executarem em Type 4, adicione a propriedade: driverType = 4 ao conectar ao banco de dados.</p>
            <p class="titlectable"><a name="dd"></a>Drivers DataDirect testados com banco de dados Oracle, SQL Server, DB2 e Sybase: </p>
            <table BORDER=1 CELLPADDING=4 CELLSPACING=3 summary="datadirect driver info"><col width="1*"><col width="3*"><tr><td>Local do driver</td><td><a href="http://www.datadirect.com/downloads/registration/connect_jdbc/index.ssp" target="_blank">DataDirect Connect for JDBC, Release 3.6 Service Pack 1</a></td>
                </tr>
                <tr>
                    <td>Vers&otilde;es do driver</td>
                    <td>DataDirect Connect para JDBC - 3.6<br> DataDirect Connect para JDBC - 3.6.07
                </td></tr>
                <tr>
                    <td>Arquivos <tt>.jar</tt> do driver</td><td>Os arquivos <tt>.jar</tt> do driver DataDirect
                        <ul>
                            <li><tt>base.jar</tt></li>
                            <li><tt>util.jar</tt></li>
                            <li><tt>spy.jar</tt></li>
                            <li><tt>resource.jar</tt></li>
                            <li><tt>oracle.jar</tt></li>
                            <li><tt>sybase.jar</tt></li>
                            <li><tt>sqlserver.jar</tt></li>
                            <li><tt>db2.jar</tt></li>
                            <li><tt>informix.jar</tt></li>
                    </ul></td>
                </tr>
                <tr>
                    <td>Nomes de classe do driver</td>
                    <td>Classes do driver DataDirect
                        <ul>
                            <li>com.ddtek.jdbc.oracle.OracleDriver</li>
                            <li>com.ddtek.jdbc.sqlserver.SQLServerDriver</li>
                            <li>com.ddtek.jdbc.db2.DB2Driver</li>
                            <li>com.ddtek.jdbc.sybase.SybaseDriver</li>
                </ul></td></tr>
                <tr>
                    <td>Formatos de URL</td>
                    <td>
                        Formatos de URL de DataDirect
                        <ul>
                            <li>jdbc:datadirect:oracle://<em>nome_do_servidor</em>[:<em>n&uacute;merodaPorta</em>];SID=<em>bancodedados</em></li>
                            <li>jdbc:datadirect:sqlserver://<em>nome_do_servidor</em>[:<em>n&uacute;merodaPorta</em>];nomedoBancodedados=<em>bancodedados</em></li>
                            <li>jdbc:datadirect:db2://<em>nome_do_servidor</em>[:<em>n&uacute;merodaPorta</em>]nomedoBancodedados=<em>bancodedados</em></li>
                            <li>jdbc:datadirect:sybase://<em>nome_do_servidor</em>[:<em>n&uacute;merodaPorta</em></li>
                </ul></td></tr>
                <tr>
                    <td>URLs de exemplo</td>
                    <td><tt>jdbc:datadirect:oracle://localhost;SID=ora9i</tt><br> <tt>jdbc:datadirect:sqlserver://localhost:1433;DatabaseName=travel;SelectMethod=cursor</tt><br> <tt>jdbc:datadirect:db2://localhost:50002;databaseName=sample</tt></td>
            </tr></table>
        </blockquote>
        <p align=center><a href="#top">superior</a></p>
        <!-- SAMPLE APPLICATIONS --> <a name="sampleapp"></a><h2>Aplicativos de amostra</h2>
        <p>Para usar os aplicativos de amostra do Visual Web Pack, voc&ecirc; deve criar um novo projeto do Visual Web que use o aplicativo e conectar o projeto ao banco de dados de amostra, se um banco de dados tiver sido fornecido.</p>
        <p>
            O Visual Web Pack deve incluir as atualiza&ccedil;&otilde;es dos novos bancos de dados e aplicativos de amostra. Ap&oacute;s realizar uma atualiza&ccedil;&atilde;o, para verificar se h&aacute; novos aplicativos de amostra, escolha Arquivo &gt; Novo projeto para abrir o assistente para Novo projeto e, em seguida, escolha Amostras &gt; Visual Web para ver a lista de aplicativos de amostra no painel direito. Para criar um aplicativo de amostra:
            <ol>
                <li>
                    <p>Escolha Arquivo &gt; Novo projeto.</p>O assistente para Novo projeto &eacute; aberto.
                </li>
                <li>No painel Categorias do assistente para Novo projeto, expanda o n&oacute; Amostras e selecione Visual Web. </li>
                <li>Selecione o projeto de amostra no painel Projetos e clique em Pr&oacute;ximo para continuar.</li>
                <li>
                    <p>Digite o nome do projeto no campo Nome do projeto.</p>
                O IDE sugere um nome que pode ser editado.</li>
                <li>
                    <p>Com base no nome do projeto, o IDE sugere o local e a pasta do projeto. Voc&ecirc; pode alterar o local do projeto.</p>
                    O IDE cria um nome de pasta com base nas informa&ccedil;&otilde;es que voc&ecirc; introduziu. O IDE sugere um pacote Java padr&atilde;o para o projeto. Voc&ecirc; pode alterar o nome do pacote Java digitando um novo nome.
                    <li>Certifique-se de que o Java Blueprints esteja selecionado na lista suspensa Estrutura da fonte.</li>
                    <li>
                        <p>Certifique-se de que o servidor de aplicativos Sun Java System esteja selecionado na lista suspensa Servidor.
                        </p>
                    Se encontrar o servidor de aplicativos Sun Java System na lista, voc&ecirc; deve registrar o servidor no NetBeans conforme descrito na Ajuda, no t&oacute;pico Registrando uma inst&acirc;ncia do servidor de aplicativos Sun Java System.</li>
                    <li>Selecione o Java EE5 na lista suspensa Vers&atilde;o do Java EE e clique em Finalizar para criar o projeto.
                    </li>
                </li>
            </ol>
        </p>

<!-- START : additional description for ML users -->
	<h3>Aplicativos de amostra incorporados</h3>

	<p>Os aplicativos de amostra fornecidos com o Visual Web Pack podem ser usados ao criar um novo projeto do Visual Web a partir do assistente para Novo projeto.</p>

	<p>Encontram-se dispon&iacute;veis dois projetos de amostra, Administra&ccedil;&atilde;o de filmes e Biblioteca de classe de filmes. O projeto Administra&ccedil;&atilde;o de filmes dever ser usado com o projeto Biblioteca de classe de filmes.  Al&eacute;m disso, visto que essas amostras trabalham com o Java EE 5, o servidor de aplicativos Sun Java System 9 precisa executar o projeto Administra&ccedil;&atilde;o de filmes.</p>

	<p>Para usar esses projetos de amostra:
	<ol>
	    <li><p>Registre o servidor de aplicativos Java System 9 no IDE.
    	    <ul type=a>
	        <li>Na janela Tempo de execu&ccedil;&atilde;o, clique com o bot&atilde;o direito do mouse em Servidores e selecione Adicionar servidor.</li>
    	        <li>Selecione o tipo do servidor, forne&ccedil;a um nome para sua inst&acirc;ncia e clique em Pr&oacute;ximo.</li>
                <li>Defina as propriedades da inst&acirc;ncia do servidor e clique em Finalizar.</li>
	    </ul></p></li>
     	    <li><p>Escolha Arquivo &gt; Novo projeto.<br> O assistente para Novo projeto &eacute; aberto.</p></li>
            <li><p>No painel Categorias do assistente para Novo projeto, expanda o n&oacute; Amostras e selecione Visual Web.</p></li>
 	    <li><p>Selecione o projeto Biblioteca de classe de filmes no painel Projetos e clique em Pr&oacute;ximo para continuar.</p></li>
 	    <li><p>Digite o nome e o local do projeto se necess&aacute;rio e clique em Finalizar.<br> O projeto MoviesClassLibrary &eacute; criado por padr&atilde;o.</p></li>
 	    <li><p>Escolha Arquivo &gt; Novo projeto.</p></li>
            <li><p>Selecione o projeto Administra&ccedil;&atilde;o de filmes no painel Projetos e clique em Pr&oacute;ximo para continuar.</p></li>
	    <li><p>Digite o nome e o local do projeto se necess&aacute;rio e clique em Finalizar.<br> O projeto MovieAdmin &eacute; criado por padr&atilde;o.</p>
	        <p>No entanto, podem ocorrer erros de biblioteca, j&aacute; que esse projeto ainda n&atilde;o possui a biblioteca necess&aacute;ria. Os erros podem ser corrigidos adotando o procedimento abaixo.
	    <ul type=a>
	        <li>Se o projeto Filmes n&atilde;o estiver definido como projeto principal, clique com o bot&atilde;o direito do mouse no projeto Filmes e escolha Definir como projeto principal.</li>
 		<li>Na janela Projetos, clique com o bot&atilde;o direito do mouse no n&oacute; do projeto MovieAdmin e escolha Propriedades no menu contextual.</li>
	 	<li>Na caixa de di&aacute;logo Propriedades do projeto, na &aacute;rvore da esquerda, clique em Bibliotecas.  Clique no bot&atilde;o Adicionar projeto.</li>
		<li>Na caixa de di&aacute;logo Adicionar projeto, navegue at&eacute; o projeto MoviesClassLibrary e clique nele, em seguida, clique no bot&atilde;o Adicionar arquivos JAR do projeto.</li>
		<li>Na caixa de di&aacute;logo Propriedades do projeto, clique no bot&atilde;o OK.</li>
		<li>Na janela Projetos, clique com o bot&atilde;o direito do mouse no n&oacute; do projeto MoviesClassLibrary e escolha Construir projeto no menu contextual.</li>
	    </ul></p></li>
	    <li>Na janela Projetos, clique com o bot&atilde;o direito do mouse no n&oacute; do projeto MovieAdmin e escolha Executar projeto no menu contextual.</li>
	</ol>
	</p>
<!-- END : additional description for ML users -->

        <p align=center><a href="#top">superior</a></p>
        <!-- KNOWN ISSUES -->
        <h2><a name="changenotes"></a>Notas sobre altera&ccedil;&otilde;es</h2>
        Essa se&ccedil;&atilde;o descreve as altera&ccedil;&otilde;es realizadas no NetBeans Visual Web Pack de uma vers&atilde;o para a outra.
        <h3>NetBeans Visual Web Pack 5.5 FCS </h3>
        <br><b><span style="color: rgb(4, 84, 145);">Atualiza&ccedil;&atilde;o da vers&atilde;o de produ&ccedil;&atilde;o</span></b>
        <blockquote><p>As instru&ccedil;&otilde;es para a atualiza&ccedil;&atilde;o da Visualiza&ccedil;&atilde;o da tecnologia NetBeans Visual Web Pack 5.5 est&atilde;o no <a href="vwp-install_pt_BR.html#upgrade">Guia de instala&ccedil;&atilde;o</a>.</p></blockquote>
        <b><span style="color: rgb(4, 84, 145);">As bibliotecas de componentes descarregadas j&aacute; n&atilde;o s&atilde;o exibidas automaticamente na Paleta.</span></b>
        <blockquote>
            <p><strong>Descri&ccedil;&atilde;o: </strong>A UI do NetBeans Visual Web Pack 5.5 foi alterada. Para exibir a biblioteca de componentes na Paleta, importe o arquivo complib para o IDE e adicione-o a um projeto. Os complibs importados n&atilde;o s&atilde;o exibidos em todos os projetos, mas somente nos projetos aos quais foram adicionados.
            <p>Para obter mais informa&ccedil;&otilde;es, consulte o tutorial <a href="../../../kb/55/vwp-ajaximportcomponents_pt_BR.html">Fazendo download e importando componentes Ajax e outros componentes</a> e o t&oacute;pico da Ajuda, Sobre bibliotecas de componentes.</p>
        </blockquote>
        <p align=center><a href="#top">superior</a></p>
        <!-- KNOWN ISSUES -->
        <h2><a name=knownissues></a>Problemas conhecidos</h2>
        <p> Essa se&ccedil;&atilde;o trata dos problemas n&atilde;o resolvidos dessa vers&atilde;o. Para obter mais informa&ccedil;&otilde;es, consulte <a href="http://wiki.netbeans.org/wiki/view/NetBeansVWPUserFAQ">FAQ do NetBeans Visual Web Pack</a>. </p>
        <blockquote>
            <h3>Banco de dados de amostra</h3>
            <!--  Bug ID: 6472618 http://bt2ws.central.sun.com/CrPrint?id=6472618  --> <br> <b><span style="color: rgb(4, 84, 145);">O servidor de aplicativos Sun 9 Platform Edition precisa que o IDE seja reiniciado.</span></b>
            <blockquote>
                <p><strong>Descri&ccedil;&atilde;o: </strong>Para usar o banco de dados Travel com o servidor de aplicativos Sun 9 PE, o IDE deve ser reiniciado depois que o servidor de aplicativos tiver sido selecionado na janela Servidores.</p>
            </blockquote>
            <h3>Limpar e construir</h3><br> <!--  Bug ID: 6467949 http://bt2ws.central.sun.com/CrPrint?id=6473912  --> <b><span style="color: rgb(4, 84, 145);">Limpar e construir falha ap&oacute;s a implanta&ccedil;&atilde;o do aplicativo.</span></b>
            <blockquote>
                <p><strong>Descri&ccedil;&atilde;o: </strong>A implanta&ccedil;&atilde;o do aplicativo retorna o erro &quot;Imposs&iacute;vel excluir o arquivo <tt>...\build\web\WEB-INF\lib\appbase.jar</tt>&quot;.</p>
                <p><strong>Solu&ccedil;&atilde;o: </strong>Pare e reinicie o servidor de aplicativos e implante o aplicativo novamente.            </p>
            </blockquote>
            <h3>Apar&ecirc;ncia do bot&atilde;o</h3><br> <!-- Bug ID: 6470992 http://bt2ws.central.sun.com/CrPrint?id=6470992 --> <b><span style="color: rgb(4, 84, 145);">O texto do bot&atilde;o na barra de ferramentas de edi&ccedil;&atilde;o n&atilde;o existe ou est&aacute; truncado.</span></b>
            <blockquote>
                <p><strong>Descri&ccedil;&atilde;o: </strong>No Microsoft Windows XP, usando o estilo de exibi&ccedil;&atilde;o do Windows XP, o texto do bot&atilde;o &eacute; substitu&iacute;do por retic&ecirc;ncias. Esse problema est&aacute; relacionado ao JDK 5.0 atualiza&ccedil;&atilde;o 8 (vers&atilde;o 1.5.0_08).</p>
                <p><strong>Solu&ccedil;&atilde;o: </strong>Altere o estilo de exibi&ccedil;&atilde;o para Windows Classic da seguinte forma:
                <ol>
                    <li>Escolha In&iacute;cio &gt; Configura&ccedil;&otilde;es &gt; Painel de controle.</li>
                    <li>No Painel de controle, clique duas vezes em Exibi&ccedil;&atilde;o.</li>
                <li>Na guia Apar&ecirc;ncia, escolha o estilo Windows Classic em Janelas e bot&otilde;es.</li></ol>
            </blockquote>
            <h3>Bibliotecas de componentes e JBoss</h3><br> <b><span style="color: rgb(4, 84, 145);"> Os componentes da biblioteca de componentes webui (baseada em JSF 1.1/J2EE 1.4), fornecida com o NetBeans Visual Web Pack 5.5, n&atilde;o funcionam bem. </span></b>
            <blockquote>
                <p><strong>Descri&ccedil;&atilde;o: </strong>Quando um projeto &eacute; criado, a classpath &eacute; verificada no recipiente e quando uma implementa&ccedil;&atilde;o MyFaces &eacute; encontrada, tal implementa&ccedil;&atilde;o tem prioridade. A remo&ccedil;&atilde;o da implementa&ccedil;&atilde;o MyFaces obriga o aplicativo a incorporar as bibliotecas JSF-RI.</p>
                <p><strong>Solu&ccedil;&atilde;o: </strong>Mova o arquivo abaixo do diret&oacute;rio padr&atilde;o antes de criar projetos no Visual Web Pack para o recipiente: </p>
            <tt>JBOSS_HOME/server/default/deploy/jbossweb-tomcat55.sar/jsf-lib</tt></blockquote>
            <h3>Implanta&ccedil;&atilde;o de Java EE5</h3>
            <!-- http://bt2ws.central.sun.com/CrPrint?id=6479877
            https://netbeans.org/bugzilla/show_bug.cgi?id=77122
            http://glassfish.dev.java.net/issues/show_bug.cgi?id=1197--><br> <b><span style="color: rgb(4, 84, 145);">A implanta&ccedil;&atilde;o do aplicativo trava.</span></b>
            <blockquote>
                <p><strong>Descri&ccedil;&atilde;o: </strong>A implanta&ccedil;&atilde;o de aplicativos do Java EE 5 no servidor de aplicativos Sun Java System trava porque o gerenciador de implanta&ccedil;&atilde;o do servidor depende do c&oacute;digo que n&atilde;o &eacute; &quot;thread safe&quot; (segmento seguro). </p>
                <p>Esse problema parece limitar-se a computadores com multiprocessador ou com v&aacute;rios n&uacute;cleos que executam o Windows XP. </p>
                <p><strong>Solu&ccedil;&atilde;o: </strong>Reinicie o IDE e use o gerenciador de servidores:<ol><li>Reinicie o servidor de aplicativos se necess&aacute;rio.</li><li>Desimplante todos os aplicativos.</li>
                    <li>Reimplante os aplicativos.</li></ol>
                Se n&atilde;o for poss&iacute;vel iniciar ou parar o servidor de aplicativos, pare todos os processos Java atrav&eacute;s do gerenciador de tarefas antes de reiniciar o IDE. </p>
            </blockquote>
            <h3>Renomea&ccedil;&atilde;o de pastas do projeto</h3>
            <!-- http://bt2ws.central.sun.com/CrPrint?id=6481988--> <br> <b><span style="color: rgb(4, 84, 145);">A renomea&ccedil;&atilde;o de uma pasta do projeto lan&ccedil;a IllegalStateException.</span></b>
            <blockquote>
                <p><strong>Descri&ccedil;&atilde;o: </strong>O IDE lan&ccedil;a <tt>IllegalStateException</tt> ao reabrir um projeto com uma pasta renomeada ou ao reabrir uma pasta com uma p&aacute;gina renomeada.</p>
                <p><strong>Solu&ccedil;&atilde;o: </strong>Renomeie somente as pastas de dentro do n&oacute; Pacotes de fontes. Clique com o bot&atilde;o direito do mouse na pasta que est&aacute; nesse n&oacute; e escolha Refatorar&nbsp;&gt;&nbsp;Renomear no menu pop-up. Observe que o IDE atualmente n&atilde;o suporta a renomea&ccedil;&atilde;o do pacote padr&atilde;o do Bean.</p>
            </blockquote>
            <h3>Vincula&ccedil;&atilde;o de dados</h3>
            <!-- http://bt2ws.central.sun.com/CrPrint?id=6481512 --><br> <b><span style="color: rgb(4, 84, 145);">A vincula&ccedil;&atilde;o de um componente Drop Down List aos dados da tabela retorna uma exce&ccedil;&atilde;o.</span></b>
            <blockquote>
                <p><strong>Descri&ccedil;&atilde;o: </strong>Ao usar o MySQL, a tentativa de vincular um componente Drop Down List aos dados da tabela retorna um IllegalArgumentException.</p>
                <p><strong>Solu&ccedil;&atilde;o: </strong>Quando esse erro ocorrer, feche a caixa de di&aacute;logo Vincular aos dados e abra-a novamente. Se isso falhar, feche e reabra o projeto.</p>
            </blockquote>

            <h3>Comando SQL ViewData</h3>
            <!-- https://netbeans.org/bugzilla/show_bug.cgi?id=86276
            http://bt2ws.central.sun.com/CrPrint?id=6466706--><br> <b><span style="color: rgb(4, 84, 145);">A inser&ccedil;&atilde;o de um nova linha ou espa&ccedil;o tem como resultado um retorno vazio incorreto.</span></b>
            <blockquote>
                <p><strong>Descri&ccedil;&atilde;o: </strong>Uma consulta realizada na janela Exibir dados que termina com um espa&ccedil;o em branco ou com um retorno de carro n&atilde;o &eacute; executada.</p>
                <!--  <p><strong>Workaround: </strong>Make sure commands end with a character rather than space or a carriage returns.</p>-->
            </blockquote>
            <h3> Servi&ccedil;os da Web</h3>
            <!-- http://bt2ws.central.sun.com/CrPrint?id=6484142 --><br> <b><span style="color: rgb(4, 84, 145);">O pacote de servi&ccedil;os da Web n&atilde;o est&aacute; vis&iacute;vel no JDK 1.5_06 em projetos que usam o J2EE 1.4.</span></b>
            <blockquote>
                <p><strong>Descri&ccedil;&atilde;o: </strong> Nos projetos nos quais os servi&ccedil;os da Web foram adicionados, a instru&ccedil;&atilde;o de importa&ccedil;&atilde;o deveria se autocompletar na exibi&ccedil;&atilde;o Java (ou seja, o pacote de servi&ccedil;os da Web deveria estar vis&iacute;vel no aplicativo), mas o IDE retorna &quot;Sem sugest&otilde;es&quot;. </p>
                <p><strong>Solu&ccedil;&atilde;o: </strong>Construa o projeto primeiro e por conseguinte o editor de fontes Java fornecer&aacute; as sugest&otilde;es. </p>
            </blockquote>
            <a name="kidistim"></a><h3>Imagens distorcidas</h3>
            <!-- http://bt2ws.central.sun.com/CrPrint?id=6479271 --><br> <b><span style="color: rgb(4, 84, 145);">As imagens de fundo est&atilde;o embaralhadas ou n&atilde;o h&aacute; imagem de fundo no navegador sobre &quot;postback&quot;.</span></b>
            <blockquote>
                <p><strong>Descri&ccedil;&atilde;o: </strong>Quando um postback ocorrer, as imagens de fundo definidas atrav&eacute;s do estilo de imagem de fundo com uma URL relativa, como <tt>background-image: url(./resources/flower.gif)</tt>, aparecem embaralhadas ou n&atilde;o est&atilde;o no navegador.</p>
                <p><strong>Solu&ccedil;&atilde;o: </strong>As corre&ccedil;&otilde;es a seguir funcionam para projetos Java EE 4 e EE5. Defina manualmente a imagem de fundo usando um c&oacute;digo tal como:
                <pre class="examplecode">&lt;h:panelGrid binding=&quot;#{Page1.gridPanel1}&quot; id=&quot;gridPanel1&quot;
    style=&quot;background-image: url(/WebApplication1/resources/flower.gif);
                height: 200px; left: 312px; top: 240px; position: absolute&quot; width=&quot;312&quot;/&gt;</pre>
                Em alguns navegadores, o Painel de grade no trecho acima pode precisar ter pelo menos um filho para que a imagem de fundo apare&ccedil;a. O filho poderia ser, por exemplo, um componente Static Text com a propriedade <tt>escape</tt> definida como <tt>False</tt> e a propriedade <tt>text</tt> definida como um espa&ccedil;o incondicional (<tt>&nbsp;</tt>): <pre class="examplecode">&lt;h:panelGrid binding=&quot;#{Page1.gridPanel1}&quot; id=&quot;gridPanel1&quot;<br>    style=&quot;background-image: url(/WebApplication1/resources/flower.gif);
    height: 200px; left: 312px; top: 240px; position: absolute&quot; width=&quot;312&quot;&gt;<br>&lt;webuijsf:staticText binding=&quot;#{Page1.staticText1}&quot; escape=&quot;false&quot; id=&quot;staticText1&quot; text=&quot;&nbsp;&quot;/&gt;
                &lt;/h:panelGrid&gt;</pre>
                <p>Observe que, embora essa solu&ccedil;&atilde;o seja eficaz no tempo de execu&ccedil;&atilde;o, ela far&aacute; com que a imagem desapare&ccedil;a no tempo de design.</p>
            </blockquote>
            <h3>Componente Checkbox</h3>
            <!-- http://bt2ws.central.sun.com/CrPrint?id=6455276 --><br> <b><span style="color: rgb(4, 84, 145);">A propriedade readOnly dos componentes Checkbox e Checkbox Group n&atilde;o funciona,</span></b>
            <blockquote>
                <p><strong>Descri&ccedil;&atilde;o: </strong> Esses componentes permanecem clic&aacute;veis mesmo depois de configurar seus atributos como readOnly.</p>
                <p><strong>Solu&ccedil;&atilde;o: </strong>Use o atributo <tt>disabled</tt> para que o componente renderize quando seja aplic&aacute;vel, mas n&atilde;o deva ser alterado. </p>
                <p>Use tamb&eacute;m o script para evitar altera&ccedil;&otilde;es em elementos que sejam readOnly. Aqui, <tt>button1_action</tt> alterna a propriedade <tt>readOnly</tt> de <tt>checkbox1</tt>:
                <pre class="examplecode">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;<br>&lt;jsp:root version=&quot;1.2&quot; xmlns:f=&quot;http://java.sun.com/jsf/core&quot; xmlns:h=&quot;http://java.sun.com/jsf/html&quot;
            xmlns:jsp=&quot;http://java.sun.com/JSP/Page&quot; xmlns:webuijsf=&quot;http://www.sun.com/webui/webuijsf&quot;&gt;<br>    &lt;jsp:directive.page contentType=&quot;text/html;charset=UTF-8&quot; pageEncoding=&quot;UTF-8&quot;/&gt;<br>    &lt;f:view&gt;<br>        &lt;webuijsf:page binding=&quot;#{Page1.page1}&quot; id=&quot;page1&quot;&gt;<br>            &lt;webuijsf:html binding=&quot;#{Page1.html1}&quot; id=&quot;html1&quot;&gt;<br>                &lt;webuijsf:head binding=&quot;#{Page1.head1}&quot; id=&quot;head1&quot;&gt;<br>                    &lt;webuijsf:link binding=&quot;#{Page1.link1}&quot; id=&quot;link1&quot; url=&quot;/resources/stylesheet.css&quot;/&gt;<br>                    &lt;webuijsf:script binding=&quot;#{Page1.script1}&quot; id=&quot;script1&quot;&gt;&lt;![CDATA[<br>                        function preventIfReadOnly(element) {<br>                            if (element.readOnly != false) {<br>                                //o elemento &eacute; readOnly, deste modo evita altera&ccedil;&otilde;es retornando false<br>                                retorna false;<br>                            }<br>                            //permite altera&ccedil;&otilde;es retornando true<br>                            retorna true;<br>                        }<br>                            ]]&gt;&lt;/webuijsf:script&gt;<br>                &lt;/webuijsf:head&gt;<br>                &lt;webuijsf:body binding=&quot;#{Page1.body1}&quot; id=&quot;body1&quot; style=&quot;-rave-layout: grid&quot;&gt;<br>                    &lt;webuijsf:form binding=&quot;#{Page1.form1}&quot; id=&quot;form1&quot;&gt;<br>                        &lt;webuijsf:checkbox binding=&quot;#{Page1.checkbox1}&quot; id=&quot;checkbox1&quot; label=&quot;Checkbox&quot; onClick=&quot;return preventIfReadOnly(this);&quot; style=&quot;position: absolute; left: 192px; top: 192px&quot;/&gt;<br>                        &lt;webuijsf:button actionExpression=&quot;#{Page1.button1_action}&quot; binding=&quot;#{Page1.button1}&quot; id=&quot;button1&quot;<br>                            style=&quot;position: absolute; left: 216px; top: 288px&quot; text=&quot;Toggle checkbox readOnly property&quot;/&gt;<br>                        &lt;webuijsf:messageGroup binding=&quot;#{Page1.messageGroup1}&quot; id=&quot;messageGroup1&quot; style=&quot;position: absolute; left: 432px; top: 120px&quot;/&gt;<br>                    &lt;/webuijsf:form&gt;<br>                &lt;/webuijsf:body&gt;<br>            &lt;/webuijsf:html&gt;<br>        &lt;/webuijsf:page&gt;<br>    &lt;/f:view&gt;<br>&lt;/jsp:root&gt;</pre></blockquote>
            <a name="i18n"></a> <h3>Internacionaliza&ccedil;&atilde;o</h3>
            <!--  http://bt2ws.central.sun.com/CrPrint?id=6498866 --><br> <b><span style="color: rgb(4, 84, 145);">A propriedade URL est&aacute; limitada aos caracteres ISO-8859-1.</span></b>
            <blockquote>
                <p><strong>Descri&ccedil;&atilde;o: </strong>Os componentes de arquivo carregados n&atilde;o s&atilde;o exibidos no local jp. Os nomes de arquivo aparecem corretamente no navegador e no arquivo de log, mas a imagem n&atilde;o &eacute; exibida quando o nome de arquivo encontra-se em conjuntos de caracteres de mbyte. Quando o nome de arquivo original de um arquivo carregado cont&eacute;m caracteres UCS, o atributo <tt>src</tt> da marca <tt>img</tt> n&atilde;o &eacute; renderizado corretamente. Conseq&uuml;entemente, quando o navegador procura a imagem, ele recebe um erro &quot;File Not Found&quot; (arquivo n&atilde;o encontrado) e n&atilde;o aparece nada na janela do navegador. </p>
                <p><strong>Solu&ccedil;&atilde;o: </strong>Fa&ccedil;a com que o aplicativo limite o uso da propriedade <tt>URL</tt> a caracteres ISO-8859-1. Forne&ccedil;a, por exemplo, uma etapa de tradu&ccedil;&atilde;o diferente do conjunto de caracteres ISO 10646 UCS para ISO-8859-1. &Eacute; melhor evitar usar unicamente caracteres UCS. </p>
            </blockquote>
            <h3> Banco de dados incorporado </h3>
            <!-- http://bt2ws.central.sun.com/CrPrint?id=6483217 --><br> <b><span style="color: rgb(4, 84, 145);">N&atilde;o &eacute; poss&iacute;vel conectar ao banco de dados em projetos criados antes da exclus&atilde;o do diret&oacute;rio de usu&aacute;rio e da reinstala&ccedil;&atilde;o do IDE.</span></b>
            <blockquote>
                <p><strong>Descri&ccedil;&atilde;o: </strong>O driver JDBC &eacute; perdido quando o diret&oacute;rio de usu&aacute;rio &eacute; exclu&iacute;do, portanto o usu&aacute;rio n&atilde;o pode resolver as conex&otilde;es de dados ausentes. </p>
                <p><strong>Solu&ccedil;&atilde;o: </strong>Antes de excluir o diret&oacute;rio de usu&aacute;rio, copie a pasta <tt>jdbc-drivers</tt> para um diret&oacute;rio externo e devolva-a ao diret&oacute;rio de usu&aacute;rio antes da reinstala&ccedil;&atilde;o. </p>
            </blockquote>
            <h3>Renomea&ccedil;&atilde;o de vari&aacute;veis</h3>
            <!-- http://bt2ws.central.sun.com/CrPrint?id=5097400 --><br> <b><span style="color: rgb(4, 84, 145);">Quando o usu&aacute;rio renomeia uma propriedade selecionando Padr&otilde;es de Bean &gt; Propriedade &gt; Renomear, o NetBeans IDE n&atilde;o trata a renomea&ccedil;&atilde;o como uma refatora&ccedil;&atilde;o completa. Os novos nomes das vari&aacute;veis renomeadas desta forma n&atilde;o s&atilde;o propagados no projeto.</span></b>
            <blockquote>
                <p><strong>Descri&ccedil;&atilde;o: </strong>O IDE renomeia os m&eacute;todos getter e setter se o usu&aacute;rio responde <tt>Sim</tt> na caixa de di&aacute;logo pop-up que inclui esses m&eacute;todos, no entanto, outras refer&ecirc;ncias a esses m&eacute;todos n&atilde;o s&atilde;o atualizadas. Quando um aplicativo &eacute; implantado e somente o nome de uma vari&aacute;vel, por exemplo o nome da vari&aacute;vel de uma propriedade de Bean, &eacute; alterado, o IDE lan&ccedil;a um erro de compila&ccedil;&atilde;o.</p>
            </blockquote>
            <h3>Drivers JDBC</h3>
            <!-- http://bt2ws.central.sun.com/CrPrint?id=6476830 (replaces 6476831, 6476832, 6476855)
            https://netbeans.org/bugzilla/show_bug.cgi?id=86213 --> <br> <b><span style="color: rgb(4, 84, 145);">Os aplicativos que usam as fontes de dados falham se o driver JDBC n&atilde;o est&aacute; copiado no servidor.</span></b>
            <blockquote>
                <p><strong>Descri&ccedil;&atilde;o: </strong>O NetBeans n&atilde;o copia os arquivos JAR do driver JDBC no recipiente de implanta&ccedil;&atilde;o. </p>
                <p><strong>Solu&ccedil;&atilde;o: </strong>Copie os arquivos JAR manualmente no caminho de classe do recipiente. </p>
            </blockquote>
            <h3>Componentes Woodstock</h3>
            <!-- http://bt2ws.central.sun.com/CrPrint?id=6490614 --><br> <b><span style="color: rgb(4, 84, 145);">Os projetos criados na Visualiza&ccedil;&atilde;o da tecnologia Visual Web Pack n&atilde;o constroem na vers&atilde;o de produ&ccedil;&atilde;o.</span></b>
            <blockquote>
                <p><strong>Descri&ccedil;&atilde;o: </strong>O IDE falha ao copiar todo o conte&uacute;do da biblioteca de componentes WebUI no tempo de constru&ccedil;&atilde;o, resultando em falha na constru&ccedil;&atilde;o </p>
                <p><strong>Solu&ccedil;&atilde;o: </strong>Remova a biblioteca de componentes WebUI antiga e adicione uma nova biblioteca de componentes WebUI da seguinte forma:
                    <ol><li>Na janela Projetos, clique com o bot&atilde;o direito do mouse no projeto e selecione Propriedades.</li>
                        <li>Selecione Bibliotecas, selecione o pacote da biblioteca de componentes de UI da Web e clique em Remover. Clique em OK para fechar a caixa de di&aacute;logo.</li>
                        <li>Clique com o bot&atilde;o direito do mouse no projeto e selecione Propriedades.</li>
                        <li>Selecione Bibliotecas e clique em Adicionar biblioteca. Na caixa de di&aacute;logo Adicionar bibliotecas, selecione Componentes de UI da Web e clique em Adicionar biblioteca. Na janela Propriedades do projeto, clique em OK.</li>
                        <li>Clique com o bot&atilde;o direito do mouse em Projeto e selecione Limpar e construir projeto.</li>
                    </ol>
                </p>
            </blockquote>
            <!--
 <h3>Subject</h3>
  http://bt2ws.central.sun.com/CrPrint?id=___ <br>
<b><span style="color: rgb(4, 84, 145);">summary.</span></b>
<blockquote>
  <p><strong>Description: </strong>xyz </p>
  <p><strong>Workaround: </strong>BCD. </p>
</blockquote>
--> <a name="buttonwidth"></a> <h3>Largura do bot&atilde;o no Internet Explorer</h3>
            <!--http://bt2ws.central.sun.com/CrPrint?id=6498140--> <br> <b><span style="color: rgb(4, 84, 145);">Somente no IE 7: A largura padr&atilde;o do bot&atilde;o n&atilde;o &eacute; respeitada.</span></b>
            <blockquote>
                <p><strong>Descri&ccedil;&atilde;o: </strong>Quando a largura do bot&atilde;o n&atilde;o est&aacute; explicitamente definida, o IE 7 redimensiona o bot&atilde;o de acordo com a largura do recipiente. </p>
                <p><strong>Solu&ccedil;&atilde;o: </strong>Defina explicitamente as larguras dos bot&otilde;es no Visual Designer. </p>
            </blockquote>
            <h3><a name="kisession"></a>Perdas de dados de sess&atilde;o no Internet Explorer</h3>
            <!-- http://bt2ws.central.sun.com/CrPrint?id=6482174  --><br> <b><span style="color: rgb(4, 84, 145);">Somente no IE 6 e no IE 7: Perda de sess&atilde;o ap&oacute;s navegar 20 p&aacute;ginas.</span></b>
            <blockquote>
                <p><strong>Descri&ccedil;&atilde;o: </strong>Em projetos com mais de 20 p&aacute;ginas, os dados de sess&atilde;o se perdem e as informa&ccedil;&otilde;es salvas em um atributo de Bean de sess&atilde;o s&atilde;o redefinidas como Nulo quando o usu&aacute;rio tiver navegado mais de 20 p&aacute;ginas. No Firefox ou em outros navegadores, isto n&atilde;o &eacute; um problema. </p>
                <p>Se a seguran&ccedil;a do navegador estiver definida como <tt>M&eacute;dia</tt>, a sess&atilde;o &eacute; renovada mais ou menos na p&aacute;gina 22; se estiver definida como <tt>Alta</tt>, a sess&atilde;o continua at&eacute; a p&aacute;gina 30. A sess&atilde;o &eacute; mantida quando os cookies s&atilde;o desativados.</p>
                <p><strong>Solu&ccedil;&atilde;o: </strong>No Internet Explorer:  </p>
                <ol>
                    <li>Selecione Ferramentas &gt; Op&ccedil;&otilde;es de Internet.</li>
                    <li>Selecione a guia Privacidade.</li>
                    <li>Altere as configura&ccedil;&otilde;es de <tt>M&eacute;dio</tt> (padr&atilde;o) para <tt>Alto</tt> ou <tt>Bloquear todos os cookies</tt>.</li>
                    <li>Clique em OK.</li>
                    <li>Reinicie todas as inst&acirc;ncias do Internet Explorer.</li>
                </ol>
            </blockquote>
            <!--
 <h3>Subject</h3>
  http://bt2ws.central.sun.com/CrPrint?id=___ <br>
<b><span style="color: rgb(4, 84, 145);">summary.</span></b>
<blockquote>
  <p><strong>Description: </strong>xyz </p>
  <p><strong>Workaround: </strong>BCD. </p>
</blockquote>
            --><a name="render"></a>
            <h3>Problemas de renderiza&ccedil;&atilde;o</h3>
            <br> <b><span style="color: rgb(4, 84, 145);">O texto do IDE &eacute; ileg&iacute;vel no Red Hat Fedora Core 3 que usa o local zh_CN.</span></b>
            <blockquote>
                <p><strong>Descri&ccedil;&atilde;o: </strong> Quando o IDE &eacute; executado no Red Hat Fedora Core 3 no local zh_CN e possivelmente em outros locais asi&aacute;ticos, o texto pode n&atilde;o ser leg&iacute;vel devido a problemas de renderiza&ccedil;&atilde;o. Esse problema se deve &agrave; quest&atilde;o de suporte de fontes do JDK na distribui&ccedil;&atilde;o do Fedora Core, de modo que tal problema tamb&eacute;m pode ocorrer em outros aplicativos Java executados no Fedora Core.  </p>
                <p><strong>Solu&ccedil;&atilde;o: </strong>N&atilde;o existe solu&ccedil;&atilde;o segura para o problema de renderiza&ccedil;&atilde;o no Red Hat Fedora Core 3, de forma que o melhor &eacute; usar outro sistema operacional ou distribui&ccedil;&atilde;o do Linux nesses locais. Verificamos que este problema n&atilde;o ocorre no Red Hat Enterprise Linux 3. </p>
            </blockquote>
        </blockquote>
        <blockquote>
            <h3>Java Server Pages</h3>
            <!-- https://netbeans.org/bugzilla/show_bug.cgi?id=88510 --><br> <b><span style="color: rgb(4, 84, 145);">Com os m&oacute;dulos do Visual Web ativados, o Java Server Pages est&aacute; oculto em projetos de forma livre.</span></b>
            <blockquote>
                <p><strong>Descri&ccedil;&atilde;o: </strong>Se o download e a instala&ccedil;&atilde;o da Visualiza&ccedil;&atilde;o da tecnologia NetBeans Visual Web Pack 5.5 foram feitos entre os dias 29 de outubro e 3 de novembro de 2006, &eacute; poss&iacute;vel que a ativa&ccedil;&atilde;o dos m&oacute;dulos do Visual Web oculte o Java Server Pages em projetos de forma livre. Isto est&aacute; documentado no <a href="https://netbeans.org/bugzilla/show_bug.cgi?id=88510" target=_blank>problema 88510 do NetBeans</a>. Esse problema foi corrigido nos downloads dispon&iacute;veis ap&oacute;s o dia 4 de novembro de 2006.
                <p><strong>Solu&ccedil;&atilde;o 1: </strong>Fa&ccedil;a o download da corre&ccedil;&atilde;o na Central de atualiza&ccedil;&otilde;es do Visual Web Pack da seguinte forma: </p>
                <ol><li>
                        <p>No menu principal do IDE, escolha Ferramentas &gt; Central de atualiza&ccedil;&otilde;es.</p>
                    O assistente da Central de atualiza&ccedil;&otilde;es se abre. Se estiver trabalhando com um firewall, voc&ecirc; deve configurar o servidor proxy.  Clique Configura&ccedil;&atilde;o de proxy e insira as informa&ccedil;&otilde;es do proxy na caixa de di&aacute;logo.</li>
                    <li>Certifique-se de ter selecionado a Central de atualiza&ccedil;&otilde;es do Visual Web Pack NetBeans.</li>
                    <li>Clique em Pr&oacute;ximo no assistente da Central de atualiza&ccedil;&otilde;es. O assistente verifica as atualiza&ccedil;&otilde;es e os novos m&oacute;dulos dispon&iacute;veis e abre o painel Selecionar m&oacute;dulos a instalar se houver atualiza&ccedil;&otilde;es e novos m&oacute;dulos dispon&iacute;veis.</li>
                    <li>No painel esquerdo, selecione <tt>Complib (vers&atilde;o 1.1)</tt> e <tt>JSF Project Core (vers&atilde;o 1.2.0.2)</tt> e clique no bot&atilde;o Adicionar para pass&aacute;-los para o painel Incluir na instala&ccedil;&atilde;o.</li>
                    <li>  <p>Clique em Pr&oacute;ximo e leia e aceite o contrato de licen&ccedil;a.</p>
                    O assistente da Central de atualiza&ccedil;&otilde;es faz o download da corre&ccedil;&atilde;o.</li>
                    <li>Clique em Pr&oacute;ximo para instalar o m&oacute;dulo no IDE, clique em Finalizar e, em seguida, em OK para reiniciar o IDE.</li>
                </ol>
                <p><b>Solu&ccedil;&atilde;o 2: </b>Desative os m&oacute;dulos do NetBeans Visual Web Pack 5.5 da seguinte forma:</p>
                <ol><li>No menu principal do IDE, escolha Ferramentas &gt; Gerenciador de m&oacute;dulos.</li>
                    <li>No Gerenciador de m&oacute;dulos, desmarque a caixa na coluna Ativo associada ao <tt>Visual Web</tt>.</li>
                    <li>Depois que o IDE fizer a atualiza&ccedil;&atilde;o dos m&oacute;dulos, clique em Fechar. </li>
                </ol><p>Esses m&oacute;dulos podem ser reativados em qualquer momento realizando as mesmas etapas.</p>
            </blockquote>
        
        </blockquote>
        <p align=center><a href="#top">superior</a></p>
        <!-- DOCUMENTATION --> <a name="documentation"></a>
        <h2>Documenta&ccedil;&atilde;o</h2>
        <blockquote>
            <p>A documenta&ccedil;&atilde;o do NetBeans Visual Web Pack 5.5 encontra-se na forma de guias com base na Web e no sistema de ajuda do IDE. Voc&ecirc; pode usar os documentos seguintes como introdu&ccedil;&atilde;o:</p>
            <ul>
                <li><a href="vwp-install_pt_BR.html">Instru&ccedil;&otilde;es de instala&ccedil;&atilde;o do NetBeans Visual Web Pack 5.5</a></li>
                <li><a href="https://netbeans.org/kb/55/index_pt_BR.html">Documenta&ccedil;&atilde;o do NetBeans IDE 5.5</a></li>
            </ul>
        </blockquote>
        <p align="center"><a href="#top">superior</a></p>
        <a name="more_information"></a><h2>Mais informa&ccedil;&otilde;es</h2>
        <blockquote>
            <p>Voc&ecirc; tamb&eacute;m pode encontrar informa&ccedil;&otilde;es &uacute;teis no site do <a href="https://netbeans.org/index_pt_BR.html" target="_blank">projeto NetBeans</a>. Visto que o NetBeans IDE &eacute; um projeto de c&oacute;digo aberto, o site da Web tamb&eacute;m oferece acesso ao c&oacute;digo-fonte, a um banco de dados de problemas, a informa&ccedil;&otilde;es sobre a cria&ccedil;&atilde;o de m&oacute;dulos do NetBeans e muito mais. </p>
            <p>Para mais informa&ccedil;&otilde;es, visite <a href="https://netbeans.org/index_pt_BR.html" target="_blank">https://netbeans.org/</a>. </p>
            <p>O FAQ do NetBeans Visual Web Pack est&aacute; em <a href="http://wiki.netbeans.org/wiki/view/NetBeansVWPUserFAQ">http://wiki.netbeans.org</a>. </p>
        </blockquote>
        <p align=center><a href="#top">superior</a></p>
        <hr class="light">
        <br>
        <div class="feedback-box">
            <a href="/about/contact_form.html?to=4&subject=Feedback: NetBeans Visual Web Pack 5.5 Release Notes">Envie-nos seus coment&aacute;rios</a></div>
        <br style="clear:both;" />
    </body>
</html>
