<html>
    <head>
        <title>Programa&ccedil;&atilde;o de Rich Client: Colocando-o na Plataforma NetBeans</title>
    </head>
    <body>
        <h2>Programa&ccedil;&atilde;o de Rich Client: Colocando-o na Plataforma NetBeans</h2>
        <p>A p&aacute;gina oficial do melhor e mais recente livro sobre a Plataforma NetBeans a ser lan&ccedil;ado em Maior de 2007!</p>
        
        <p><h3>10 de setembro de 2007: Javalobby Publica a Cr&iacute;tica do Livro</h3>
        &quot;Este livro &eacute; admir&aacute;vel em termos de sua clareza e abrang&ecirc;ncia&quot;. Para ler toda a cr&iacute;tica, <a href="http://www.javalobby.org/articles/rich-client-programming/">clique aqui</a>.
        
        <p><h3>17 de junho de 2007: Errata Publicada</h3> 
        N&oacute;s come&ccedil;amos, com base no feedback de usu&aacute;rios, a coletar a 'errata' do livro em um local central. Clique abaixo para ir para a p&aacute;gina de errata para o livro:
        
        <p><a href="http://wiki.netbeans.org/wiki/view/NetBeansDeveloperFAQRCPBookErrata">Errata para &quot;Programa&ccedil;&atilde;o de Rich Client: Colocando-o na Plataforma NetBeans&quot;</a>
        
        <p>Caso tenha encontrado c&oacute;digo ou texto que acredita n&atilde;o estar inteiramente correto, escreva para dev@openide.netbeans.org com seus coment&aacute;rios. Suas quest&otilde;es ser&atilde;o discutidas naquela lista, e caso se verifique que seus coment&aacute;rios s&atilde;o genu&iacute;nos para &quot;uma errata v&aacute;lida&quot;, elas ser&atilde;o inclu&iacute;das na p&aacute;gina de errata.
        
        <p><h3>7 de maio de 2007: Foto exclusiva dos autores!</h3> 
        Um fotografia tirada por Jim Grisanzio, no NetBeans Day em S&atilde;o Francisco:
      
        <p><p><img border="1" align="center" src="authors.png"></a>
        
        <p>Esquerda para a direita: Geertjan Wielenga, Jaroslav Tulach, Tim Boudreau
        
        <p><h3>5 de maio de 2007: O livro &eacute; real.</h3> 

        <p>Hoje, o livro foi entregue em Praga, local base do NetBeans. Caso venha para o NetBeans Day na segunda-feira, 7 de maio, receber&aacute; sua pr&oacute;pria c&oacute;pia, como aqui mostrado:
        
        <p><p><img border="1" align="center" src="thebook2.JPG"></a>
        
        
        
        
        <p><h3>3 de maio de 2007: Amostras do livro agora no centro de Atualiza&ccedil;&atilde;o 5.5!</h3> 
        O Centro de Atualiza&ccedil;&atilde;o do NetBeans IDE 5.5 agora fornece as amostras (al&eacute;m do Centro de Atualiza&ccedil;&atilde;o para o desenvolvimento do 6.0, conforme anteriormente anunciado):
        
        <p><p><img border="1" align="center" src="update-center.png"></a>
        
        
        <p><h3>25 de abril de 2007: Amostras do livro dispon&iacute;veis livremente no Centro de Atualiza&ccedil;&atilde;o!</h3> 
        O Centro de Atualiza&ccedil;&atilde;o do desenvolvimento do NetBeans IDE 6.0 agora fornece amostras. Para obter mais informa&ccedil;&otilde;es, clique <a href="http://blogs.sun.com/geertjan/entry/freely_available_samples_for_rich">aqui</a>.
        
        <p><h3>27 de fevereiro de 2007: Primeiros rascunhos dispon&iacute;veis!</h3> 
        Os primeiros rascunhos est&atilde;o dispon&iacute;veis, clique aqui para ir ao site e comprar sua pr&oacute;pria c&oacute;pia:
        
        <p><p><a href="http://safari.awprofessional.com/9780132354806"><img border="1" align="center" src="purchase-rough-cut.png"></a>
        
        <p><h3>26 de fevereiro de 2007: Capa.</h3> 
        Em breve a vers&atilde;o do primeiro rascunho do livro estar&aacute; dispon&iacute;vel <a href="http://vig.prenhall.com/catalog/academic/product/0,1144,0132344475,00.html">aqui</a>. Essa &eacute; a apar&ecirc;ncia da capa do livro:
        
        <p><p><img border="1" align="center" src="rough-cut-cover.png">
        
        
        <p><h3>16 de fevereiro 2007: Pre-lan&ccedil;amento inicial.</h3> 
        N&oacute;s estamos pr&eacute;-lan&ccedil;ando um rascunho do primeiros cap&iacute;tulos do livro, que define o tom para o resto dos mesmos: <a href="http://usersguide.netbeans.org/files/documents/40/1315/rcp-book-ch2.pdf">Cap&iacute;tulo 2: Os benef&iacute;cios da programa&ccedil;&atilde;o modular</a>
        
        <p><h3>27 de janeiro de 2007: &Iacute;ndice planejado.</h3>
        O &iacute;ndice planejado para o livro Programa&ccedil;&atilde;o Rich Client, &eacute; o seguinte:
        <ol>
            <li>Primeiros passos com a Plataforma NetBeans 
            <li>Os benef&iacute;cios da programa&ccedil;&atilde;o modular 
            <li>Arquitetura modular
            <li>Comunica&ccedil;&atilde;o acoplada livremente
            <li>Pesquisa
            <li>Sistemas de arquivos
            <li>Threading, Padr&otilde;es de Listener e pesquisa MIME
            <li>O sistema de janelas
            <li>Interfaces gr&aacute;ficas do usu&aacute;rio
            <li>N&oacute;s, Vistas do Explorer, A&ccedil;&otilde;es e Apresentadores
            <li>Editores de m&uacute;ltiplas vistas
            <li>Realce de sintaxe
            <li>Auto-completar o c&oacute;digo
            <li>Paletas de componente
            <li>Hiperlinks
            <li>Anota&ccedil;&otilde;es
            <li>Janelas de op&ccedil;&otilde;es
            <li>Estruturas da Web
            <li>Servi&ccedil;os Web
            <li>Documenta&ccedil;&atilde;o JavaHelp
            <li>Centro de Atualiza&ccedil;&atilde;o
            <li>Ap&ecirc;ndices
            <br>- Ap&ecirc;ndice A: T&eacute;cnicas avan&ccedil;adas do sistema de m&oacute;dulos
            <br>- Ap&ecirc;ndice B: Idiomas comuns e padr&otilde;es de c&oacute;digo no NetBeans
            <br>- Ap&ecirc;ndice C: Desempenho
        </ol>
        <hr>
    </body>
</html>