<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
 <head>
<title>NetBeans Kodet burimore</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" >
<meta name="description" content="Info about the NetBeans sources - how to get them, what is here ...">
<link rel="stylesheet" type="text/css" href="../../netbeans.css">
<meta http-equiv="content-language" content="en">
<meta name="keywords" content="java IDE, java editor, java Platform, free, open source, java development, j2ee support, development enviroment, web development, NetBeans, IDE, java" >
</head>
        <body>
<h1>Kodet burimore</h1>
<br>
Kodi burimor i NetBeans-it &euml;sht&euml; i gatsh&euml;m n&euml;n 
<a href="../../about/legal/license.html">Licenca e Zhvillimit t&euml; p&euml;rbashk&euml;t dhe t&euml; shp&euml;rndarjes</a> (CDDL).
<p>Kodi burimor &euml;sht&euml; i gatsh&euml;m n&euml; nj&euml; vendruajtje Mercurial. T&euml; gjitha zhvillimet e NetBeans ndodhun duke p&euml;rdorur Mercurial serverin n&euml; k&euml;t&euml; vend, dhe propozimet p&euml;r zhvillim dhe vendimet ndodhin n&euml; 
<a href="../lists/index.html">listat publike t&euml; postimeve</a>.
</p>
<p>Ju mund arrini te kodi burimor n&euml; disa m&euml;nyra.
</p>
<ul>
  <li>P&euml;rmes Mercurial - shiko <a href="hg.html">Mercurial faqen</a> p&euml;r detajet
;</li>
  <li>Shkarko nj&euml; fotografi t&euml; arkivuar nga <a
 href="../../downloads/index.html">faqja e shkarkimit</a>;</li>
  <li><a href="http://hg.netbeans.org/main/file/">Shfleto ato n&euml; linj&euml;</a></li>
</ul>N&euml;se ju jeni t&euml; interesuar t&euml; b&euml;ni nj&euml; nd&euml;rtim nga kodi, shiko 
<a href="http://wiki.netbeans.org/WorkingWithNetBeansSources">faqe e nd&euml;rtimit/instalimit</a>.
</p>
<h2>&Ccedil;far&euml; ka k&euml;t&euml; me t&euml; v&euml;rtet&euml;?</h2>
<br>
&Ccedil;ka &euml;sht&euml; e gatshme k&euml;&euml; &euml;sht&euml; i t&euml;r&euml; trungu i kodi dhe historia e NetBeans IDE-s
, &euml;sht&euml; nj&euml; deg&euml; "stabile" dhe nj&euml; "deg&euml; e zhvillimit". Dega e zhvillimit &euml;sht&euml; ndodhin
zhvillimet n&euml; vazhdim - do t&euml; mund t&euml; jet&euml; m&euml; tep&euml;r ose m&euml; pak stabile 
var&euml;sisht se n&euml; cilin pik&euml; t&euml; ciklit t&euml; plasimit &euml;sht&euml;.

<p>P&euml;r nj&euml; p&euml;rshkrim i organizimit fizik t&euml; kodin n&euml; vendruajtjen Mercurial, shiko <a href="structure.html">Mercurial
Deg&euml;t dhe Etiketat</a> doc.
</p>
<h2><a name="extbins">A &euml;sht&euml; k&euml;tu kodi i t&euml;r&euml;? A ka ndonj&euml; gj&euml; q&euml; nuk &euml;sht&euml; k&euml;tu?</a></h2>
<br>
Jan&euml; disa pjes&euml; q&euml; nuk gjenden k&euml;tu p&euml;r shkaqe legale. 
Jan&euml; disa pjes&euml; t&euml; NetBeans IDE-s q&euml; jan&euml; softuer&euml; t&euml; pal&euml;ve t&euml; treta, 
ose jan&euml; n&euml;n nd&euml;rj&euml; licenc&euml; q&euml; nuk e lejon q&euml; kodi i tyre t&euml; b&euml;het 
publik.
<p>Shembuj t&euml; k&euml;tyre termave n&euml; k&euml;t&euml; q&euml;shtje:
</p>
<ul>
  <li><b>Java Kompiluesi</b> - Parseri i Java-s n&euml; NetBeans &euml;sht&euml; nj&euml; mb&euml;shtjell&euml;s p&euml;rreth
  kompiluesi t&euml; gjuh&euml;s Java (javac). Kodet burimore t&euml; javac jan&euml; n&euml; licenc&euml;n GPL v2 nga
<a href="http://openjdk.dev.java.net/">OpenJDK sajti</a>.
NB 5.x dhe versionet m&euml; t&euml; hershme p&euml;rdorin javac kompiluesi q&euml; &euml;sht&euml; n&euml; licenc&euml; m&euml;
restriktive Sun BCL license.<br>
  </li>
  <li><b>XML Parser&euml;t</b> (Xerces, Crimson, Xalan, DOM, SAX, JAXP, ...)
- q&euml; p&euml;rdoren n&euml; IDE p&euml;r parsimin dhe manipulimin e XML 
. <a href="http://java.sun.com/xml/">http://java.sun.com/xml/</a>
  </li>
  <li><b>JavaHelp Runtime library 2.x</b> - IDE e p&euml;rdor JavaHelp p&euml;r t&euml; paraqitur 
  dokumentimin n&euml; linj&euml;. Binariet shtes&euml; t&euml; shp&euml;rndarjes mund t&euml; p&euml;rfshijn&euml; edhe 
  bibliotek&euml;n e koh&euml;s-s&euml;-nd&euml;rtimit p&euml;r t&euml; rind&euml;rtuar baz&euml;n e t&euml; dh&euml;nave t&euml; k&euml;rkimit. <a
 href="http://java.sun.com/products/javahelp/index.html">http://java.sun.com/products/javahelp/index.html</a>
  </li>
  <li><b>Apache Ant 1.6.x</b> - nj&euml; mjet nd&euml;rimi i bazuar n&euml; Java q&euml; bazohet sistemi i nd&euml;rtimit t&euml; NetBeans-it 
build system depends on. <a href="http://ant.apache.org/">http://ant.apache.org/</a>
  </li>
  <li><b>JUnit 3.8.x</b> - nj&euml; korniz&euml; testimi q&euml; p&euml;rdoret t&euml; t&euml; ekzekutuar nj&euml;sit&euml; e testeve n&euml; NetBeans. <a href="http://www.junit.org/index.html">http://www.junit.org/index.html</a></li>
  <li><span style="font-weight: bold;">Tomcat 5.x.x</span> - nj&euml; p&euml;rmbajt&euml;s i nd&euml;rfutur p&euml;r zhvillimin e i servlet&euml;ve dhe t&euml; JSP-ve. <a
 href="http://jakarta.apache.org/tomcat/index.html">http://jakarta.apache.org/tomcat/index.html</a></li>
  <li><span style="font-weight: bold;">JSP Standard Tag Library (JSTL)</span>
- <a href="http://java.sun.com/products/jsp/jstl/">http://java.sun.com/products/jsp/jstl/</a></li>
</ul>
<p>Nj&euml; plasim i dh&euml;n&euml; i NetBeans-it mund t&euml; ket&euml; m&euml; tep&euml;r ose m&euml; pak ekstra skedar j&euml;-CDDL-t&euml; licencuara n&euml; t&euml;. Pyet n&euml; <a href="../lists/top.html">list&euml;n  nbdev</a> p&euml;r t&euml; qen&euml; m&euml; t&euml; sigurt&euml;.
</p>
<h2>Kontributi</h2>
<br>
Shiko <a href="../contribute/index.html">faqen t&euml; marrurit pjes&euml;</a>.
</body>
</html>
