<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<META HTTP-EQUIV="content-type" CONTENT="text/html; charset=UTF-8">

  <title>NetBeans-Quellcode</title>
  <meta name="description" content="Informationen zum Quellcode von NetBeans (wo man ihn erh&auml;lt, was man auf dieser Seite findet usw.)">
  <link rel="stylesheet" type="text/css" href="../../netbeans.css">
  <meta http-equiv="content-language" content="de">
</head>
<body>
<h1>Quellcode</h1>
<br> Der Quellcode von NetBeans wird unter der <a href="../../about/legal/license.html">Common Development and Distribution License</a> (CDDL) bereitgestellt
<p>und steht in einem Mercurial-Repository zur Verf&uuml;gung. Die Entwicklung von NetBeans l&auml;uft vollst&auml;ndig &uuml;ber den Mercurial-Server dieser Seite ab. F&uuml;r Entwicklungsvorschl&auml;ge und -entscheidungen gibt es die <a href="../lists/index_de.html">&ouml;ffentlichen Mailinglisten</a>.
</p>
<p>Es gibt mehrere M&ouml;glichkeiten f&uuml;r den Bezug des Quellcodes.
</p>
<ul>
  <li>Mercurial: Informationen hierzu finden Sie auf der <a href="hg.html">Mercurial-Seite</a>.</li>
  <li>Herunterladen eines archivierten Snapshot von der <a
 href="../../downloads/index.html">Downloadseite</a>: </li>
  <li><a href="http://www.netbeans.orghttp://hg.netbeans.org/main/file/">Durchsuchen Sie den Quellcode online</a></li>
</ul>
<p>Wenn Sie mithilfe des Quellcodes einen Build erstellen m&ouml;chten, finden Sie <a href="http://wiki.netbeans.org/WorkingWithNetBeansSources">hier</a> weitere Informationen zur Erstellung von Builds und zur Installation. 
<h2>Hier verf&uuml;gbare Informationen und Dateien</h2>
<br> Auf dieser Seite finden Sie die vollst&auml;ndige Quellstruktur und alle bisherigen Versionen der NetBeans IDE. Es gibt einen &bdquo;stabilen&ldquo; (stable) und einen Entwicklungszweig (development). Im Entwicklungszweig wird die Entwicklung vorangetrieben. Dieser Code ist je nach der aktuellen Phase des Release-Zyklus mehr oder weniger stabil.
<p>Eine Beschreibung des Aufbaus des Quellcodes im Mercurial-Repository finden Sie in <a href="structure.html">diesem Dokument</a> zu Mercurial-Zweigen und -Bezeichnungen.
</p>
<h2><a name="extbins">Liegt hier der vollst&auml;ndige Quellcode vor oder fehlen Teile davon?</a></h2>
<br> Aus rechtlichen Gr&uuml;nden k&ouml;nnen einige Komponenten nicht hier bereitgestellt werden. Dies sind beispielsweise Teile der NetBeans IDE, die von Drittanbietern stammen oder unter einer Lizenz verbreitet werden, die keine Ver&ouml;ffentlichung ihres Quellcodes zul&auml;sst.
<p>Beispiele:
</p>
<ul>
  <li><b>Java-Compiler</b>: Die Java-Komponente in NetBeans ist ein Wrapper um den Java-Compiler (javac). Der javac-Quellcode steht auf der <a href="http://openjdk.dev.java.net/">OpenJDK-Website</a> unter der GPL-Lizenz (Version 2) zur Verf&uuml;gung. NB 5.x und fr&uuml;her verwenden eine &auml;ltere Version von javac, die unter einer strengeren Lizenz (Sun BCL) bereitgestellt wurde.<br>
  </li>
  <li><b>XML-Parser</b> (Xerces, Crimson, Xalan, DOM, SAX, JAXP usw.): werden in der gesamten IDE f&uuml;r das Parsen und Manipulieren von XML eingesetzt (<a href="http://java.sun.com/xml/">http://java.sun.com/xml/</a>).
  </li>
  <li><b>JavaHelp-Laufzeitbibliothek 2.x</b>: Die IDE verwendet JavaHelp zur Anzeige der Online-Dokumentation. Die zus&auml;tzliche Bin&auml;rdistribution kann auch die JavaHelp-Entwicklungsbibliothek zum Neuaufbau von Suchdatenbanken enthalten (<a
 href="http://java.sun.com/products/javahelp/index.html">http://java.sun.com/products/javahelp/index.html</a>).
  </li>
  <li><b>Apache Ant 1.6.x</b>: Java-basiertes Build-Tool, das f&uuml;r das Build-System von NetBeans erforderlich ist (<a href="http://ant.apache.org/">http://ant.apache.org/</a>)
  </li>
  <li><b>JUnit 3.8.x</b>: Test-Framework f&uuml;r Einheitentests in NetBeans (<a href="http://www.junit.org/index.html">http://www.junit.org/index.html</a>)</li>
  <li><span style="font-weight: bold;">Tomcat 5.x.x</span>: eingebetteter Servlet-Container f&uuml;r die Java-Servlet- und JSP-Entwicklung (<a
 href="http://jakarta.apache.org/tomcat/index.html">http://jakarta.apache.org/tomcat/index.html</a>)</li>
  <li><span style="font-weight: bold;">JSP Standard Tag Library (JSTL)</span>: <a href="http://java.sun.com/products/jsp/jstl/">http://java.sun.com/products/jsp/jstl/</a></li>
</ul>
<p>Bei jedem Release von NetBeans kann sich die Zahl der darin enthaltenen Zusatzdateien, die unter der CDDL-Lizenz bereitgestellt werden, erh&ouml;hen oder verringern. Informieren Sie sich im Zweifelsfall auf der <a href="../lists/top.html">nbdev-Liste</a>.
</p>
<h2>Teilnahme</h2>
<br> Klicken Sie <a href="../contribute/index_de.html">hier</a>, um zu erfahren, wie Sie sich in dieses Projekt einbringen k&ouml;nnen.
</body>
</html>
