<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
    <head>
        <link rel="stylesheet" type="text/css" href="https://netbeans.org/netbeans.css">
        <title>C&oacute;digos do NetBeans</title>
        <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" >
        <meta name="description" content="Info about the NetBeans sources - how to get them, what is here ...">
        <meta name="keywords" content="java IDE, java editor, java Platform, free, open source, java development, j2ee support, development enviroment, web development, NetBeans, IDE, java" >
    </head>
    
    <body>
        <h1>Os c&oacute;digos</h1>
        <br>
        O c&oacute;digo do NetBeans est&aacute; dispon&iacute;vel atrav&eacute;s da
        <a href="../../about/legal/license.html">Common Development and Distribution License</a>
        (CDDL).
        <p>
            O c&oacute;digo est&aacute; dispon&iacute;vel em um reposit&oacute;rio Mercurial. Todo o 
            desenvolvimento do NetBeans acontece usando o servidor Mercurial desse 
            site, as propostas e discuss&otilde;es de desenvolvimento acontecem nas
            <a href="../lists/index_pt_BR.html">listas de e-mail p&uacute;blicas</a>.
        </p>
        <p>
            Voc&ecirc; pode obter o c&oacute;digo de v&aacute;rias maneiras.
        </p>
        <ul>
            <li>
                Atrav&eacute;s do Mercurial - veja a 
                <a href="hg.html">p&aacute;gina do Mercurial</a> 
                para maiores informa&ccedil;&otilde;es;
            </li>
            
            <li>
                Baixando um arquivo de snapshot a partir da
                <a href="../../downloads/index.html?pagelang=pt_BR">p&aacute;gina de downloads</a>;
            </li>
            
            <li>
                <a href="http://hg.netbeans.org/main/file/">Navegue online pelo c&oacute;digo</a>.
            </li>
        </ul>
        <p>
            Se voc&ecirc; estiver interessado em construir uma distribui&ccedil;&atilde;o a partir 
            do c&oacute;digo, veja as <a href="http://wiki.netbeans.org/WorkingWithNetBeansSources">p&aacute;ginas de constru&ccedil;&atilde;o/instala&ccedil;&atilde;o</a>.
        </p>
        <h2>Ent&atilde;o, o que exatamente existe aqui?</h2>
        <br>
        O que est&aacute; dispon&iacute;vel aqui &eacute; a &aacute;rvore de c&oacute;digo completa e o hist&oacute;rico 
        da IDE NetBeans. Geralmente, h&aacute; um ramo "est&aacute;vel" e um ramo "em 
        desenvolvimento". O ramo em desenvolvimento, tal como o nome indica, &eacute; 
        onde acontece o processo cont&iacute;nuo de desenvolvimento - ele ser&aacute; mais ou 
        menos est&aacute;vel dependendo do ponto em que se encontra ciclo de lan&ccedil;amento 
        de novas vers&otilde;es.
        <p>
            Para obter uma descri&ccedil;&atilde;o f&iacute;sica da organiza&ccedil;&atilde;o dos c&oacute;digos no 
            reposit&oacute;rio Mercurial, veja o documento sobre <a href="structure.html">as estruturas Mercurial</a>.
        </p>
        
        <h2>
            <a name="extbins">O c&oacute;digo que se encontra aqui &eacute; completo? H&aacute; 
            alguma coisa que n&atilde;o esteja aqui?</a>
        </h2>
        <br>
        Existem alguns c&oacute;digos que n&atilde;o podem ser disponibilizados aqui por 
        raz&otilde;es de ordem legal. Existem algumas partes da IDE NetBeans que s&atilde;o 
        software propriet&aacute;rio de terceiros, ou ent&atilde;o est&atilde;o sobre uma licen&ccedil;a que 
        n&atilde;o permite que seus c&oacute;digos sejam disponibilizados publicamente aqui.
        <p>
            Exemplos de itens em quest&atilde;o:
        </p>
        <ul>
            <li>
                <b>Compilador Java</b> - O analisador Java do NetBeans &eacute; uma 
                implementa&ccedil;&atilde;o sobre o compilador da linguagem Java (javac). Os 
                c&oacute;digos do javac s&atilde;o disponibilizados sobre a licen&ccedil;a GPL v2 no 
                <a href="http://openjdk.dev.java.net/">site OpenJDK</a>.
                O NetBeans 5.x e vers&otilde;es anteriores usam um vers&atilde;o mais antiga 
                do compilador javac que est&aacute; sobre uma licen&ccedil;a mais restritiva, 
                a Sun BCL;<br>
            </li>
            <li>
                <b>Analisadores XML</b> (Xerces, Crimson, Xalan, DOM, SAX, JAXP, ...)
                - usados pela IDE para analizar e manipular c&oacute;digo XML.
                <a href="http://java.sun.com/xml/">http://java.sun.com/xml/</a>;
            </li>
            <li>
                <b>Biblioteca de tempo de execu&ccedil;&atilde;o do JavaHelp 2.x</b> - A IDE 
                usa o JavaHelp para mostrar documenta&ccedil;&otilde;es on-line. Distribui&ccedil;&otilde;es 
                extras tamb&eacute;m podem incluir o JavaHelp de tempo de 
                desenvolvimento para reconstruir as bases de dados de busca.
                <a href="http://java.sun.com/products/javahelp/index.html">http://java.sun.com/products/javahelp/index.html</a>;
            </li>
            <li>
                <b>Apache Ant 1.6.x</b> - Uma ferramenta baseada em Java da qual 
                o NetBeans depende para construir os projetos.
                <a href="http://ant.apache.org/">http://ant.apache.org/</a>;
            </li>
            
            <li>
                <b>JUnit 3.8.x</b> - um framework (estrutura) de testes usado 
                para executar testes unit&aacute;rios no NetBeans. 
                <a href="http://www.junit.org/index.html">http://www.junit.org/index.html</a>;
            </li>
            <li>
                <span style="font-weight: bold;">Tomcat 5.x.x</span> - um 
                container para servlets Java e JSP integrado &agrave; 
                IDE. <a href="http://jakarta.apache.org/tomcat/index.html">http://jakarta.apache.org/tomcat/index.html</a>;
            </li>
            <li>
                <span style="font-weight: bold;">Standard Tag Library (JSTL)</span>
                - <a href="http://java.sun.com/products/jsp/jstl/">http://java.sun.com/products/jsp/jstl/</a>.
            </li>
            
        </ul>
        <p>Uma dada distribui&ccedil;&atilde;o do NetBeans pode conter mais ou menos arquivos 
            extras n&atilde;o licenciados sobre a CDDL. Pergunte na 
            <a href="../lists/top.html">lista nbdev</a> para ter certeza.
        </p>
        <h2>Contribuindo</h2>
        <br>
        Veja a p&aacute;gina <a href="../contribute/index_pt_BR.html">como contribuir</a>.
  </body>
</html>
