<html>
   <head>
      <title>FAQs do NetBeans Quiz Sweepstakes</title>
      <link rel="stylesheet" type="text/css" href="../netbeans.css">
      <meta name="NetBeans Quiz Sweepstakes FAQs" content="FAQs for NetBeans Quiz Sweepstakes">
   </head>
   
   <body>
      <script type="text/javascript">
         document.getElementById('navig-breadcrumbs').innerHTML='<a href="./">Quiz Home Page</a>';
        </script> 
      <h1>FAQs do NetBeans Quiz Sweepstakes</h1>
      
      <h2>Perguntas Frequentes</h2>
      <ul>
         <li><a href="#country">Eu vivo no [pa&iacute;s], posso participar?</a></li>
         <li><a href="#get-quiz-plugin">J&aacute; tenho o NetBeans IDE, como obtenho o plug-in do quiz?</a></li>
         <li><a href="#help">Estou tendo dificulades para me conectar ao Centro de Atualiza&ccedil;&atilde;o do NetBeans. </a>Podem ajudar?</li>
         <li><a href="#version">Quais vers&otilde;es do NetBeans IDE posso usar para o quiz?</a></li>
         <li><a href="#OS">Estou atualizando meu Sistema Oprecional durante o quiz. Irei perder todos meus quizzes anteriores?</a></li>
         <li><a href="#multiple">Tr&ecirc;s de n&oacute;s estamos compartilhando o mesmo computador, como posso configur&aacute;-lo para que todos n&oacute;s possamos participar do quiz?</a></li>
         <li><a href="#community_help">Como obtenho ajuda geral sobre o NetBeans IDE/</a></li>
         <li><a href="#selection">Como s&atilde;o selecionados os ganhadores para o pr&ecirc;mio semanal?</a></li>
         <li><a href="#winner">Com posso saber se ganhei um quiz semanal?</a></li>
         <li><a href="#grand_prize">Como posso gannhar o grande pr&ecirc;mio?</a></li>
         <li><a href="#prize_list">Qual &eacute; o pr&ecirc;mio da pr&oacute;xima semana?</a></li>
         <li><a href="#winner_list">Onde posso ver a lista dos ganhadores?</a></li>
         <li><a href="#num_quizzes">Quantos quizzes h&aacute;?</a></li>
         <li><a href="#deadline">Qual o prazo para submeter quizzes?</a></li>
         <li><a href="#past_quizzes">Acabei de saber sobre este concurso e ele come&ccedil;ou semanas atr&aacute;s. Posso participar de quizzes de semanas anteriores?</a></li>
         <li><a href="#why_bother">Porque devo me incomodar em participar de quizzes antigos e outra pessoa ganhou o pr&ecirc;mio?</a></li>
         <li><a href="#question">E se minha pergunta n&atilde;o for aqui respondida?</a></li>
      </ul>
      <p> Caso suas perguntas n&atilde;o foram aqui respondidas, mande as mesmas para&nbsp;<a href="mailto:quiz@netbeans.org">quiz@netbeans.org</a>.<br>
      
      <a name="country"></a>
      <h4>Eu vivo no [pa&iacute;s], posso participar?</h4>
      <p>Esse concurso somente est&aacute; aberto para os residentes legais da &Iacute;ndia que atingiram a maioridade na data de sua entrada. Consulte as <a href="./rules.html">regras do concurso</a> para obter detalhes.</p>  
      
      <a name="get-quiz-plugin"></a>
      <h4>J&aacute; tenho o NetBeans IDE, como obtenho o plug-in do quiz?</h4>
      <p>Voc&ecirc; instala o plug-in do quiz diretamente do NetBeans IDE. Siga para <b>Ferramentas -&gt; Plug-ins</b> e encontre o plug-in do quiz na lista de plug-ins dispon&iacute;veis. Selecione-o para instala&ccedil;&atilde;o e clique no bot&atilde;o Instalar.</p>
      
      <a name="help"></a>
      <h4>Estou tendo dificulades para me conectar ao Centro de Atualiza&ccedil;&atilde;o do NetBeans. Podem ajudar?</h4>
      <p>Verifique suas configura&ccedil;&otilde;es do proxy. Siga para <b>Ferramentas -&gt; Op&ccedil;&otilde;es -&gt; Geral</b>. Especifique as configura&ccedil;&otilde;es gerias do proxy que o IDE usa para acessar a Internet ao escolher ums das seguintes: nenhum proxy, Usar as configura&ccedil;&otilde;es do proxy do sistema ou Configura&ccedil;&otilde;es manuais do proxy. Para usar as Configura&ccedil;&atilde;o manuais do proxy, &eacute; preciso especificar o HTTP do proxy e a Porta do proxy. O HTTP do proxy &eacute; o nome do host ou endere&ccedil;o IP num&eacute;rico que o servidor proxy usa para se conectar aos sites HTTP e FTP. A porta do proxy &eacute; o n&uacute;mero da porta do servidor proxy. Clique em <b>Mais</b> para definir configura&ccedil;&otilde;es mais avan&ccedil;adas do proxy.</p> 
      
      <a name="version"></a>
      <h4>Quais vers&otilde;es do NetBeans IDE posso usar para o quiz?</h4>
      <p>NetBeans IDE 5.5 e posterior: NetBeans IDE 5.5, 5.5.1, 6.0, 6.0.1, 6.1 Beta e 6.1 Release Candidate.</p>
        
      <a name="OS"></a>
      <h4>Estou atualizando meu Sistema Operacional durante o quiz. Irei perder todos meus quizzes anteriores?</h4>
      <p>N&atilde;o, voc&ecirc; pode acumular pontos de quiz mesmo se for instalar um novo plug-in de quiz. N&oacute;s o acompanhamos por seu endere&ccedil;o de e-mai. Use o mesmo endere&ccedil;o de e-mail durante o quiz.<p>
      
      <a name="multiple"></a>
      <h4>Tr&ecirc;s de n&oacute;s estamos compartilhando o mesmo computador, como posso configur&aacute;-lo para que todos n&oacute;s possamos participar do quiz?</h4>
      <p>Defina uma userdir diferente para cada pessoa que v&aacute; participar do quiz. Por padr&atilde;o, userdir &eacute; um diret&oacute;rio oculto denominado <tt>netbeans</tt> armazenado no diret&oacute;rio principal do us&aacute;rio sob <tt>.netbeans/{nb=version]</tt>. O diret&oacute;rio principal &eacute; <tt>${HOME}</tt> em sistema do tipo Unix e <tt>C:\Documents and Settings\[user] </tt>no Windows. Para obter mais informa&ccedil;&otilde;es consulte as FAQS <a href="http://wiki.netbeans.org/FaqWhatIsUserdir">O que &eacute; o diret&oacute;rio .netbeans?</a> e <a href="http://wiki.netbeans.org/FaqAlternateUserdir">Posso executar o NetBeans com um &quot;userdir&quot; alternativo?</a>. </p>  
      
      <a name="community_help"></a>
      <h4>Como obtenho ajuda geral sobre o NetBeans IDE?</h4>
      <p>Voc&ecirc; pode ler a <a href="../kb/index.html">documenta&ccedil;&atilde;o</a> ou a <a href="http://wiki.netbeans.org/NetBeansUserFAQ">FAQ de usu&aacute;rio Netbeans</a> (especialmente <a href="http://wiki.netbeans.org/FaqWhereToAskForHelp">esta</a>).</p>     
      
       <a name="selection"></a>
      <h4>Como s&atilde;o selecionados os ganhadores para o pr&ecirc;mio semanal?</h4>
      <p>Quando o quiz termina, n&oacute;s geramos uma lista dos participantes que enviaram as respostas corretas para todas as perguntas e ent&atilde;o escolhemos aleatoriamente um participante. Consulte o algor&iacute;tmo em pseudo-c&oacute;digo: 
      <pre class="examplecode">      
 if (now == Algorithm.End_Date) {

   Array correct= find(users who answered correctly all questions in quiz)

   int winnerIdx = Random() // randomly chose index

   return winner = correct[winnerIndex]

 }</pre>

<P>Como implementa&ccedil;&atilde;o usamos: java.util.Random

      <pre class="examplecode">      
int winnerIdx = new Random().nextInt(correct.size());</pre>
      
      <a name="winner"></a>
      <h4>Com posso saber se ganhei um quiz semanal?</h4>
      <p>Todos os ganhadores ser&atilde;o notificados por e-mail e uma lista dos ganhadores ser&aacute; semanalmente publicada na<a href="http://statistics.netbeans.org/quiz/winners.jsp">p&aacute;gina Ganhadores do Quiz</a>. </p>
    
      <a name="grand_prize"></a>
      <h4>Como posso gannhar o grande pr&ecirc;mio?</h4>
      <p>O grande pr&ecirc;mio ser&aacute; concedido &agrave; pessoas que submente as respostas mais correta cumulativamente dos quizzes semanais. Caso haja empate, o ganhador do grande pr&ecirc;mio ser&aacute; determinado de forma aleat&oacute;ria entre os participantes do topo.</p>
      
      <a name="prize_list"></a>
      <h4>Qual &eacute; o pr&ecirc;mio da pr&oacute;xima semana?</h4>
      <p>Os pr&ecirc;mios est&atilde;o listados na <a href="./prizes.html">p&aacute;gina Pr&ecirc;mios</a></p>
      
      <a name="winner_list"></a>
      <h4>Onde posso ver a lista dos ganhadores?</h4>
      <p>A lista de ganhadores ser&aacute; publicada semanalmente na <a href="http://statistics.netbeans.org/quiz/winners.jsp">p&aacute;gina Ganhadores do Quiz</a>. </p>
      
      <a name="num_quizzes"></a>
      <h4>Quantos quizzes h&aacute;?</h4>
      <p>Onze. Os quizzes s&atilde;o semanais iniciando em 14 de abril de 2008. <a name="deadline"></a>
      <h4>Qual o prazo para submeter quizzes?</h4>
      <p>Os quizzes semanais iniciam na segunda-feira as 12:00 IST e terminam na pr&oacute;xima segunda-feira as 23:59 IST. </p>
      
      <a name="past_quizzes"></a>
      <h4>Acabei de saber sobre este concurso e ele come&ccedil;ou semanas atr&aacute;s. Posso participar de quizzes de semanas anteriores?</h4>
      <p>Sim! O plug-in do quiz ir&aacute; inform&aacute;-lo sobre os quizzes de semanas anteriores.</p>
      
      <a name="why_bother"></a>
      <h4>Porque devo me incomodar em participar de quizzes antigos e outra pessoa ganhou o pr&ecirc;mio?</h4>
      <p>Porque o grande pr&ecirc;mio tem base em sua pontua&ccedil;&atilde;o cumulativa em todos os quizzes. </p>
      
      <a name="question"></a>
      <h4>E se minha pergunta n&atilde;o for aqui respondida?</h4>
      <p>Caso sua pergunta n&atilde;o seja aqui respondida, mande a mesma para <a href="mailto:quiz@netbeans.org">quiz@netbeans.org</a>. </p>
      <p>
      <h3>Boa sorte!</h3>
   </body>
</html>
