<html>
<head>
<title>Regras do NetBeans Quiz Sweepstakes</title>
<link rel="stylesheet" type="text/css" href="../netbeans.css">
<meta name="description" content="NetBeans Quiz Sweepstakes Rules">
</head>

<body>
<h1>Regras do NetBeans Quiz Sweepstakes</h1>
    
<p class="align-center"><b>NetBeans Quiz Sweepstakes <br><br>REGRAS OFICIAIS<br><br>NENHUMA COMPRA NECESS&Aacute;RIA</b></p>


<h3>DESCRI&Ccedil;&Atilde;O DO SWEEPSTAKES:</h3> 
<p>O NetBeans Quiz Sweepstakes (“Sweepstakes”) oferece aos participantes a ganhar um pr&ecirc;mio ao participar de quizes semanais submetidos atrav&eacute;s do Centro de Atualiza&ccedil;&atilde;o do NetBeans. Os detalhes dos pr&ecirc;mios e como participar do Sweepstakes est&atilde;o definidos nestas Regras Oficiais.  </p>

<h3>ELEGIBILIDADE:</h3>
<p>Esse Sweepstakes somente est&aacute; aberto para os residentes legais da &Iacute;ndia que atingiram a maioridade na data de sua entrada. Nulo onde proibido por lei. Os funcion&aacute;rios da Sun Microsystems, Inc., e de suas empresas principais, afiliadas e subsidi&aacute;rias, ag&ecirc;ncias de publicidade e promo&ccedil;&atilde;o participantes (e membros de sua fam&iacute;lia imediata, definido como parentes, crian&ccedil;as, companheiros e esposas, a despeito de onde residem, e/ou os que est&atilde;o vivendo na mesma resid&ecirc;ncia) n&atilde;o s&atilde;o eleg&iacute;veis. Os participantes tamb&eacute;m precisam ter acesso &agrave; Internet e um endere&ccedil;o v&aacute;lido de e-mail para participar. </p> 
<h3>COMO PARTICIPAR:</h3>
<p>Durante o per&iacute;odo de 14 de abril de 2008, as 00:01 India Standard Time (“IST”) at&eacute; 30 de junho de 2008, as 23:59 PM IST (o “Per&iacute;odo do Sweepstake”), os participantes entram automaticamente em um sorteio semanal ao enviarem respostas corretas para todas as perguntas de um quiz semanal do NetBeans. &quot;(Quiz Semanal&quot;). O Sweepstakes consistem em 11 per&iacute;odos de entradas semanais (“Per&iacute;odos de Entrada Semanal”). Cada Per&iacute;odo de Entrada Semanal ir&aacute; come&ccedil;ar na segunda-feira as 00:01 IST e ir&aacute; terminar na segunda-feira as 23:59 IST. O rel&oacute;gio do Patrocinador &eacute; o rel&oacute;gio de hor&aacute;rio oficial do Sweepstakes. A prova de envio n&atilde;o se constitui como prova de recebimento.  </p>
<p style="margin-left: '4em'">&Eacute; preciso ter o NetBeans 5.5 ou posterior instalado em seu computador, e &eacute; preciso instalar o m&oacute;dulo opcional do plug-in do NetBeans Quiz do Centro de Atualiza&ccedil;&atilde;o do NetBeans para participar de cada Quiz Semanal. O NetBeans 6.0 est&aacute; dispon&iacute;vel de gra&ccedil;a em www.netbeans.org. Instale o NetBeans, incluindo o m&oacute;dulo do quiz NetBeans e siga as instru&ccedil;&otilde;es para completar e enviar o formul&aacute;rio de registro para o Sweepstakes. Voc&ecirc; ter&aacute; que fornecer seu nome, endere&ccedil;o de e-mail e endere&ccedil;os postais. </p>
<p style="margin-left: '4em'">Ap&oacute;s ter se registrado para o Sweepstakes, poder&aacute; optar por receber uma notifica&ccedil;&atilde;o semanal por e-mail com um link para o Quiz Semanal. O Quiz Semanal consiste de perguntas com o tema de desenvolvimento t&eacute;cnico de software. Todos os campos requeridos do formul&aacute;rio de entrada para o Quiz Semanal precisam ser preenchidos, incluindo sua resposta para o Quiz Semanal. Adicionalmente, para ser eleg&iacute;vel para um determinado Sorteio do Per&iacute;odo de Entrada Semanal, sua resposta precisa: (1) ser fornecida em Ingl&ecirc;s; (2) ser fornecida no formul&aacute;rio especificado pelo determinado Quiz Semanal; e (3) precisa fornecer as respostas corretas para todas as perguntas no determinado Quiz Semanal. (&quot;Entrada&quot;). Limitado a 1 (uma) Entrada por pessoa ou endere&ccedil;o de e-mail pro Per&iacute;odo de Entrada Semanal. Se um participante usa m&uacute;ltiplos endere&ccedil;os de e-mail para submeter mais de uma Entrada para um determinado Per&iacute;odo de Entrada Semanal, somente a primeira Entrada ser&aacute; eleg&iacute;vel para o sorteio daquele Per&iacute;odo de Entrada Semanal. (&quot;Sorteio Semanal&quot;). As entradas n&atilde;o ir&atilde;o passar para os sorteios dos Per&iacute;odos de Entrada Semanal subsequentes. A probabilidade de ganhar o Pr&ecirc;mio Semanal depende do n&uacute;mero de Entradas eleg&iacute;veis recebidas.  </p>
<p style="margin-left: '4em'">O “Grande Pr&ecirc;mio Cumulativo” ser&aacute; concedido ao participantes que respondeu corretamente a maioria dos Quizes Semanais durante o Per&iacute;odo do Sweepstakes. No caso de empate, o ganhador do Grande Pr&ecirc;mio Cumulativo ser&aacute; determinado em um sorteio aleat&oacute;rio entre os participantes que s&atilde;o eleg&iacute;veis para receber o Grande Pr&ecirc;mio Cumulativo.</p>

<h3>PR&Ecirc;MIOS: </h3> 
<h4>Grande Pr&ecirc;mio:</h4>
<p style="margin-left: '4em'">Haver&aacute; 1 (um) Grande Pr&ecirc;mio concedido, consistindo em um computador laptop Apple MacBook Air. Valor aproximado no varejo (“ARV”) &eacute; de $1;799.00 USD.</p>

<h4>Pr&ecirc;mios semanais:</h4>
<p style="margin-left: '4em'">Haver&aacute; 11 (onze) Pr&ecirc;mios Semanais concedidos. O Pr&ecirc;mio Semanal com base semanal, incluindo, possivelmente iPods, TV&rsquo;s, Play Stations, Laptops e um Centro de Entretenimento Dom&eacute;stico. </p>
<p><b>TODOS OS IMPOSTOS S&Atilde;O DE RESPONSABILIDADE &Uacute;NICA DO GANHADOR.</b></p>
<h3>CONDI&Ccedil;&Otilde;ES DE PARTICIPA&Ccedil;&Atilde;O.</h3>
<p>Todas as leis e regulamentos federais, estaduais e municipais se aplicam. O Envio da Entrada para este Sweepstakes constitui o acordo do participante em estar vinculado aos termos destas Regras Oficiais e pelas decis&otilde;es do Patrocinador, que s&atilde;o finais e vincul&aacute;veis a todas as quest&otilde;es em rela&ccedil;&atilde;o a este Sweepstakes. O ganhadores ser&atilde;o notificados por e-mail. Qualquer ganhador potencial que n&atilde;o possa ser contatado dentro de 15 dias da primeira tentativa de notifica&ccedil;&atilde;o ser&aacute; desqualificado e perder&aacute; o direito a qualquer pr&ecirc;mio que ele/ela possa ter direito. O ganhador potencial do pr&ecirc;mio ter&aacute; que assinar e devolver a Declara&ccedil;&atilde;o de Elegibilidade/responsabilidade e, onde legalmente permiss&iacute;vel, uma Libera&ccedil;&atilde;o para Publicidade, dentro de 30 dias ap&oacute;s a primeira tentativa de notifica&ccedil;&atilde;o. A falha em estar em conformidade com este per&iacute;odo de tempo, pode resultar na desqualifica&ccedil;&atilde;o e a sele&ccedil;&atilde;o de um ganhador alternativo. O aceite do pr&ecirc;mio se constitui na permiss&atilde;o para, e o consentimento do ganhador para, que o Patrocinador e a Sun e suas ag&ecirc;ncia possam usar o nome do ganhador, similaridade e/ou entrada para fins publicit&aacute;rios e promocionais, sem compensa&ccedil;&atilde;o adicional, a n&atilde;o ser que proibido por lei. Na extens&atilde;o permitida por leis, os participantes concordam em manter o Patrocinador, e cada uma de suas holdings, subsidi&aacute;rias, agentes, diretores, funcion&aacute;rios, representantes e atribu&iacute;dos, n&atilde;o afetados por qualquer ferimento ou dano causado ou reclamado pela participa&ccedil;&atilde;o no Sweepstakes e/ou uso ou aceite do pr&ecirc;mio ganho, exceto na extens&atilde;o se qualquer morte ou ferimento pessoal seja causado pela neglig&ecirc;ncia do Patrocinador. O Patrocinador n&atilde;o &eacute; respons&aacute;vel para qualquer erro tipogr&aacute;fico e outros na impress&atilde;o da oferta, administra&ccedil;&atilde;o do Sweepstakes ou no anuncio do pr&ecirc;mio. Um participante poder&aacute; ser proibido de participar neste Sweepstakes se, por &uacute;nico crit&eacute;rio do Patrocinador, este realmente acreditar que o participante tentou minar a leg&iacute;tima opera&ccedil;&atilde;o deste Sweepstakes ao trapacear, fraudar ou por outras pr&aacute;ticas injustas, que incomodem, abusem, ameacem ou atormentem outros participantes, o Patrocinador ou ag&ecirc;ncias associadas. </p>

<h3>NENHUM RECURSOS JUDICIAIS OU OUTROS PROCEDIMENTOS:</h3>
<p>Na extens&atilde;o permitida por lei os direitos para ajuizar, procurar compensa&ccedil;&atilde;o ou de entrar com qualquer outro recursos judicial ou qualquer outro procedimento n caso de disputas ou reclama&ccedil;&otilde;es resultando de ou em conex&atilde;o comeste Sweepstakes, s&atilde;o aqui exclu&iacute;dos, e qualquer participante expressamente renuncia a quaisquer deste direitos e concorda que toda e qualquer disputa, reclama&ccedil;&atilde;o, e causas de a&ccedil;&otilde;es resultantes de ou em conex&atilde;o com este Sweepstakes ou qualquer pr&ecirc;mio concedido ser&aacute; solucionado individualmente, sem recurso de qualquer forma de a&ccedil;&atilde;o de classe. Os participantes concordam que estas Regras Oficiais s&atilde;o regidas pelas leis da Calif&oacute;rnia.</p>
<h3>PRIVACIDADE DE DADOS:</h3>
<p>Os participantes concordam que os dados pessoais especialmente o nome e endere&ccedil;o, podem ser processados, armazenados e de outra forma usados para os prop&oacute;sitos e dentro do contexto do Sweepstakes e quaisquer prop&oacute;sitos descritos nestas Regras Oficiais. Os dados tamb&eacute;m podem ser usados pelo Patrocinador para verificar a identidade do participante, seu endere&ccedil;o postal e n&uacute;mero de telefone, ou de outra forma verificar sua elegibilidade para participar no Sweepstakes. Tais dados n&atilde;o ser&atilde;o usado de forma err&ocirc;nea e ser&atilde;o armazenados somente com o Patrocinador para os prop&oacute;sitos identificados nestas Regras Oficiais. Os participantes t&ecirc;m o direito de acessar, verificar, corrigir ou cancelar qualquer dado pessoal mantido pelo Patrocinador ao enviar um e-mail para o Patrocinador em <a href="mailto:quiz@netbeans.org">quiz@netbeans.org</a>. Se os dados do participante n&atilde;o forem fornecidos ou se forem cancelados, a Entrada do participante ser&aacute; ineleg&iacute;vel. Ao participar no Sweepstakes, os participantes aqui concordam com todos os usos e renuncias de informa&ccedil;&otilde;es pessoais como explicado na Pol&iacute;tica de Privacidade do Patrocinador, dispon&iacute;vel em <a href="http://www.sun.com/privacy">http://www.sun.com/privacy</a>. A participa&ccedil;&atilde;o no Sweepstakes constitui ainda na concord&acirc;ncia e aceita&ccedil;&atilde;o completa e incondicional do participante destas Regras Oficiais e com a Pol&iacute;tica de Privacidade do Patrocinador e sua disponibilidade de ser contatado por telefone e/ou e-mail. </p>

<h3>GARANTIA E INDENIZA&Ccedil;&Atilde;O:</h3> 
<p>Na extens&atilde;o m&aacute;xima permitida por lei, cada participante indeniza e concorda em manter indenizado o Patrocinador a todo momento de e contra qualquer responsabilidade, reclama&ccedil;&atilde;o, demanda, perdas, danos, custos e despesas resultantes de qualquer ato, neglig&ecirc;ncia ou omiss&atilde;o do participante e/ou uma quebra de qualquer garantia aqui estabelecida. Na extens&atilde;o m&aacute;xima permitida por lei, cada participante indeniza e concorda em manter indenizado o Patrocinador a todo momento de e contra qualquer responsabilidade, reclama&ccedil;&atilde;o, demanda, perdas, danos, custos e despesas resultantes de qualquer ato, neglig&ecirc;ncia ou omiss&atilde;o do participante sob estas Regras Oficiais, incluindo sem limita&ccedil;&atilde;o, o resultante de qualquer quebra, n&atilde;o-observ&acirc;ncia, ato ou omiss&atilde;o, seja negligente ou de outra forma, de acordo com estas regras oficiais por um participante.</p>
<h3>ELIMINA&Ccedil;&Atilde;O:</h3>
<p>Qualquer informa&ccedil;&atilde;o falsa fornecida dentro do contexto do Sweepstakes por um participante, relativo a identidade, endere&ccedil;o postal, n&uacute;mero de telefone, propriedade de direito ou n&atilde;o conformidade com estas regras ou similar, pode resultar na desqualifica&ccedil;&atilde;o do participante do Sweepstakes. O Patrocinador tamb&eacute;m se reserva o direito de desqualificar qualquer Entrada que acredite e por seu &uacute;nico e exclusivo crit&eacute;rio, infringe ou viole os direitos de terceiros ou que de outra forma n&atilde;o esteja em conformidade com estas Regras Oficiais.</p>
<h3>INTERNET:</h3>
<p>O Patrocinador n&atilde;o &eacute; respons&aacute;vel por erros de transmiss&atilde;o eletr&ocirc;nica resultando na omiss&atilde;o, interrup&ccedil;&atilde;o, exclus&atilde;o e atrasos na opera&ccedil;&atilde;o ou transmiss&atilde;o. O Patrocinador n&atilde;o &eacute; respons&aacute;vel pelo roubo ou destrui&ccedil;&atilde;o de acesso n&atilde;o autorizado para ou altera&ccedil;&atilde;o de materiais da Entrada, ou por mal funcionamento ou limita&ccedil;&otilde;es t&eacute;cnicas, rede, equipamento telef&ocirc;nico, eletr&ocirc;nico, computador, hardware ou software de qualquer tipo. O Patrocinador n&atilde;o &eacute; respons&aacute;vel por transmiss&otilde;es imprecisas de ou a falha de receber informa&ccedil;&otilde;es de Entrada pelo Patrocinador por conta de problemas t&eacute;cnicos ou congestionamento de tr&aacute;fego na Internet ou em qualquer site da Web ou qualquer destas combina&ccedil;&otilde;es, exceto na extens&atilde;o de que qualquer morte ou ferimento seja causada pela neglig&ecirc;ncia do Patrocinador. Se por qualquer motivo a parte da Internet do programa n&atilde;o for capaz de ser executada como planejado, incluindo a infec&ccedil;&atilde;o por v&iacute;rus de computador, bugs, adultera&ccedil;&atilde;o, interven&ccedil;&atilde;o n&atilde;o autorizada, fraude, interrup&ccedil;&atilde;o ou termina&ccedil;&atilde;o do site do Sweepstakes por qualquer motivo ou quaisquer outras causas que corrompam ou afetem a administra&ccedil;&atilde;o, seguran&ccedil;a, justi&ccedil;a, integridade ou conduta apropriada deste Sweepstakes. O Patrocinador se reserva o direito a seu exclusivo e &uacute;nico crit&eacute;rio a cancelar, terminar, modificar ou suspender imediatamente o Sweepstakes. O Patrocinador se reserva o direito de selecionar os ganhadores das entradas eleg&iacute;veis recebidas na data do t&eacute;rmino. O Patrocinador tamb&eacute;m se reserva o direito para desqualificar qualquer indiv&iacute;duo que adultere o processo de Entrada. Cuidado: Qualquer tentativa por um Participante em danificar deliberadamente qualquer site da Web ou minar a leg&iacute;tima opera&ccedil;&atilde;o do Sweepstakes, &eacute; uma viola&ccedil;&atilde;o das leis criminais e civis, caso tal tentativa seja feita, e o Patrocinador se reserva o direito de procurar compensa&ccedil;&atilde;o por danos de qualquer tal Participante na extens&atilde;o m&aacute;xima da lei. Devido a natureza e escopo &uacute;nicos deste Sweepstakes, o Patrocinador se reserva o direito de alterar ou modificar estas Regras Oficiais a qualquer momento.</p>

<h3>APLICABILIDADE:</h3> 
<p>Se quaisquer provis&otilde;es nestas Regras Oficiais sejam consideradas inv&aacute;lidas ou n&atilde;o obrigat&oacute;rias, todas as provis&otilde;es remanescentes desta permanecer&atilde;o em completo vigor e efeito.</p>
<h3>LISTA DE GANHADORES:</h3>
<p>Para conhecer os nomes dos ganhadores, visite <a href="http://statistics.netbeans.org/quiz/">http://statistics.netbeans.org/quiz/</a> A lista ser&aacute; atualizada semanalmente com os Ganhadores Semanais, o ganhador do Grande Pr&ecirc;mio ser&aacute; listado em torno de 03 de julho de 2008, dispon&iacute;vel por um per&iacute;odo de 60 dias.</p>
<h3>PATROCINADOR:</h3>
<p>O Patrocinador deste Sweepstakes &eacute; a Sun Microsystems, Inc., Sun Microsystems, Inc., 4150 Network Circle, Santa Clara, CA 95054 EUA.</p>

</body>
</html>
