<HTML>
<HEAD>
<TITLE>Declara&ccedil;&atilde;o da Pol&iacute;tica do Contrato de Contribuidor</TITLE>
<META NAME="description" CONTENT="The Sun Contributor Agreement Policy Statement">
<META NAME="NAV_LINK" content="Contributor Agreement">
<META NAME="NAV_PRIORITY" content="1">
<link rel="stylesheet" type="text/css" HREF="../../netbeans.css">
</head>

<body>

<h1>Declara&ccedil;&atilde;o da Pol&iacute;tica Relativa ao Contrato de Contribuidor</h1>

<p>Muitos projetos de c&oacute;digo-fonte aberto, incluindo a Free Software Foundation, Red Hat e OpenOffice.org requerem que os contribuidores atribuam seu direito autoral quando contribuem com c&oacute;digo. Sun, a patrocinadora do projeto NetBeans, formulou um inovador Contrato de Contribuidor (&quot;CC&quot;), que permite que o contribuidores retenham seu direito autoral e compartilhar um interesse conjunto de direito autoral no c&oacute;digo contribu&iacute;do. Desta forma os contribuidores ret&ecirc;m todos os direitos concedidos pela lei de direito autoral, mas compartilham estes direitos com o patrocinador do projeto de c&oacute;digo-fonte aberto, para que o c&oacute;digo esteja protegido pela <a href="https://netbeans.org/cddl-gplv2.html">licen&ccedil;a dupla que consiste da Licen&ccedil;a de Desenvolvimento e Contribui&ccedil;&atilde;o Comum ( CDDL) v1.0 e pela Licen&ccedil;a de P&uacute;blico Geral GNU (GPL) v2</a> e pela lei de direito autoral.

<p>Nota: O CC substitui a Atribui&ccedil;&atilde;o de Direito Autoral Conjunto (&quot;ADAC&quot;) postado anteriormente neste site. A diferen&ccedil;a principal entre os dois contratos &eacute; a de que al&eacute;m da atribui&ccedil;&atilde;o de direito autoral conjunto, O CC inclui uma licen&ccedil;a de patente para a contribui&ccedil;&atilde;o. Isso foi adicionado para remover qualquer d&uacute;vida sobre os destinat&aacute;rios podem exercer direitos sobre a contribui&ccedil;&atilde;o que est&atilde;o cobertos pela lei de patentes, tal como o direito de uso, cria&ccedil;&atilde;o, oferta de venda ou de importa&ccedil;&atilde;o da contribui&ccedil;&atilde;o. (Diferente da atribui&ccedil;&atilde;o de direito autoral, no entanto, voc&ecirc; ret&eacute;m a propriedade &uacute;nica de quaisquer patentes que possam existir em sua contribui&ccedil;&atilde;o). Al&eacute;m disso, o CC se aplica &agrave;s contribui&ccedil;&otilde;es feitas &agrave; qualquer produto ou projeto de propriedade ou gerenciado pela Sun, portanto, voc&ecirc; n&atilde;o ter&aacute; que assinar m&uacute;ltiplos CCs para diferentes projetos de c&oacute;digo-fonte aberto patrocinados pela Sun.

<p>O netbeans.org, o primeiro projeto de c&oacute;digo-fonte aberto patrocinado pela Sun, foi padronizado ap&oacute;s o projeto Mozilla que n&atilde;o requereu as astribui&ccedil;&otilde;es de direito autoral para as contribui&ccedil;&otilde;es. Todos os projetos patrociandos pela Sun desde ent&atilde;o requereram a atribui&ccedil;&atilde;o de direito autoral similar a usada pela Free Software Foundation. Em resposta a preocupa&ccedil;&atilde;o da comunidade, a Sun est&aacute; trabalhando em um forma inovadora para tratar da atribui&ccedil;&atilde;o de direito autoral. O resultado &eacute; a ADAC, que foi aplaudida pela comunidade OpenOffice.org e agora o CC. Nossa esperan&ccedil;a &eacute; a de que o CC seja largamente adotado pela comunidade de c&oacute;digo-fonte aberto, j&aacute; que ele fornece a flexibilidade para os patrociandores e contribuidores do projeto.

<p>Para entender a vantagem do CC, considere os problemas que o Mozilla est&aacute; tendo ao tentar licenciar sua base de c&oacute;digo sob uma licen&ccedil;a tripla MPL/LGPL/GPL sem o benef&iacute;cio das atribui&ccedil;&otilde;es de direito autoral. Consulte: <a href="http://www.mozilla.org/MPL/relicensing-faq.html">http://www.mozilla.org/MPL/relicensing-faq.html</a>. Recentemente o projeto NetBeans mudou as licen&ccedil;as do <a href="license-spl.html">SPL</a> para a similar mas mais amplamente compat&iacute;velt licen&ccedil;a <a href="license.html">CDDL</a>. Isso seria um processo dif&iacute;cil e de alto custo se n&atilde;o fosse pelo CC. A requisi&ccedil;&atilde;o dos CCs tamb&eacute;m fornece ao netbeans.org a flexibilidade de tornar seu c&oacute;digo dispon&iacute;vel sob outras licen&ccedil;as, como a MPL ou a Licen&ccedil;a do Software Apache, para contribuir partes do c&oacute;digo NetBeans para estes projetos.

<p>A Sun escolheu a CDDL como a licen&ccedil;a do NetBeans por acreditar que esta licen&ccedil;a alcan&ccedil;a um bom balan&ccedil;o de permitir que as cominidades de c&oacute;digo-fonte aberto &quot;n&atilde;o-lucrativas&quot; e &quot;para o lucro&quot; possam usar a base de c&oacute;digo NetBeans para seu trabalho e produtos. A CDDL &eacute; ben&eacute;fica para a comunidade NetBeans, porque ela requer que os usu&aacute;rios devolvam para a comunidade quaisquer modifica&ccedil;&otilde;es nos arquivos fonte do NetBeans, se e quando eles decidam distribuir estas modifica&ccedil;&otilde;es. No entanto, a Sun reconhece que ao longo do tempo possa haver a necessidade de ajustar a licen&ccedil;a ou adaptar modelos de novas licen&ccedil;as na medida em que elas evoluem. O CC ir&aacute; permitir que o netbeans.org considere modelos de licen&ccedil;as alternativas para a base do c&oacute;digo Netbeans (embora o c&oacute;digo tamb&eacute;m ir&aacute; sempre permanecer dispon&iacute;vel sobre a CDDL).

<p>O requerimento CC tamb&eacute;m formece uma melhor obriga&ccedil;&atilde;o da CDDL. Sem a atribui&ccedil;&atilde;o de direito autoral, qualquer a&ccedil;&atilde;o judicial relativa ao c&oacute;digo NetBeans, iria requerer a participa&ccedil;&atilde;o de todos os contribuidores como propriet&aacute;rios do direito autoral. O CC permite que a Sun represente a comunidade NetBeans em qualque a&ccedil;&atilde;o judicial, mas ainda permite que a comunidade participe se assim o desejar como propriet&aacute;rio conjunto do direito autoral.

<p>O CC n&atilde;o modifica de nenhuma forma os direitos ou responsabilidades da comunidade NetBeans sob a CDDL. A Sun est&aacute; somente solicitando que voc&ecirc; d&ecirc; um passo adiante para aumentar a flexibilidade do netbeans.org, proteger a base do c&oacute;digo NetBeans e criar modelos de licen&ccedil;as alternativas poss&iacute;veis ao assinar o CC para quaisquer contribui&ccedil;&otilde;es.

<p>Para completar o CC, viste <a href="http://www.sun.com/software/opensource/sca.pdf">http://www.sun.com/software/opensource/sca.pdf</a>. O arquivo PDF est&aacute; ativado como formul&aacute;rio, portanto, se voc&ecirc; estiver usando um leitor adequado poder&aacute; digitar seus detalhes diretamente no PDF. Caso n&atilde;o tenha um leitor capaz de ler fomul&aacute;rios, tome cuidado para imprimir com clareza seus detalhes, incluindo seu endere&ccedil;o de e-mail.

<p>Para obter mais detalhes sobre o CC e <a href="http://wiki.netbeans.org/FaqHowDoIFileACA">e como envi&aacute;-lo</a>, consulte <a href="http://wiki.netbeans.org/NetBeansUserFAQ#Contributor_Agreement">a FAQ do Contrato de Contribuidor</a>.

<p>As empresas e indiv&iacute;duos que assinaram uma JCA est&atilde;o listados em: <a href="https://netbeans.org/about/legal/approved-contributors.html">https://netbeans.org/about/legal/approved-contributors.html</a>.

</body>
</html>
