<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta http-equiv="content-type"
 content="text/html; charset=UTF-8">
  <title>Assuntos jur&iacute;dicos</title>
  <meta name="DESCRIPTION"
 content="Legal Materials: Terms of Use, License, Privacy Policy, Approved Signatories, Contributor Agreement FAQ">
  <meta name="NAV_LINK" content="Legal">
  <meta name="NAV_PRIORITY" content="7">
  <link rel="stylesheet" type="text/css" href="../../netbeans.css">
</head>
<body>
<h1>Materiais jur&iacute;dicos</h1>
<blockquote><em>Preciso de uma licen&ccedil;a para o software NetBeans? Posso usar o NetBeans para criar um aplicativo comercial? Posso restribuir o c&oacute;digo-fonte do NetBeans?</em>
  <br>
  <br>
Para obter respostas curtas sobre estes e outras perguntas, consulte nosso <a
 href="http://wiki.netbeans.org/NetBeansUserFAQ#section-NetBeansUserFAQ-LicenseAndLegalQuestions">FAQ</a>.
</blockquote>
<p><a href="http://www.sun.com/software/opensource/sca.pdf">Contrato de Contribuidor da Oracle</a> (CCA).
</p>
<p><a href="approved-contributors.html">Signat&aacute;rios aprovados</a>: indiv&iacute;duos e empresas que assinaram e enviaram um formul&aacute;rio CCA.
</p>
<p><a
 href="http://www.sun.com/software/opensource/contributor_agreement.jsp">FAQ do Contrato de Contribuidor da Oracle</a>: todas suas perguntas respondidas no FAQ do Contrato de Contribuidor.
</p>
<p><a href="http://www.oracle.com/html/privacy.html">Pol&iacute;tica de Privacidade</a>: voc&ecirc; pode visitar este site da Web sem nos dizer quem &eacute; ou revelar quaisquer de suas informa&ccedil;&otilde;es pessoais. N&oacute;s rastreamos o endere&ccedil;o da Internet dos dom&iacute;nios dos quais as pessoas nos visitam e analisamos estes dados para tend&ecirc;ncias e estat&iacute;sticas, mas o usu&aacute;rio individual permanece an&ocirc;nimo.
</p>
<p><a href="https://netbeans.org/about/legal/terms-of-use.html">Termos de Uso</a>: o servi&ccedil;o e conte&uacute;do no NetBeans.org s&atilde;o fornecidos &quot;como est&atilde;o&quot; sem nenhuma garantia de qualquer tipo. N&oacute;s fazemos nosso melhor para assegurar a precis&atilde;o e confiabilidade da informa&ccedil;&atilde;o, conte&uacute;do, links e downloads,no entanto, voc&ecirc; aqui reconhece que qualquer confiabilidade sobre o Conte&uacute;do ou Materiais ou o uso do Servi&ccedil;o, dever&aacute; ser a seu pr&oacute;prio risco. Todos os materiais postados neste site da Web precisam ser relevantes para a Comunidade NetBeans e precisam ser de bom gosto, como determinado pelo senso comum e nos melhores padr&otilde;es de restri&ccedil;&atilde;o da comunidade.</p>
<p><a href="license.html">Licen&ccedil;a</a>: a maioria do c&oacute;digo do NetBeans IDE est&aacute; dispon&iacute;vel sob uma <a
 href="https://netbeans.org/cddl-gplv2.html">licen&ccedil;a dupla, consistindo na Licen&ccedil;a de Desenvolvimento e Distribui&ccedil;&atilde;o Comum ( CDDL) v1.0 e na Licen&ccedil;a P&uacute;blica Geral GNU (GPL) v2</a>. Consulte <a
 href="./code_dependency_matrix.html">detalhes sobre componentes do NetBeans</a> e as licen&ccedil;as que os protegem.
</p>
</body>
</html>
