<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
<META NAME="AUDIENCE" CONTENT="NBUSER">
<META NAME="TYPE" CONTENT="ARTICLE">
<META NAME="TOPIC" CONTENT="BASIC">
<META NAME="description" CONTENT="The Cool Auto Comment Tool In NetBeans 4.0 - Now Documentation can be fun!">
	<meta http-equiv="content-type" content="text/html; charset=UTF-8">
	<title>A excelente ferramenta de coment&aacute;rio autom&aacute;tico no NetBeans 4.0 - Agora a documenta&ccedil;&atilde;o pode ser divertida!</title>
<link rel="stylesheet" type="text/css" href="../../netbeans.css">
</head>
<body >
<h1>A excelente ferramenta de coment&aacute;rio autom&aacute;tico no NetBeans 4.0 - Agora a documenta&ccedil;&atilde;o pode ser divertida! </h1>
<div class="articledate" style="margin-left:0px;">Contribui&ccedil;&atilde;o de Jason Stapley como parte da competi&ccedil;&atilde;o <a href="../../competition/win-with-netbeans.html">Win With NetBeans</a></div></p>
		
<h2>Introdu&ccedil;&atilde;o</h2>
<p>
Desculpe por ter feito voc&ecirc;s rirem do t&iacute;tulo, caso contr&aacute;rio n&atilde;o leriam um artigo sobre a reda&ccedil;&atilde;o de documenta&ccedil;&atilde;o.
<br>
Sempre gostei da ferramenta JavaDoc no JDK, lan&ccedil;ada pela Sun. &Eacute; uma boa maneira de conduzir os futuros desenvolvedores/mantenedores de seu c&oacute;digo na dire&ccedil;&atilde;o certa. Ou se voc&ecirc; &eacute; como Eu, para conduzir a si pr&oacute;prio na dire&ccedil;&atilde;o certa quando tiver esquecido de como funciona seu c&oacute;digo ap&oacute;s alguns meses/semanas/dias.</p>
<h2>O qu&ecirc; a ferramenta de coment&aacute;rio autom&aacute;tico pode fazer para mim?</h2>
<p>
Bom, ela n&atilde;o ir&aacute; redigir sua documenta&ccedil;&atilde;o por voc&ecirc;. Voc&ecirc; ainda tem de fazer isso, no entanto, ela ir&aacute; formatar/estruturar seus coment&aacute;rios no JavaDoc de forma amig&aacute;vel. 
<br>
Mais e isso &eacute; chave, <b>ela ir&aacute; indicar os coment&aacute;rios faltantes.</b> Essa &eacute; uma forma mais natural de validar seus coment&aacute;rios Java. Antes de come&ccedil;ar a usar o NetBeans ou ter descoberta a ferramenta de coment&aacute;rio autom&aacute;tico, Eu executa a ferramenta JavaDoc e mudava meus coment&aacute;rios ou par&acirc;metros com base nos avisos recebidos. Este m&eacute;todo consome tempo e &eacute; entediante e significa que havia uma maior chance de errar. Usando a ferramenta de coment&aacute;rio autom&aacute;tico, voc&ecirc; &eacute; imediatamente alertado sobre erros ou omiss&otilde;es e pode corrigir os erros aqui e agora e ali n&atilde;o tendo que voltar no c&oacute;digo para corrigi-lo.
</p>
<h2>Como utilizo a ferramenta de coment&aacute;rio autom&aacute;tico?</h2>
<ol>
	<li>Abra o projeto NetBeans
	<li>Abra um arquivo Java ou selecione o mesmo ou o n&oacute; da classe na janela Projetos. Caso n&atilde;o o fa&ccedil;a, a ferramenta de coment&aacute;rio autom&aacute;tico n&atilde;o estar&aacute; dispon&iacute;vel. O uso da ferramenta de coment&aacute;rio autom&aacute;tico &eacute; toda baseada em contexto. Caso voc&ecirc; execute a ferramenta de coment&aacute;rio autom&aacute;tico em outra classe, ela n&atilde;o ir&aacute; abrir outra inst&acirc;ncia do coment&aacute;rio autom&aacute;tico. Isso significa que voc&ecirc; somente pode editar os coment&aacute;rios para um arquivo Java de cada vez. Voc&ecirc; n&atilde;o pode executar a ferramenta de coment&aacute;rio autom&aacute;tico em um projeto como um todo (<i>Dica para um recurso</i>)
	<li>No menu <b>Ferramentas</b> selecione <b>Coment&aacute;rio autom&aacute;tico&hellip;</b>

</ol>
<p>
Quando a ferramenta de coment&aacute;rio autom&aacute;tico estiver aberta, no painel esquerdo voc&ecirc; ver&aacute; uma lista dos m&eacute;todos em sua classe e uma s&eacute;rie de bot&otilde;es com &iacute;cones nos mesmos. 
</p>
<p>
Estes bot&otilde;es s&atilde;o filtros. Caso voc&ecirc; tenha uma classe com um maior n&uacute;mero de m&eacute;todos e vari&aacute;veis, os filtros do coment&aacute;rio autom&aacute;tico ajudam a focar em apenas aquilo que precisa ser comentado.</p>
<h2>Usando os filtros do coment&aacute;rio autom&aacute;tico</h2>
<p>
Clique no primeiro bot&atilde;o na esquerda. Este bot&atilde;o se parece com uma caixa verde com uma marca branca no mesmo. &Eacute; um bot&atilde;o de altern&acirc;ncia. Quando este bot&atilde;o &eacute; pressionado, todos os coment&aacute;rios que atendam a especifica&ccedil;&atilde;o JavaDoc s&atilde;o exibidos.
</p>
<p>
Caso precise de uma explica&ccedil;&atilde;o mais detalhada dos bot&otilde;es de filtro. Siga para o menu Ajuda e clique nos conte&uacute;dos da Ajuda. A seguir, clique na guia Pesquisar e insira as palavras-chave <b>Coment&aacute;rio autom&aacute;tico. </b>Ou basta clicar no bot&atilde;o Ajuda junto a lista de m&eacute;todos na ferramenta de coment&aacute;rio autom&aacute;tico.
</p>
<p>
Observe os &iacute;cones exibidos junto a cada m&eacute;todo na lista de sua classe abaixo do bot&atilde;o Filtro. </p>
<h2>O coment&aacute;rio Java &eacute; o &iacute;cone OK.</h2>
<p>
O &iacute;cone exibido que se parece como uma caixa verde com uma marca branca no mesmo, significa que os coment&aacute;rios para aquele m&eacute;todo ou vari&aacute;vel atende a especifica&ccedil;&atilde;o JavaDoc e que n&atilde;o h&aacute; trabalho adicional a ser feito. Como<i>parte de sua verifica&ccedil;&atilde;o, voc&ecirc; inseriu um coment&aacute;rio relevante/preciso/atualizado sobre o m&eacute;todo ou vari&aacute;vel</i>.</p>

<h2>&Iacute;cones ausentes no coment&aacute;rio</h2>
<p>
Caso veja um &iacute;cone que se parece com uma caixa vermelha com um X banco no mesmo, isso significa que os coment&aacute;rios do m&eacute;todo n&atilde;o atendem a especifica&ccedil;&atilde;o JavaDoc ou voc&ecirc; n&atilde;o tem qualquer coment&aacute;rio associado com o mesmo. Quando iniciei a usar o JavaDoc as vezes escrevia meus blocos de coment&aacute;rios como...
</p>
<pre class='examplecode'>
/*
* Java rocks
*/</pre>
<p>
&Eacute; claro que nada aparecia no JavaDoc porque falta uma estrela extra. Por exemplo, se voc&ecirc; insere coment&aacute;rios atrav&eacute;s da ferramenta de coment&aacute;rio autom&aacute;tico no campo de <b>texto de coment&aacute;rio JavaDoc</b>, a ferramenta de coment&aacute;rio autom&aacute;tico escreve seus coment&aacute;rios para seu c&oacute;digo com a formata&ccedil;&atilde;o correta.</p>
<pre class='examplecode'>/**
* Java rocks

*/</pre>
<p>
Se o erro for <b>coment&aacute;rio ausente</b>. A ferramenta de coment&aacute;rio autom&aacute;tico faz o alerta na caixa de listagem abaixo da lista de m&eacute;todos. A mensagem de erro abaixo ser&aacute; que <b>o coment&aacute;rio JavaDoc est&aacute; ausente </b>. Caso j&aacute; tenha comentado o m&eacute;todo ou vari&aacute;vel e este erro est&aacute; sendo indicado, voc&ecirc; pode verificar se n&atilde;o falta um * extra ao clicar no bot&atilde;o Visualizar c&oacute;digo-fonte. Novamente como tudo na ferramenta de coment&aacute;rio autom&aacute;tico tudo tem base no contexto. Caso n&atilde;o tenha um m&eacute;todo selecionado, o bot&atilde;o Visualizar c&oacute;digo-fonte estar&aacute; acinzentado.
</p>
<h2>&Iacute;cone de erro parcial ou voc&ecirc; entendeu tudo errado</h2>
<p>
O &iacute;cone no qual temos o maior interesse &eacute; o &iacute;cone de Erro parcial que se aprece com um tri&acirc;ngulo com um s&iacute;mbolo de raio no mesmo. A maioria da vezes em que voc&ecirc; ver&aacute; esse erro &eacute; quando esqueceu de incluir um indicador @param em seus coment&aacute;rios do m&eacute;todo que t&ecirc;m par&acirc;metros. Por exemplo, a ferramenta de coment&aacute;rio autom&aacute;tico lhe dir&aacute; qual par&acirc;metro tem o indicador ausente. O indicador para o par&acirc;metro <b>&lt;Nome de seu par&acirc;metro&gt;</b> est&aacute; ausente.
</p>
<p>
Outro exemplo de quando ir&aacute; receber o erro parcial &eacute; quando voc&ecirc; adiciona indicadores desnecess&aacute;rios em um coment&aacute;rio. Por exemplo, se voc&ecirc; adiciona o indicador de autor em um m&eacute;todo de classe que n&atilde;o &eacute; uma classe. Examine o exemplo abaixo.
</p>
<pre class='examplecode'>

/**
 * Esse m&eacute;todo faz algo
 * @param Algo
 * @Autor Jason Stapley &ndash; Isso &eacute; um erro. N&atilde;o EU, o indicador Autor!
 */
Void doSomething(String Something) {
    System.out.println(Something);
}</pre>
<p>
Voc&ecirc; pode corigir este tipo de erro na ferramenta de coment&aacute;rio autom&aacute;tico ao selecionar o indicador indesejado na lista de indicadores e ao clicar no bot&atilde;o Excluir. O que conduz de forma simples ao pr&oacute;ximo cabe&ccedil;alho - Adicionando indicadores.
</p>
<h2>Adicionando indicadores em seus blocos de coment&aacute;rios</h2>
<p>
Clique no bot&atilde;o <b>Novo... </b>sob a lista de indicadores na ferramenta de coment&aacute;rio autom&aacute;tico e voc&ecirc; ver&aacute; a nova janela de indicador. Ela lista os tipos de indicadores que podem ser adicionados em seu bloco de coment&aacute;rios. Os indicadores mais comuns s&atilde;o @Param e @Return, ap&oacute;s voc&ecirc; selecionar o tipo de indicador que deseja, e se for um par&acirc;metro &eacute; preciso nomear o mesmo no campo Par&acirc;metro. O par&acirc;metro precisa coincidir com o par&acirc;metro em seu m&eacute;todo. N&atilde;o se preocupe se errar, pois a ferramenta de coment&aacute;rio autom&aacute;tico ir&aacute; indicar o memso. </p>
<p>A seguir, adicione seu coment&aacute;rio no campo <b>Descri&ccedil;&atilde;o</b>. Repita at&eacute; que todos os seus par&acirc;metros de declara&ccedil;&otilde;es de retorno estejam comentados. Clique em outro m&eacute;todo ou clique em Atualizar. O m&eacute;todo que acaba de comentar deveria mudar para o &iacute;cone Coment&aacute;rio OK. Caso n&atilde;o mude, verifique a caixa de texto de mensagem de erro abaixo da lista de m&eacute;todos, para obter o motivo do problema.
</p>
<h2>Ordem dos indicadores</h2>
<p>
N&atilde;o &eacute; preciso colocar seus indicadores em qualquer ordem definda, para que seu JavaDoc esteja correto. Seja o que for l&oacute;gico para voc&ecirc; e para outros que ir&atilde;o ler seu c&oacute;digo. Usando a ferramenta de coment&aacute;rio autom&aacute;tico, &eacute; poss&iacute;vel alterar a ordem dos indicadores em seu bloco de coment&aacute;rios. Por exemplo, caso deseje que os indicadores de retorno sejam sempre os &uacute;ltimos indicadores na lista, voc&ecirc; o seleciona e o move para a parte inferior da lista ao clicar no bot&atilde;o <b>Mover abaixo </b>. Caso deseje que esteja no topo da lista, voc&ecirc; o seleciona e clica no bot&atilde;o <b>Mover acima </b>, e novamente estes bot&otilde;es somente est&atilde;o dispon&iacute;veis no contexto de o que est&aacute; sendo feito.</p>
<h2> Indicadores HTML </h2>
<p>
Como o JavaDoc cria HTML, &eacute; poss&iacute;vel adicionar indicadores HTML em seus coment&aacute;rios. Selecione um m&eacute;todo ou um campo que deseja comentar no tipo de campo <b>Texto do coment&aacute;rio JavaDoc</b>: &lt; e aguarde alguns segundos para ver a lista de indicadores que voc&ecirc; pode usar, da mesma forma que quando estiver editando c&oacute;digo, &eacute; poss&iacute;vel digitar um nome de obejto e a seguir o ponto, e ver&aacute; uma lista dos m&eacute;todos que isso faz para os mesmos indicadores. Voc&ecirc; tamb&eacute;m tem o recurso de completar autom&aacute;tico no campo <b>Descri&ccedil;&atilde;o</b> do indicador. </p>
<p>Tamb&eacute;m h&aacute; uma sele&ccedil;&atilde;o dos indicadores de uso mais comum no JavaDoc na parte inferior direita da tela da ferramenta de coment&aacute;rio autom&aacute;tico, estes sendo <tt>&lt;B&gt; &lt;I&gt; &lt;U&gt; &lt;CODE&gt; &lt;PRE&gt; &lt;@link&gt;.</tt>
</p><p>Muito poderoso.</p>
<h2>Atualizando o coment&aacute;rio autom&aacute;tico</h2>
<p>
Algumas vezes voc&ecirc; precisa retornar para seu c&oacute;digo. Por exemplo, quando voc&ecirc; esquece de iniciar seu bloco de coment&aacute;rios com duas estrelas, o coment&aacute;rio autom&aacute;tico n&atilde;o pode encontrar seu coment&aacute;rio, portato, &eacute; precisoclicar em Visualizar c&oacute;digo-fonte e verificar. Caso tenha cometido um erro e voc&ecirc; volta apara a ferramenta de coment&aacute;rio autom&aacute;tico, &eacute; sempre uma boa id&eacute;ia clicar no bot&atilde;o <b>Atualizar</b>, para se assegurar a n&atilde;o duplica&ccedil;&atilde;o de seu trabalho.</p>
<h2>Corre&ccedil;&atilde;o autom&aacute;tica</h2>
<p>Vamos dizer que voc&ecirc; tem um m&eacute;todo que tem muitos par&acirc;metros e a digita&ccedil;&atilde;o de todos os par&acirc;metros levaria algum tempo. O recurso Corre&ccedil;&atilde;o autom&aacute;tica cria todos os indicadores de par&acirc;metros e os nomeia, portanto, voc&ecirc; somente precisa adicionar o coment&aacute;rio. Isso &eacute; feito ao selecionar o m&eacute;todo que deseja comentar e ao clicar no bot&atilde;o <b>Corre&ccedil;&atilde;o autom&aacute;tica</b>, e a seguir adicionar seus coment&eacute;rios no campo <b>Descri&ccedil;&atilde;o</b> do par&acirc;metro.
</p>
<h2>Quando tiver terminado</h2>
<p>Assegure que seu trabalho &aacute;rduo tenha sido salvo ao clicar no bot&atilde;o <b>Salvar todos</b> na barra de ferramentas.</p>
<h2>Conclus&atilde;o</h2>
<p>Agoara voc&ecirc; sabe como usar o recurso de <b>Coment&aacute;rio autom&aacute;tico</b> e quanto tempo isso pode lhe economizar. N&atilde;o haver&aacute; desculpas por n&atilde;o comentar seu c&oacute;digo. Como um experimento, execute o recurso em algum de seu c&oacute;digo antigo e ter&aacute; uma surpresa!</p>
</body>
</html>
