<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<HEAD>
<TITLE>Estudo de caso do perfilador NetBeans </TITLE>
<META NAME="Author" CONTENT="Case Study of NetBeans Profiler">
	  <link rel="stylesheet" type="text/css" href="../../netbeans.css">
<META NAME="AUDIENCE" CONTENT="NBUSER">
<META NAME="TYPE" CONTENT="ARTICLE">
<META NAME="TOPIC" CONTENT="ADVANCED">
<META NAME="description" CONTENT="Looking at the JFluid profiler inside NetBeans IDE">
</HEAD>
<body>
<h1>Estudo de caso do perfilador NetBeans</h1>
<div class="articledate" style="margin-left:0px;">Contribui&ccedil;&atilde;o de Ryoji Sawa como parte da competi&ccedil;&atilde;o <a href="../win-with-netbeans.html">Win With NetBeans</a></div><p></p>
<br/>
<h2>
1. Introdu&ccedil;&atilde;o
</h2>
<div class='indent'>
<p>
 O perfilador NetBeans tem base na tecnologia de perfilamento conhecida como Jfluid desenvolvida pela Sun. Eu gosto da Jfluid. Ela me ajudou a detectar o vazmento de mem&oacute;ria e gargalos de desempenho em diversos aplicativos Java. A tecnologia Jfluid est&aacute; sendo integrada ao NetBeans. Mas podemos test&aacute;-la com o NetBeans 4.0. Neste artigo irei usar a vers&atilde;o Profiler Milestone 3. Gostaria de compartilhar minha experi&ecirc;ncia de como ela ajuda os desenvolvedores a aprimorarem seus aplicativos. Somente posso lhe mostrar a porta. Voc&ecirc; ter&aacute; que fazer isso por si s&oacute;.
</p>
<p>
 Caso n&atilde;o conhe&ccedil;a o Perfilador do NetBeans, visite primeiro o seguinte URL. H&aacute; diversos documentos sobre como configurar o Perfilador.
</p>
 <ul>
<a href="http://profiler.netbeans.org/">http://profiler.netbeans.org/</a>
</ul>
</div>
<br/>
<h2>
2. M&eacute;todo para detectar quest&otilde;es de vazamento de mem&oacute;ria 
</h2>
<div class='indent'>
<p>
 Aqui est&atilde;o os princ&iacute;pios para detectar quest&otilde;es de vazamento de mem&oacute;ria com o Perfilador. A detec&ccedil;&atilde;o de vazamento de mem&oacute;ria &eacute; feita pelas seguintes etapas.
</p>
<ul>
<li>Monitorar o tamanho do heap JVM e sua tend&ecirc;ncia.</li>
<li>Se o tamanho do heap usado continua a aumentar, verifique qual objeto ocupa a maioria do heap JVM.</li>
<li>Examine como/onde o objeto est&aacute; alocado e liberado.</li>
<li>Verifique se o objeto est&aacute; alocado e liberado apropriadamente no c&oacute;digo em-linha.</li>
</ul>
<p>
Com completo as etapas acima com o Perfilador? Podemos verificar isso ao examinar os diversos gr&aacute;ficos do Perfilador. 
</p>
<h3 class='tutorial'>
Gr&aacute;fico do heap na janela 'Perfilador'.
</h3>
<p>
 Primeiro, vamos examinar a janela 'Perfilador&quot; que est&aacute; localizada na parte inferior da janela NetBeans. A figura na esquerda &eacute; o gr&aacute;fico do tamanho do heap e o heap usado. Ent&atilde;o, voc&ecirc; pode ver como o tamanho do heap e o heap usado mudaram durante a execu&ccedil;&atilde;o de seu aplicativo. Se o heap usado estiver aumentando ao longo do tempo, possivelemente ent&atilde;o tem um problema de vazamento de mem&oacute;ria.
</p>

<a href="../../images_www/articles/win-with-netbeans/netbeans-memoryleak09Profiler02.gif"> <img src="../../images_www/articles/win-with-netbeans/netbeans-memoryleak09Profiler02.gif"
alt="Detec&ccedil;&atilde;o de vazamento de mem&oacute;ria" width="600"></a>

<p>A figura acima explica sucintamente como o JVM usa a mem&oacute;ria. Neste caso, o heap usado no gr&aacute;fico na esquerda &eacute; relativamente est&aacute;vel. Porque ele n&atilde;o continua a crescer ao longo do tempo.
</p>

<h3 class='tutorial'>Gr&aacute;fico de mem&oacute;ria de objetos ao-vivo</h3>

<p>
A seguir, vamos examinar o gr&aacute;fico da mem&oacute;ria para ver qual objeto est&aacute; ocupando a maior parte da mem&oacute;ria. No campo 'Bytes ao-vivo', o gr&aacute;fico mostra o tamanho da mem&oacute;ria usado por cada objeto. O campo 'Bytes ao-vivo' representa o n&uacute;mero de objetos que est&atilde;o no heap JVM. De acordo com os mesmos, n&oacute;s podemos ver qual objeto ocupa a mem&oacute;ria. Examine tamb&eacute;m o campo &quot;Gera&ccedil;&otilde;es&quot;. As 'Gera&ccedil;&otilde;es' representam o n&uacute;mero de gera&ccedil;&otilde;es sobreviventes. Se os objetos de uma classe continuam a ser alocados ao longo do tempo e n&atilde;o s&atilde;o liberados, o numero de &quot;Gera&ccedil;&otilde;es&quot; continuar&aacute; a crescer. Esta &eacute; uma situa&ccedil;&atilde;o t&iacute;pica de vazamento de mem&oacute;ria e o campo lhe fornecer&aacute; esta informa&ccedil;&atilde;o.
</p>
<img src="../../images_www/articles/win-with-netbeans/netbeans-memoryleak08ProfilingResultwindow.gif">
<p>
No exemplo do 'Gr&aacute;fico de mem&oacute;ria de objetos ao-vivo' acima, HashMap$Entry ocupa mais &aacute;rea de mem&oacute;ria. No entanto, o n&uacute;mero no campo &quot;gera&ccedil;&atilde;o&quot; &eacute; baixo. &Eacute; dif&iacute;cil concluir se h&aacute; vazamento de mem&oacute;ria. N&oacute;s precisamos executar o aplicativo por mais tempo para monitorar o uso da mem&oacute;ria.
</p>
<h3 class='tutorial'>
Gr&aacute;fico de chamada reversa
</h3>
<p>
 Caso haja qualquer objeto suspeito, ent&atilde;o examine o gr&aacute;fico de chamada reversa. Ele nos ajuda a ver onde est&atilde;o alocados os objetos que est&atilde;o ocupando a mem&oacute;ria. Ele nos fornece id&eacute;ias sobre o que examinar em nosso c&oacute;digo Java.
</p>
<a href="../../images_www/articles/win-with-netbeans/netbeans-memoryleak10Reversecallgraph.gif">
<img src="../../images_www/articles/win-with-netbeans/netbeans-memoryleak10Reversecallgraph.gif" width="600"></a>
<p>
A figura acima mostra um gr&aacute;fico de chamada reversa do objeto 'char'. O gr&aacute;fico indica que o 'char' est&aacute; alocado no m&eacute;todo StringBuffer.expandCapacity(int). Com o gr&aacute;fico de chamada reversa, &eacute; poss&iacute;vel especificar onde o objeto em quest&atilde;o est&aacute; alocado. Ent&atilde;o, examinamos o c&oacute;digo em-linha no local.
</p></div>
<br/>

<h2>3. Estudo de caso: Detectando um vazamento de mem&oacute;ria</h2>

<div class='indent'>
<p>
Permita-me apresentar um estudo de caso de detec&ccedil;&atilde;o do problema de vazamento de mem&oacute;ria com o Perfilador. O Perfilador do NetBeans tem a funcinalidade de perfilar a longevidade do objeto (registrar a cria&ccedil;&atilde;o do objeto e a coleta de lixo). Ele ir&aacute; mostra as estat&iacute;sticas de aloca&ccedil;&atilde;o e desaloca&ccedil;&atilde;o de objetos para ajud&aacute;-lo a detectar qualquer quest&atilde;o de mem&oacute;ria.
</p>

<h3 class='tutorial'>C&oacute;digo de amostra</h3>

<p>
 Para demonstrar a detec&ccedil;&atilde;o de vazamento de mem&oacute;ria com o Perfilador, use o seguinte c&oacute;digo de amostra.
</p>

<p>
[<I><b>C&oacute;digo de amostra TestHash</b></I>]
</p>
<pre class='examplecode'><code>
/*
 * Main.java
 *
 * Created on 2005/01/06, 11:00
 */

package memoryleak;

import java.util.*;
import java.io.*;

/**
 *
 * @author root
 */
public class Main {
    Hashtable hashtable = new Hashtable();
    Square sq[] = new Square[10];
   
    /** Creates a new instance of Main */
    public Main() {        
        
    }
    
    /**
     * @param args the command line arguments
     */
    public static void main(String[] args) {
        // TODO code application logic here
        Main testhash = new Main();   
        for(int i=0; i&lt;100000; i++) {
            testhash.create(i);  
            testhash.use(i);    
            testhash.release();
        }
    }
    
    // Create Square objects.
    void create(int i) {
        for(int j=0; j&lt;10; j++) {
            long index = j+i*10;
            sq[j] = new Square(index);
            hashtable.put(sq[j].num, sq[j]);
        }
    }
    
    // Use Square objects.
    void use(int i) {
        for(int j=0; j&lt;10; j++) {
            System.out.print(((Square)(hashtable.get(sq[j].num))).square + &quot; &quot;);
        }
        System.out.println();
    }
    
    void release() {
        for(int j=0; j&lt;10; j++) {
            sq[j] = null;
        }
    }
    
}

class Square {
    String num;
    String square;
    public Square(long num) {
        this.num = new Long(num).toString();
        this.square = new Long(num*num).toString();
    }
}
</code>
</pre>
<p> Assuma que o c&oacute;digo funcione da seguinte forma, apesar de j&aacute; ter notado o problema neste c&oacute;digo de amostra. :)</p> 
<ul>
<li>Cria objetos Square.</li>
<li>Armazena objetos Square criados na Hashtable.</li>
<li>Libera os objetos Square ap&oacute;s us&aacute;-los.</li>
</ul>
<p>
 Finalmente, libera os objetos Sqaure, portanto, parece n&atilde;o haver uma quest&atilde;o de vazamento de mem&oacute;ria.
</p>
<h3 class='tutorial'>
Problema: OutOfMemoryError
</h3>
<p>
 Agora vamos executar o c&oacute;digo de amostra. Caso n&atilde;o haja problemas, ele deveria exibir o quadrado de n&uacute;meros de 1 a 999999. Aqui est&aacute; o resultado da execu&ccedil;&atilde;o. 
</p>
<p>
[<I><b>Resultado da execu&ccedil;&atilde;o</b></I>]</p>


<pre class='examplecode'><code>
0 1 4 9 16 25 36 49 64 81 
	:
	snip
	:
179411544900 179412392041 179413239184 179414086329 179414933476 
179415780625 179416627776 179417474929 179418322084 179419169241 
Exception in thread &quot;main&quot; java.lang.OutOfMemoryError
</code></pre>

<p>
 Infelizmente, o aplicativo foi terminado devido a exec&ccedil;&atilde;o de OutOfMemoryError. 
</p>

<h3 class='tutorial'>Usar o Perfilador</h3>

<p>
 Porque o aplicativo de amostra terminou devido ao OutOfMemoryError? Podemos imaginar que o aplicativo exauriu a heap JVM por seu OutOfMemoryError. No entanto, como e qual objeto causou este erro?
</p>
<p>
 Este &eacute; o momento de usar o Perfilador do netBeans. Ele perfila a aloca&ccedil;&atilde;o e desaloca&ccedil;&atilde;o de novos objetos. Para executar o Perfilador, selecione a classe principal do aplicativo na janela Explorer e escolha Perfilados -&gt; Arquivo do perfilador...</p>
<p> A seguir, escolha Analisar o uso da mem&oacute;ria. Escolha Registrar os objetos e coleta de lixo.</p> 

<h3 class='tutorial'>Gr&aacute;fico do heap na janela 'Perfilador'.</h3>

<p>O aplicativo est&aacute; sendo executado com o Perfilador. Para ver os resultados da estat&iacute;stica, escolha Perfilador -&gt; Obter os resultados atuais. Na primeira etapa, examine a janela 'Perfilador' na parte inferior da janela inteira. No gr&aacute;fico do heap na janela 'Perfilador', podemos ver que o tamanho do heap usado (cor lil&aacute;s) continua a crescer. Portanto, h&aacute; uma possibilidade de problema de vazamento de mem&oacute;ria. 
</p>
<p>
[<I><b>Imagem dos resultados atuais</b></I>]</p>
<table class="b-none" cellpadding="0" cellspacing="0">
<tr><td>
<a href="../../images_www/articles/win-with-netbeans/NetbeansProfiler_html_5c0244b3.gif">
<img src="../../images_www/articles/win-with-netbeans/NetbeansProfiler_html_5c0244b3.gif" width="600"></a>
</td></tr>
<tr><td class="align-center"><a href="../../images_www/articles/win-with-netbeans/NetbeansProfiler_html_5c0244b3.gif" class="b-none">Toda a janela Netbeans </a></td></tr>
</table>
<br>

<h3 class='tutorial'>Gr&aacute;fico de mem&oacute;ria de objetos ao-vivo</h3>

<p>A seguir, examine o Gr&aacute;fico de mem&oacute;ria de objetos ao-vivo na figura acima. H&aacute; quatro objetos que ocupam a maioria da mem&oacute;ria. Eles s&atilde;o char[], String, Hashtable$Entry e Square. Examine tamb&eacute;m o campo &quot;Gera&ccedil;&otilde;es&quot; na figura acima. Este campo representa essencialmente a indica&ccedil;&atilde;o de um vazamento de mem&oacute;ria. Se este n&uacute;mero estiver aumentando consistentemente, significa possivelmente a exist&ecirc;ncia de um vazamento de mem&oacute;ria. Os quatro objetos t&ecirc;m um n&uacute;mero maior no campo Gera&ccedil;&otilde;es. Eles s&atilde;o 51. Por contraste, os outros s&atilde;o 1. Devido ao n&uacute;mero maior, suspeita-se que eles n&atilde;o foram corretamente liberados e causaram o vazamento de mem&oacute;ria.
</p>

<h3 class='tutorial'>Gr&aacute;fico de chamada reversa</h3>

<p>
Agora vamos examinar o gr&aacute;fico de chamada reversa do objeto 'char', que est&aacute; no topo da lista. Isso pode ser feito ao clicar duas vezes no item de objeto 'char'.
</p>
<p>
[<I><b>Gr&aacute;fico de chamada reversa para char </b></I>]</p>
<table class="b-none" cellpadding="0" cellspacing="0">
<tr><td>
<a href="../../images_www/articles/win-with-netbeans/netbeans-memoryleak03reversecallchar.gif">
<img src="../../images_www/articles/win-with-netbeans/netbeans-memoryleak03reversecallchar.gif" width="600"></a>
</td></tr>
<tr><td class="align-center"><a href="../../images_www/articles/win-with-netbeans/netbeans-memoryleak03.gif" class="b-none">Toda a janela Netbeans </a></td></tr>
</table>
 
<p>
 De acordo com o gr&aacute;fico de chamada reversa, parece que alguns objetos 'char' foram criados no String.&lt;init&gt;, mas nunca forma liberados. Como o 'char' foi criado no Square.&lt;init&gt;, ele tem o mesmo n&uacute;mero nos campos 'Objetos ao-vivo' e 'Objetos alocado'. Agora vamos examinar o gr&aacute;fico de chamada reversa do objeto 'String'.
</p>
<p>
[<I><b>Gr&aacute;fico de chamada reversa para String</b></I>]</p>
<table class="b-none" cellpadding="0" cellspacing="0">
<tr><td>
<a href="../../images_www/articles/win-with-netbeans/netbeans-memoryleak04String2.gif">
<img src="../../images_www/articles/win-with-netbeans/netbeans-memoryleak04String2.gif" width="600"></a>
</td></tr>
<tr><td class="align-center"><a href="../../images_www/articles/win-with-netbeans/netbeans-memoryleak04String.gif" class="b-none">Toda a janela Netbeans </a></td></tr>
</table>
<p>
 H&aacute; uma situa&ccedil;&atilde;o similar ao 'char'. Alguns dos objetos 'String' foram criados no Long.toString(), mas n&atilde;o foram liberados. O 'String' criado no Long.toString() tem o mesmo n&uacute;mero dos objetos Ao-vivo e Alocados. Por qu&ecirc; estes objetos nunca foram liberados? A pista est&aacute; na lista de objetos ao-vivo. Na lista 'Hashtable.O objeto $Entry' tamb&eacute;m tem um campo Gera&ccedil;&otilde;es mais alto. 'Hashtable.$Entry' est&aacute; vivo at&eacute; que Hashtable.remove() seja chamado. E 'Hashtable.$Entry' tem objetos que est&atilde;o armazenados na Hashtable. Portanto, podemos suspeitar que os objetos que est&atilde;o armazenados na Hashtable n&atilde;o foram apropriadamente liberados.
</p>

<h3 class='tutorial'>Examine o c&oacute;digo em-linha.</h3>

<p>
A seguir, vamos voltar para o c&oacute;digo-fonte do programa de amostra. 
</p>
<p>
[<I><b>Amostra do c&oacute;digo-fonte</b></I>]</p>

<pre class='examplecode'><code>
    void release() {
        for(int j=0; j&lt;10; j++) {
            sq[j] = null;
        }
    }
</code></pre>

<p>Bom! Agora estamos bem perto da causa raiz. Os objetos 'Square' est&atilde;o corretamente definos como 'null'. No entanto, parece que esquecemos de liberar os objetos 'Square' na Hashtable. A Hashtable tem voc&ecirc;. Podemos ver que um objeto'Square' tem um objeto 'String'. O objetos 'String' em objetos 'Square' parecem permanecer no heap. Para solucionar esta quest&atilde;o, modifique o m&eacute;todo 'liberar' no c&oacute;digo-fonte da seguinte forma.
</p>
<p>
[C&oacute;digo-fonte modificado]</p>

<pre class='examplecode'><code>
    void release() {
        for(int j=0; j&lt;10; j++) {
            hashtable.remove(sq[j].num);  /* added */
            sq[j] = null;
        }
    }
</code></pre>
<p>
Vamos executar o programa de amostra corrigido. 
</p>
<p>
[<I><b>Resultado</b></I>]</p>

<pre class='examplecode'><code>
0 1 4 9 16 25 36 49 64 81 
 :
snip
 :
999980000100 999982000081 999984000064 999986000049 999988000036 
999990000025 999992000016 999994000009 999996000004 999998000001 
</code></pre>
<p>
 Nossa, n&oacute;s vemos que o programa de amostra terminou sem erros. Com a funcionalidade de monitorar o uso da mem&oacute;ria, o Perfilador do NetBeans permite examinar em detalhes a causa do problema de vazamento de mem&oacute;ria. 

</p>
</div>
<br/>

<h2>
4. Resumo
</h2>
<div class='indent'>
<p> 
Eu apresentei uma metodologia e um estudo de caso do Perfilador NetbBeans para detectar quest&otilde;es de vazamento de mem&oacute;ria. Teste o Perfilador do NetBeans mais recente. Ele ir&aacute; ajud&aacute;-lo a analizar quest&otilde;es de mem&oacute;ria no JVM. Que o Perfilador do NetBeans esteja convosco.
</p>
</div>
<div class="feedback-box">
  <a href="/about/contact_form.html?to=3&amp;subject=Feedback:profiler case study">Envie-nos seu feedback</a>
</div>
<br style="clear:both;" />
 </body>
</html>
