<html>
<head>
<META NAME="AUDIENCE" CONTENT="NBUSER">
<META NAME="TYPE" CONTENT="ARTICLE">
<META NAME="TOPIC" CONTENT="BASIC">
<META NAME="description" CONTENT="Quick guide to customizing NetBeans templates.">
<link rel="stylesheet" type="text/css" href="../../netbeans.css">
<title>Personalize seu modelo Java do NetBeans para se ajustar &agrave;s suas necessidades</title>
</head>
<body>
<h1>Personalize seu modelo Java do NetBeans para se ajustar &agrave;s suas necessidades</h1>
<div class="articledate" style="margin-left:0px;">Contribui&ccedil;&atilde;o de Arthur Cheng como parte da competi&ccedil;&atilde;o <a href="../../competition/win-with-netbeans.html">Win With NetBeans</a></div></p>


<p>O NetBeans vem com modelos de classe gen&eacute;rica. No entanto, com frequ&ecirc;ncia, voc&ecirc; tem de redigitar ou cortar e colar o memso texto gen&eacute;rico cada vez que tenta criar uma nova classe (tal como o texto de direito autoral de sua empresa, renuncia, etc.)
</p>
<p>
N&atilde;o seria bom que o NetBeans criasse a classe Java que j&aacute; cont&eacute;m a informa&ccedil;&atilde;o? Sim, isso pode ser feito com facilidade. Modelo personalizado para o resgate!
</p>
<p>
Vamos dizer que voc&ecirc; deseja criar um modelo Java personalizado com as informa&ccedil;&otilde;es de sua empresa. Aqui est&atilde;o as etapas para configur&aacute;-lo (e estas etapas se aplicam tamb&eacute;m para personalizar interfaces Java, applets, etc.), portanto, aqui vamos n&oacute;s. 
</p>
<ol>
<li>Escolha Ferramentas &gt; Op&ccedil;&otilde;es. Na janela Op&ccedil;&otilde;es, navegue para Cria&ccedil;&atilde;o e gerenciamento de c&oacute;digo-fonte &gt; Modelos &gt; Classes Java &gt; Classe Java <br/>
<img src="../../images_www/articles/win-with-netbeans/jtempl01.gif" alt="imagem"  />
</li>
<li>Clique com o bot&atilde;o direito do mouse em Classe Java e escolha Copiar <br/>
<img src="../../images_www/articles/win-with-netbeans/jtempl02.gif" alt="imagem"  />
</li>
<li>Volte para Cria&ccedil;&atilde;o e gerenciamento de c&oacute;digo-fonte &gt; Modelos &gt; Classes Java <br/>

</li>
<li>Clique com o bot&atilde;o direito do mouse em Classes Java e escolha Colar &gt; Copiar <br/>
<img src="../../images_www/articles/win-with-netbeans/jtempl03.gif" alt="imagem"  />
</li>
<li>Voc&ecirc; agora deveria ver Class_1.java como um dos modelos sob Classes Java.<br/>
<img src="../../images_www/articles/win-with-netbeans/jtempl04.gif" alt="imagem"  />
</li>
<li>Clique com o bot&atilde;o direito do mouse em Class_1.java e escolha Renomear e a seguinte janale aparece. Substitua o nome pelo nome de sua empresa (n&oacute;s iremos usar XYZCompany aqui) e clique em OK. (N&atilde;o termine o nome do modelo com a palavra Modelo. O NetBeans n&atilde;o ir&aacute; exibir seu novo modelo caso voc&ecirc; o nomeie desta forma).<br/>
<img src="../../images_www/articles/win-with-netbeans/jtempl05.gif" alt="imagem"  />

<p>Clique em Avan&ccedil;ar na janela suspensa seguinte. </p>
<p><img src="../../images_www/articles/win-with-netbeans/jtempl06.gif" alt="imagem"  /></p>
<p> e pronto! seu novo modelo de classe Java aparece </p>
<p><img src="../../images_www/articles/win-with-netbeans/jtempl07.gif" alt="imagem"  /></p>

</li>
<li>Voc&ecirc; agora deveria ver a Class_1.java renomeada como XYZCompany.java. Chegamos a metade do caminho.</li>
<li>Clique com o bot&atilde;o direito do mouse em XYZCompany.java e escolha Abrir. O modelo do c&oacute;digo-fonte &eacute; aberto no Editor de c&oacute;digo-fonte. Clique em Fechar na janela Op&ccedil;&otilde;es para fech&acirc;-lo e ir para o Editor de c&oacute;digo-fonte.</li>
<li>Isso &eacute; onde a m&aacute;gica come&ccedil;a... No Editor de c&oacute;digo-fonte, modifique o c&oacute;digo-fonte da forma que lhe aprouver. Veja o exemplo abaixo (N&Atilde;O altere a declara&ccedil;&atilde;o da classe. Voc&ecirc; pode susbstituir todos os outros nomes de classes por __NAME__ macro, que ser&aacute; substitu&iacute;do pelo nome da classe real quando voc&ecirc; cria um arquivo a partir do modelo) :<br/>
<pre class='examplecode'>
/*
 * __NAME__.java
 *
 * Created on __DATE__, __TIME__
 *
 * Copyright(c) {YEAR!!!} XYZ Company, Inc.  All Rights Reserved.
 * This software is the proprietary information of XYZ Company.
 *
 */

package Templates.Classes;

import org.xyz.whatever         //  Place any imports that are common
                                //  to most of your classes
import org.xyz.util.Logger;     //  Logging library, for example.



/**
 * {Insert class description here}
 *
 * @version $Revision: 1.1.1.1 $
 * @since Build {insert version here} (MM YYYY)
 * @author John Doe
 * @author $Author: nbweb $, (this version)
 */
public class XYZCompany
{
     private static final String PVCS_ID = &quot;@(#)$Header: /cvs/testwww/www/competition/win-with-netbeans/customize-java-template.html,v 1.1.1.1 2009/10/29 15:04:23 nbweb Exp $&quot;;
    private static final Logger log = Logger.getLogger (__NAME__.class);
    private static final String CLASS_NAME = &quot;__NAME__&quot;;
    
    
    
    /**
     * Creates a new instance of __NAME__
     */
    public XYZCompany ()
    {
    }

    
    
    /**
     *  Add other methods here ...
     *
     *  @param value1
     *  @param value2
     *
     *  @return
     *
     *  @throw
     */
//    public void helloWorld()
  
//    throws whateverException
//    {
//    }
    
}    //  end __NAME__
</pre>
</li>
<li>Quando tiver terminado, clique em Arquivo &gt; Salvar.</li>
<li>Agora, sempre que voc&ecirc; precisar criar uma classe Java, basta escolher criar uma nova classe Java XYZCompany e ter&aacute; a informa&ccedil;&atilde;o personalizada direito aqui!
</li>
</ol>

<h3 class='tutorial'>Definir o nome de usu&aacute;rio padr&atilde;o e outras macros</h3>
<ol>
	<li>Escolha Ferramentas &gt; Op&ccedil;&otilde;es. Na janela Op&ccedil;&otilde;es, expanda Editando &gt; C&oacute;digo-fonte Java<br/>
	<img src="../../images_www/articles/win-with-netbeans/jtempl08.gif" alt="imagem"  />
	</li>
	<li>Clique no bot&atilde;o de elipse (...) do valor da Tabela de strings na guia Propriedades na direita.<br/>
	
	</li>
	<li>Set USER=Your Name <br/>
	
	</li>
	<li>Adicione outra macros no formato {Macro Name}={Macro Value} e clique em OK. (Quando voc&ecirc; define a macro, n&atilde;o coloque os caracteres de sublinhado no in&iacute;cio e no fim do nome da macro).<br/>
	
	</li>
	
</ol>


</body>
</html>
