<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Depurando o EJB sem implementar usando o NetBeans IDE</title>
<link rel="stylesheet" type="text/css" href="../../netbeans.css">
<META NAME="EXPIRES" CONTENT="N">
<META NAME="AUDIENCE" CONTENT="NBUSER">
<META NAME="TYPE" CONTENT="ARTICLE">
<META NAME="TOPIC" CONTENT="ADVANCED">
<meta name="author" content=""/>
<meta name="indexed" content="y"/>
<meta name="description" content="An Article On Debugging EJB Without Deployment Using NetBeans IDE"/>
</head>
<body>
<h1>Um artigo sobre Depurando o EJB sem implementar usando o NetBeans IDE</h1>
<div class="articledate" style="margin-left:0px;">Contribui&ccedil;&atilde;o de Raguraman Krishnamurthy como parte da competi&ccedil;&atilde;o <a href="../../competition/win-with-netbeans.html">Win With NetBeans</a></div></p>
<p>
<b>Introdu&ccedil;&atilde;o</b><br />

O desenvolvimento com o EJB nunca foi t&atilde;o f&aacute;cil. Caso haja qualquer altera&ccedil;&atilde;o na l&oacute;gica, &eacute; preciso que seja empacotada e reimplementada no container para depura&ccedil;&atilde;o. Aqui Eu discuti como o EJB pode ser testado antes de ser implementado. Este &eacute; um dos objetivos do EJB3.0. (consulte a especifica&ccedil;&atilde;o do EJB3.0 em <a href="http://java.sun.com/products/ejb/docs.html">http://java.sun.com/products/ejb/docs.html</a>). O c&oacute;digo-fonte para o exemplo discutido tamb&eacute;m est&aacute; anexado.
</p>
<p>
<b>Audi&ecirc;ncia alvo </b><br />
Este documento &eacute; dirigido como materal de leitura para desenvolvedores do EJB e para qualquer pessoa que tenha conhecimento do Java,J2EE.
</p>
<p>
<b>Ferramentas usadas</b><br/>
NetBeans3.6
</p>
<br/>
<h2>Processo atual</h2><br/>
<div class="indent">
<img alt="" src="../../images_www/articles/win-with-netbeans/debug01.gif" width="581" height="181" />
<h3 class="tutorial">O processo</h3>
<ul>
<li>Todos os arquivos Java s&atilde;o compilados</li>
<li>Todos os arquivos de classe s&atilde;o empacotados no jar/ear</li>
<li>Os arquivos jar s&atilde;o copiados para o servidor</li>
<li>O servidor implementa os ejbs</li>
<li>O desenvolvedor depura o c&oacute;digo. Se o c&oacute;digo tiver que ser alterado, as etapas 1 a 4 precisam ser repetidas.</li>
<li>Alguns servidores J2ee requerem a reinicializa&ccedil;&atilde;o para a implementa&ccedil;&atilde;o. Para cada implementa&ccedil;&atilde;o, pode ser necess&aacute;ria a reinicializa&ccedil;&atilde;o.</li>
</ul>
</div><br/>

<h2>Novo processo</h2><br/>
<div class="indent">
<img alt="" src="../../images_www/articles/win-with-netbeans/debug02.gif" width="332" height="183" />
<p><b>O processo</b></p>
<ul>
	<li>Os arquivos Java necess&aacute;rios s&atilde;o compilados</li>
	<li>O desenvolvedor depura o c&oacute;digo. Se o c&oacute;digo tiver que ser alterado, as etapas 1 a 2 precisam ser repetidas.</li>
	<li>O container J2ee n&atilde;o &eacute; necess&aacute;rio para a depura&ccedil;&atilde;o.</li>
</ul>
<p>N&atilde;o preciso explicar as vantagens deste estilo de depura&ccedil;&atilde;o.</p>

<h3 class="tutorial">Cen&aacute;rio</h3>
<p>
Vamos assumir que n&oacute;s desenvolvemos O Portal de Funcion&aacute;rios usando o EJB. O projeto cont&eacute;m um EmployeeServiceEJB e um DepartmentServiceEJB. O EmployeeServiceEJB fornece o nome do funcion&aacute;rio se este tiver sido fornecido. Este EJB tamb&eacute;m retorna o nome do departamento do funcion&aacute;rio se a ID tiver sido fornecida. Para isso, primeiro ele obt&eacute;m a ID do departamento do EmployeeServiceEJB que obt&eacute;m o nome do departamento do DepartmentServiceEJB. Vamos examinar como ele pode ser desenvolvido sem implementar os EJBs no container.
</p>
<p><b>Classes</b></p>
<img alt="" src="../../images_www/articles/win-with-netbeans/debug03.gif" width="541" height="451" />
<p><b>Seq&uuml;&ecirc;ncia</b></p>
<img alt="" src="../../images_www/articles/win-with-netbeans/debug04.gif" width="531" height="259" />
</div><br/>
<h2>Dificuldades para depurar no IDE</h2>
<div class='indent'>
<p>A classe EmployeeServiceEJB_Skel (o nome depende do container) ser&aacute; gerada ao implementar no container. Ela ser&aacute; gerada pelo container.</p>
<p>Portanto, no momento da depura&ccedil;&atilde;o este objeto n&atilde;o est&aacute; dispon&iacute;vel, o que torna imposs&iacute;vel depurar o EJB sem implementar.</p>
<p><b>Requisitos</b> </p>
<ul>
	<li>Uma estrutura que deveria permitir que o EJB seja testado dentro do NetBeans e os mesmos objetos deveriam ser implementados no container sem qualquer altera&ccedil;&atilde;o de c&oacute;digo.</li>
	<li>Scripts de teste Junit tamb&eacute;m deveriam testar o c&oacute;digo no IDE e no container sem altera&ccedil;&atilde;o do script.</li>
	<li>Enquanto o IDE estiver sendo executado, o servidor n&atilde;o precisa ser iniciado, o que economiza espa&ccedil;o de RAM do sistema e, portanto, o desempenho do sistema.</li>
</ul>
<h3 class="tutorial">Dificuldades para depurar no IDE</h3>
<ul>
	<li>As classes geradas no container n&atilde;o est&atilde;o dispon&iacute;veis para a depura&ccedil;&atilde;o.</li>
	<li>O conjunto de conex&otilde;es n&atilde;o est&aacute; dispon&iacute;vel.</li>
</ul>
</div>
<br/>
<h2>Solucionar problema de container gerado usando o Business Interface &amp; ServiceLocator</h2>
<div class='indent'>
<p>Classes geradas no container s&atilde;o para transa&ccedil;&atilde;o, acesso remoto, etc. Do ponto de vista da depura&ccedil;&atilde;o &eacute; a delega&ccedil;&atilde;o da chamada da interface remota para a classe Bean.</p>
<p>Ao depurar no IDE, &eacute; necess&aacute;ria uma solu&ccedil;&atilde;o para evitar chamadas para Objetos Esqueleto, j&aacute; que estes n&atilde;o s&atilde;o gerados no momento da depura&ccedil;&atilde;o.</p>
<h3 class="tutorial">Interface Administrativa</h3>
<p>Usando a interface administrativa, o m&eacute;todo Bean pode ser executado sem chamar classes geradas no container. No entanto, a implementa&ccedil;&atilde;o, o m&eacute;todo Bean deveria ser chamado atrav&eacute;s destas classes geradas no container. Isso &eacute; obtido atrav&eacute;s do localizador de servi&ccedil;os.</p>
<p><b>Classes</b></p>
<img alt="" src="../../images_www/articles/win-with-netbeans/debug05.gif" width="531" height="440" />
<h3 class="tutorial">Sequ&ecirc;ncia ao depurar</h3>
<p> Amostra de c&oacute;digo. [Verifique a hierarquia de heran&ccedil;a no diagrama de classe].<br/>
<pre class="examplecode">
EmployeeBusinessService getEmployeeBusinessService() {
	EmployeeBusinessService service = new EmployeeServiceEJB();
	return service;
}
</pre>
<img alt="" src="../../images_www/articles/win-with-netbeans/debug06.gif" width="437" height="227" />
</p>

<h3 class="tutorial">Sequ&ecirc;ncia ap&oacute;s a implementa&ccedil;&atilde;o</h3>
<p>Amostra de c&oacute;digo. [Verifique a hierarquia de heran&ccedil;a no diagrama de classe].
<pre class="examplecode">
EmployeeBusinessService getEmployeeBusinessService() {
     Context context = getContext(&quot;emp&quot;);        
     EmployeeServiceHome home = null;
     Object homeObject = context.lookup(&quot;emp/ejb/EmployeeServicess&quot;);
     home = (EmployeeServiceHome)PortableRemoteObject.narrow(homeObject,  EmployeeServiceHome.class);
                EmployeeService empService = home.create();
                return empService;
}
</pre>
<img alt="" src="../../images_www/articles/win-with-netbeans/debug07.gif" width="538" height="352" />
</p>
<h3 class="tutorial">Localizador de servi&ccedil;os</h3>
<ul>
<li>Dois caminhos diferentes s&atilde;o necess&aacute;rios ao desenvolver e implementar.</li>
<li>No caso do desenvolvimento, a BusinessInterface &eacute; atribu&iacute;da com o BeanInstance.</li>
<li>Caso seja implementado no servidor, a BusinessInterface &eacute; atribu&iacute;da com o RemoteInstance</li>
</ul>
<p>O localizador de servi&ccedil;os toma esta decis&atilde;o com base na vari&aacute;vel de ambiente. Esta vari&aacute;vel de ambiente &eacute; configurada no servidor ou no IDE. Um m&eacute;todo completo de localizador de servi&ccedil;o:
<pre class="examplecode">
public EmployeeBusinessService getEmployeeService() throws BaseException {
        
        if( isServerDeployment() ){
            try {                
                Context context = getContext(&quot;emp&quot;);        
                EmployeeServiceHome home = null;
                Object homeObject = context.lookup(&quot;emp/ejb/EmployeeServices&quot;);
        home =EmployeeServiceHome)PortableRemoteObject.narrow(homeObject,  EmployeeServiceHome.class);
                EmployeeService empService = home.create();
  	//INSTANCE OF EMPLOYEE BEAN REMOTE INSTANCE
                return empService;
            }catch(Exception e) {
                e.printStackTrace();
                throw new BaseException(e.getMessage());
            }
        }else{
	//INSTANCE OF EMPLOYEE BEAN
            return new EmployeeServiceBean();
        }
    }


 protected boolean isServerDeployment() { 
String DEPLOYMENT_TYPE  = System.getProperty(&quot;deployment.type&quot;);         return (&quot;Server&quot;.equalsIgnoreCase(DEPLOYMENT_TYPE))?true:false;
    }

  protected Context getContext(String appName) throws Exception  {
        Hashtable env = new Hashtable();  
        env.put(Context.INITIAL_CONTEXT_FACTORY, INITIAL_CONTEXT_FACTORY);
        env.put(Context.SECURITY_PRINCIPAL, SECURITY_PRINCIPAL);
        env.put(Context.SECURITY_CREDENTIALS, SECURITY_CREDENTIALS);
        env.put(Context.PROVIDER_URL, BASE_PROVIDER_URL+appName);
        System.out.println(&quot;Connecting to Base URL&quot;+ BASE_PROVIDER_URL+appName);
        return  new InitialContext(env);
    }
</pre>

</p>
<p>
O tipo de desenvolvimento de vari&aacute;vel de ambiente pode ser definido usando a op&ccedil;&atilde;o <tt>-d</tt>. No servidor inicie um script <tt>-ddeployment.type=server</tt> In ide java parameter <tt>-ddeployment.type=ide</tt></p>
</div>
<br/>

<h2>Disponibilidade do conjunto de conex&otilde;es</h2>
<div class="indent">
<p>Como conjunto de conex&otilde;es n&atilde;o est&aacute; dispon&iacute;vel no ambiente IDE, &eacute; necess&aacute;ria uma conex&atilde;o direta no momento da depura&ccedil;&atilde;o.</p>
<p>Se o c&oacute;digo for executado no servidor jvn, &eacute; irpa pegar a conex&atilde;o amostrada, caso contr&aacute;rio uma conex&atilde;o direta &eacute; criada.
<pre class="examplecode">
protected Connection getConnection() throws  SQLException {
        
        Connection con = null;
        
        try {
            if( isServerDeployment() ) {
                con = getPooledConnection();
            }else {
                con = getDirectConnection();
            }
            
        }catch(SQLException sqle) {
            throw sqle;
 }catch (Exception e){
            e.printStackTrace();
        }
        return con;
    }
</pre>
<h3 class="tutorial">Teste de unidade</h3>
<p>Um EJB pode ser testado com unidade usando os scripts de teste JUNIT.
<pre class="examplecode">public void testGetEmpName() throws Exception {
        EmployeeBusinessService business = EmployeeServiceLocator.getInstance().getEmployeeService();
        String name= business.getEmpName(&quot;1234&quot;);
        assertEquals(name,&quot;abcd&quot;);
    }</pre>
</p>
<p>
Se este script estiver sendo executado usando <tt>deployment.type=ide</tt>, ele ser&aacute; executado dentro do IDE, caso contr&aacute;rio le vai chamar o m&eacute;todo no container, ou seja, o mesmo script pode ser usado para testar ao desenvolver e ap&oacute;s a implementa&ccedil;&atilde;o. Para este jndi, as propriedades deveriam ser corretamente definidas.
</p>
<h3 class="tutorial">Log4j</h3>
<p>Se log4j for usado para login, ele precisa ser inicializado com <tt>log4j.properties</tt>.A mostra de c&oacute;digo a seguir faz isso:</p>
<pre class="examplecode">org.apache.log4j.PropertyConfigurator.configure(&quot;{server.dir}/log4j.properties&quot;);</pre>
</div><br/>
<h2>Capturas de tela</h2><br/>
<div class="indent">
<h3 class="tutorial">Definindo a vari&aacute;vel de ambiente</h3>
<p>
<img alt="" src="../../images_www/articles/win-with-netbeans/debug08_1.gif" width="546" height="372" />
</p>
<p><img alt="" src="../../images_www/articles/win-with-netbeans/debug08_2.gif" width="546" height="372" /></p>
<h3 class="tutorial">Depurando no IDE</h3>
<p>
<img alt="" src="../../images_www/articles/win-with-netbeans/debug09.gif" width="568" height="444" />
</p>
<h3 class="tutorial">Depurando o EJB implementado no container</h3>
<p>Isso &eacute; obtido ao alterar o <tt>deployment.type=server</tt></p>
<p>
<img alt="" src="../../images_www/articles/win-with-netbeans/debug10.gif" width="553" height="436" /> 
</p>
</div>
</body>
</html>
