<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head><meta http-equiv="content-type" content="text/html; charset=UTF-8">
<META NAME="AUDIENCE" CONTENT="NBUSER">
<META NAME="TYPE" CONTENT="ARTICLE">
<META NAME="TOPIC" CONTENT="BASIC">
<META NAME="description" CONTENT="How to open any document type from NetBeans">
<title>Como abrir qualquer tipo de documento a partir do NetBeans</title></head>
<link rel="stylesheet" type="text/css" href="../../netbeans.css">
<body>
<h1>Boa dica: Como abrir qualquer tipo de documento a partir do NetBeans</h1>
<div class="articledate" style="margin-left:0px;">Contribui&ccedil;&atilde;o de Vicente Brabant como parte da competi&ccedil;&atilde;o <a href="../../competition/win-with-netbeans.html">Win With NetBeans</a></div></p><p>
Como posso pedir ao NetBeans para abrir um documento .doc no MS Word, um documento .XLS no Excel, um documento .PPT no Powerpoint, ...<br>
Como posso pedir ao NetBeans para abrir o aplicativo certo quando clico em um .LNK (aparece com frequ&ecirc;ncia em sua &aacute;rea de trabalho)</p>

De fato, n&atilde;o &eacute; t&atilde;o dif&iacute;cil.<br>
<br>
Como voc&ecirc; sabe, a partir do NetBeans, &eacute; poss&iacute;vel abrir arquivos PDF.<br>
<br>
Na primeira vez que clicamos em um arquivo PDF, o NetBeans ir&aacute; nos mostrar a seguinte caixa de di&aacute;logo:<br>

<br>
<img src="../../images_www/articles/win-with-netbeans/PDF-Viewer-Not-Found.png" title="" alt="Caixa de di&aacute;logo: Visualizador PDF n&atilde;o encontrado" style="width: 720px; height: 159px;"><br>
<br>
Voc&ecirc; tem que selecionar um execut&aacute;vel. Logicamente n&oacute;s estamos selecionado o Acrobat Reader, entre qualquer outro visuaizador PDF dispon&iacute;vel no mercado.<br>
Mas de fato, voc&ecirc; pode selecionar qualquer execut&aacute;vel que desejar.<br>
<br>
E, aqui est&aacute; realmente a dica.<br>
<br>
Sob o Windows 95, 98 e ME, ele existe, sob o diret&oacute;rio de comandos, um execut&aacute;vel denominado Start.exe.<br>
Aquele execut&aacute;vel pode receber um arquivo como argumento. Qualquer tipo de arquivo. E, ele iria procurar qual aplicativo est&aacute; associado com aquela extens&atilde;o de arquivo e iniciaria aqule aplicativo.<br>
<br>
<br>

Portanto, como podemos faz&ecirc;-lo.<br>
<br>
Clique em Selecionar e siga para seu diret&oacute;rio do Windows, a seguir, selecione o diret&oacute;rio de comandos e procure por start.exe.<br>
<br>
<img src="../../images_www/articles/win-with-netbeans/Select-start-exe.png" title="" alt="escolha o arquivo Start.exe" style="width: 610px; height: 278px;"><br>
<br>
Selecione-o e clique em Selecionar. O visualizador atual n&atilde;o &eacute; mais o acroread, mas o nome abosulto do start.exe.<br>
<br>
<img src="../../images_www/articles/win-with-netbeans/current-viewer.png" title="" alt="o visualizador pdf atual &eacute; o arquivo start.exe" style="width: 720px; height: 159px;"><br>
<br>
Agora, o Acobat Reader est&aacute; bem iniciado e ir&aacute; exibir o arquivo pdf que selecionei.<br>
Como isso &eacute; poss&iacute;vel? Como o start.exe recebeu como par&acirc;metro o nome do arquivo PDF ele procurou qual aplicativo est&aacute; associado com aquela extens&atilde;o.<br>

Como associei PDF com o Acorbat Reader em meu PC, o sistema abre o Acrobat Reader.<br>
<br>
O problema &eacute; que o start.exe somente existe no Windows 95, 98 e ME. Ele n&atilde;o existe sob o Windows NT, 2000 ou XP.<br>
Mas o comando start &eacute; bem conhecido neses sistemas. Mas implementado como uma extens&atilde;o do processador de comando.<br>
Portanto, para resolver o problema temos que fazer o seguinte:<br>
1. cria&ccedil;&atilde;o de um arquivo .BAT no C:\<br>
Aquele arquivo BAT ser&aacute; denominado nbLauncher.bat.<br>
Aquele arquivo BAT conter&aacute; o seguinte:<br>
<font face="Courier New, Courier, mono">start %1<br>

2. selecione aquele arquivo BAT como o visualizador atual.<br>
</font><br>
<br>
<br>
Mas como posso abrir outros arquivos, como .DOC, .XLS, EXE, ou at&eacute; arquivos .LNK?<br>
<br>
No menu principal, selecione Ferramentas | Op&ccedil;&otilde;es.<br>
Aparece o painel Op&ccedil;&otilde;es.<br>
Extender a configura&ccedil;&atilde;o IDE | Sistema | Tipos de objetos&nbsp; e selecione Objetos de documento PDF.<br>
No painel Propriedades, clique em Extens&atilde;o e Tipos MIME...<br>

<img src="../../images_www/articles/win-with-netbeans/PDF-Properties-Panel.png" title="" alt="Painel Propriedades PDF" style="width: 858px; height: 533px;"><br>
<br>
Por padr&atilde;o, somente o PDF parece na lista de itens, mas sinta-se a vontade para adicionar quaisquer extens&otilde;es que deseja iniciar a partir do NetBeans.<br>
Por exemplo, adicionei os sufixos doc, xls, lnk e exe.<br>
<br>
<img src="https://netbeans.org/images_www/articles/win-with-netbeans/Extensions-and-mime-types.png" title="" alt="Extens&otilde;es e tipos mime" style="width: 415px; height: 301px;"><br>
quando terminar clique em OK.<br>
<br>
e a seguir clique em Fechar.<br>
<br>
Agora, adicione um diret&oacute;rio que cont&eacute;m alguns documentos ou execut&aacute;veis na janela Favoritos. Adicione tamb&eacute;m sua &aacute;rea de trabalho na janela Favoritos.<br>
Agora, &eacute; poss&iacute;vel clicar em cada arquivo .LNK, e o aplicativo correspondente ser&aacute; iniciado.<br>

Clique em um arquivo .DOC e ver&aacute; que seu documento aparece no MS Word.<br>
<br>
Muito simples e dicas verdadeiramente &uacute;teis.<br>
<br>
Aprecie estas dicas.<br>

<br>
<br>
</body></html>

