<html>
<head>
<title>Um cliente MySQL simples no NB</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<META NAME="AUDIENCE" CONTENT="NBUSER">
<META NAME="TYPE" CONTENT="ARTICLE">
<META NAME="TOPIC" CONTENT="ADVANCED">
<META NAME="description" CONTENT="Making a simple MySQL client in NetBeans">
<link rel="stylesheet" type="text/css" href="../../netbeans.css">

</head>

<body >
<h1>Criando um cliente MySQL simples no NetBeans</h1>
<div class="articledate" style="margin-left:0px;">Contribui&ccedil;&atilde;o de Miki Shimizu como parte da competi&ccedil;&atilde;o <a href="../../competition/win-with-netbeans.html">Win With NetBeans</a></div></p>
<p></p>
<p>O NetBeans tem uma boa interface para se conectar so DB, mas muitos comandos SQL t&ecirc;m de ser inseridos como uma frase inteira. Eu criei um aplicativo Swing para inserir e visualizar dados em um tabela do banco de dados MySQL. A amostra &eacute; bem simples, dispon&iacute;vel para uma tabela espec&iacute;fica e sem uma opera&ccedil;&atilde;o de atualiza&ccedil;&atilde;o ou exclus&atilde;o. Ele seria estendido, mas o documento seria mais longo e complidado, imagino Eu.</p>

<h2>&Iacute;NDICE</h2>
<ul>
  <li><a href="#db01">Conectando oa banco de dados MySQL</a></li>

  <li><a href="#db02">Criando uma tabela de amostra</a></li>
  <li><a href="#db03">Inserir os primeiros dados </a></li>
  <li><a href="#db04">Criando um novo projeto Java</a></li>
  <li><a href="#db05">Criando uma classe utilit&aacute;ria para conectar ao banco de dados</a></li>
  <li><a href="#db06">Criando um modelo de tabela</a></li>
  <li><a href="#db07">Criando a classe JFrame Form -o Form design</a></li>

  <li><a href="#db08">Personalizando a JTable</a></li>
  <li><a href="#db09">Primeira execu&ccedil;&atilde;o do InsertTable</a></li>
  <li><a href="#db10">Tomando um pouco de cuidado...</a></li>
  <li><a href="#db11">Inserindo dados no MySQL</a></li>
</ul>

<h2><a name="db01">Conectando oa banco de dados MySQL</a></h2>
<p>Espero que os leitores j&aacute; tenham um ambiente de servidor de banco de dados of MySQL em funcionamento, tendo um banco de dados com suficiente concess&atilde;o para um determinado usu&aacute;rio. Nesta amostra,</p>

<p><b>database name: nonidb<br>
  user: noniko<br>
  password: (blank) </b>&lt;- por ser apenas uma amostra. Caso tenha dados importantes, defina uma senha apropriada!</p>
<p>Tamb&eacute;m, voc&ecirc; iria obter um arquivo de driver JDBC para o MySQL. Preparei o arquivo <b>mysql-connector-java-3.1.6-bin.jar</b> atrav&eacute;s do <a href="http://dev.mysql.com">site da Web de desenvolvedor do MySQL</a>.</p>
<p>Agora, vamos para o NetBeans. Clique na aba &quot;Execut&aacute;vel&quot; para trocar de janela para a qual normalmente voc&ecirc; pode ver a janela &quot;Projetos&quot; ou &quot;Arquivos&quot;.</p>

<p><img src="../../images_www/articles/win-with-netbeans/adddriver.png" width="357" height="205"></p>
<p><b>Selecione &quot;Adicionar driver&quot; na janel&ccedil;a Execut&aacute;vel</b></p>
<p>Voc&ecirc; ir&aacute; encontrar aqui o n&oacute; &quot;Bancos de dados&quot;. Abra este n&oacute; para obter o n&oacute; &quot;Drivers&quot; abaixo do mesmo. Caso voc&ecirc; abra mais para mostrar o conte&uacute;do de &quot;Drivers&quot;, somente ir&aacute; encontrar &quot;JDBC-ODBC&quot;. A primeira coisa a ser feita &aacute; a de adicionar o driver MySQL. Clique com o bot&atilde;o direito do mouse no n&oacute; &quot;Drivers&quot;, para mostrar o menu de contexto e selecione &quot;Adicionar driver&quot;. </p>

<p>A janela de configura&ccedil;&otilde;es &eacute; aberta.</p>
<p><img src="../../images_www/articles/win-with-netbeans/selectdriver.png" width="560" height="343"></p>
<p><b>Encontre a localiza&ccedil;&atilde;o do arquivo de driver JDBC</b>.</p>
<p>Ao clicar no bot&atilde;o &quot;Adicionar&quot;, voc&ecirc; pode procurar pelo arquivo de friver de forma gr&aacute;fica. No caso acima, preparei a pasta D:\nonidata\nb4worksnew, para conter as pastas de projeto e a subpasta lib para conter arquivos de biblioteca.</p>
<p>Caso voc&ecirc; selecione a localiza&ccedil;&atilde;o do arquivo de driver, Classe e nome do driver s&atilde;o automaticamente definidas. No caso do driver MySQL JDBC, o nome da classe antiga &eacute; definido primeiro. Mas, clique no bot&atilde;o &quot;Localizar&quot; e ent&atilde;o a barra de andamento abaixo se torna ativa e finalmente &quot;Conclu&iacute;da a procura por classes de driver&quot; &eacute; mostrada.</p>

<p>A seguir, abra a caixa &quot;Classe de driver&quot; para configura&ccedil;&atilde;o. Voc&ecirc; pode selecionar o nome atual da classe do driver JDBC.</p>
<p><img src="../../images_www/articles/win-with-netbeans/newdrivername.png" width="355" height="109"></p>
<p><b>Altere o nome da cvlasse para o da vers&atilde;o atual.</b></p>
<p>Clique em &quot;OK&quot; e o novo driver ser&aacute; adicionado sob o n&oacute; &quot;Driver&quot;. Clique com o bot&atilde;o direito do mouse no mesmo para selecionar &quot;Conectar usando...&quot; no menu de contexto.</p>

<p><img src="../../images_www/articles/win-with-netbeans/connectusing.png" width="302" height="71"> </p>
<p><b>Selecione &quot;Conectar usando...&quot; no menu de contexto</b></p>
<p>A janela de configura&ccedil;&otilde;es &eacute; aberta. Aqui o URL, Nome de usu&aacute;rio e Senha do Banco de Dados s&atilde;o necess&aacute;rios (neste caso a senha est&aacute; em branco). Clique em OK e ver&aacute; a mensagem &quot;Conex&atilde;o estabelecida&quot; na barra de andamento abaixo. A p&aacute;gina poder&aacute; ser trocada para &quot;Avan&ccedil;ado&quot;, mas neste caso n&atilde;o h&aacute; nenhuma configura&ccedil;&atilde;o avan&ccedil;ada necess&aacute;ria.</p>
<p><img src="../../images_www/articles/win-with-netbeans/conestablished.png" width="419" height="266"></p>
<p>Ap&oacute;s a conex&atilde;o ter sido estabelecida, aparece um n&oacute; para esta conex&atilde;o. Vamos proseguir para a pr&oacute;xima etapa.</p>


<h2><a name="db01"></a>Criando uma tabela de amostra</h2>
Clique com o bot&atilde;o direito do mouse no n&oacute; para a conex&atilde;o acima estabelecida e selecione &quot;Criar tabela...&quot;. 
<p><img src="../../images_www/articles/win-with-netbeans/createtable.png" width="335" height="132"></p>
<p><b>Selecione &quot;Criar tabela&quot; no menu de contexto</b>.</p>
<p>Aparece uma janela para definir a atabela a ser criada. Para exibir a connfigura&ccedil;&atilde;o necess&aacute;ria, esta janela precisa ser expandida manualmente. As configura&ccedil;&otilde;es importantes s&atilde;o Chave, Nome da coluna, Tipo e tamanho de dados, dependendo to tipo de dados.</p>
<p><img src="../../images_www/articles/win-with-netbeans/cartable.png" width="740" height="281"></p>
<p><b>Criando uma tabela no NetBeans</b></p>

<p>Neste caso, criei uma tabela simples &quot;<b>cars</b>&quot; tendo <b>carid</b>, <b>name</b>, <b>vendor</b> and <b>type</b> como campos. O campo Carid &eacute; a chave principal. Todos os campos t&ecirc;m um tipo de dados de VARCHAR. Somente Carid tem 10 para o tamanho e todos os outrso t&ecirc;m 20.</p>
<p>Ap&oacute;s criar a tabela, voc&ecirc; ver&aacute; seu n&oacute; sob o n&oacute; da conex&atilde;o. A estrutura da tabela &quot;cars&quot; &eacute;w exibida.</p>

<p><img src="../../images_www/articles/win-with-netbeans/cartablestruct.png" width="353" height="236"></p>
<p><b>A &aacute;rvore do n&oacute; da tabela criada</b></p>

<h2><a name="db03"></a>Inserir os primeiros dados </h2>
<p>Agora vamos inserir a primeira linha ao enviar um comando SQL. Clique com o bot&atilde;o difreito do mouse em qualquer n&oacute; sob o n&oacute; da conex&atilde;o para exibir o item de menu &quot;Executar comandos..&quot;.</p>
<p><img src="../../images_www/articles/win-with-netbeans/execommand.png" width="309" height="116"></p>
<p>Aparece ent&atilde;o a janela grande de comandos de opera&ccedil;&atilde;o no mesmo lugar do editor de c&oacute;digo-fonte. Muito grande, portanto, n&atilde;o vou mostrar a captura de tela de toda a apar&ecirc;ncia. As partes importantes s&atilde;o, em primeiro lugar, a &aacute;rea de texto para inserir o comando.</p>
<p><img src="../../images_www/articles/win-with-netbeans/firstcmd.png" width="463" height="67"></p>
<p><b>Insira a frase inteira do comando</b>.</p>
<p>Clique no bot&atilde;o &quot;Executar&quot; e, se o comando for v&aacute;lido, voc&ecirc; poder&aacute; ver a mensagem &quot;Comando executado com &ecirc;xito&quot; abaixo. Para estar seguro, clqiue com o bot&atilde;o direito do mouse no n&oacute; &quot;cars&quot; e selecionar &quot;Visualizar dados&quot;.</p>

<p><img src="../../images_www/articles/win-with-netbeans/viewdata.png" width="264" height="153"></p>
<p><b>Clique com o bot&atilde;o direito do mouse no n&oacute; &quot;cars&quot; para visualizar os dados</b>.</p>
<p><img src="../../images_www/articles/win-with-netbeans/firstviewdata.png" width="308" height="78"></p>
<p><b>Primeiros dados inseridos</b></p>
<p>Legal! Os primeiros dados foram inseridos com &ecirc;xito. Mas voc&ecirc; pode considerar que a frase inteira &quot;Inserir em...&quot; como uma que incomoda. Eu considerei. Portanto, tomei a decis&atilde;o de desenvolver um aplicativo para inserir dados atrav&eacute;s de uma opera&ccedil;&atilde;o mais gr&aacute;fica.</p>

<h2><a name="db04"></a>Criando um novo projeto Java</h2>

<p>Vamos criar um novo projeto Java para o aplicativo. Selecione na barra de menus &quot;Arquivo&quot;-&gt;&quot;Novo projeto&quot;. No assistente Novo projeto, selecione &quot;Geral&quot; -&gt; &quot;Aplicativo Java&quot; como o tipo de projeto. No meu caso o nome do projeto &eacute; &quot;mysqloperation&quot; e a localiza&ccedil;&atilde;o &eacute; &quot;d:\nonidata\nb4worksnew\mysqloperation&quot;. Marque &quot;Criar projeto principal&quot;.</p>

<p>Ap&oacute;s criar o projeto, crie um novo pacote. No meu caso, &quot;mysqlop&quot;.</p>

<h2><a name="db05"></a>Criando uma classe utilit&aacute;ria para conectar ao banco de dados</h2>
<p>A opera&ccedil;&atilde;o de banco de dados no Java &eacute; muito complicada, requerendo a conex&atilde;o, declara&ccedil;&atilde;o, resultset e muitos try&amp;catch. Portanto, usei uma classe utilit&aacute;ria com tais opera&ccedil;&otilde;es.</p>
<p>Todo o c&oacute;digo &eacute; aqui mostrado, <a href="https://netbeans.org/files/documents/4/297/MyDBConnection.java" target="_blank">MyDBConnection.java.</a></p>
<p><b>init()</b> m&eacute;todo para conectar ao banco de dados MySQL.</p>

<p><b>getConnection()</b> m&eacute;todo a ser chamado ap&oacute;s o m&eacute;todo init(), para conceder o acesso &agrave; outra classe que estabeleceu a conex&atilde;o.</p>
<p>dois m&eacute;todos <b>close() </b> e <b>destroy()</b> s&atilde;o para configurar o fim da opera&ccedil;&atilde;o. Fechando a conex&atilde;o, declara&ccedil;&atilde;o ou resultset requer try&amp;catch, portanto, eles forma extra&iacute;dos aqui.</p>
<p>Para usar este arquivo, a classpath para o driver JDBC pfrecisa ser definda para este projeto. Clique com o bot&atilde;o direito do mouse no projeto &quot;<b>mysqloperation</b>&quot;, e selecione &quot;Propriedades...&quot; no menu de contexto. Na janela &quot;Propriedades do projeto&quot;, selecione &quot;Build&quot;-&gt;&quot;Compilinado o c&oacute;digo-fontwe&quot;. Clique no bot&atilde;o &quot;Adicionar pasta JAR&quot; junto a configura&ccedil;&atilde;o &quot;&quot;Classpath para compliar o c&oacute;digo-fonte&quot;, para que voc&ecirc; posssa procurar pela localiza&ccedil;&atilde;o do arquivo JDBC jar.</p>

<p><img src="../../images_www/articles/win-with-netbeans/addlibrary.png" width="745" height="249"></p>
<p><b>Adicionando o arquivo JDBC jar para a classpath</b></p>

<h2><a name="db06"></a>Criando um modelo de tabela</h2>
<p>Ent&atilde;o preparei um Modelo de tabela personalizada para a JTable a ser usada neste aplicativo.</p>
<p>Todo o c&oacute;digo &eacute; aqui mostrado, <a href="https://netbeans.org/files/documents/4/298/CarTableModel.java" target="_blank">CarTableModel.java</a>.</p>
<p>Para escrever este c&oacute;digo usei alguma boas ferramentas do NetBeans. <br>
  Primeiro, crie um novo arquivo de Classe Java denominado CarTableModel.java. &Eacute; um modelo simples e vazio, apenas com a declara&ccedil;&atilde;o de pacote e classe. </p>

<p><br>
  Edite manualmente a declara&ccedil;&atilde;o de classe para estender a classe &quot;AbstractTableModel&quot;. O editor em breve ir&aacute; mostrar o sublinhado vermelho e ondulado para mostrar. Uma causa para isso &eacute; a falta da importa&ccedil;&atilde;o da classe &quot;javax.swing.table.AbstractTableModel&quot;. Esse erro &eacute; corrigido ao clicar com o bot&atilde;o direito do mouse em algum ligar do c&oacute;digo e seleciona &quot;Corrigir importa&ccedil;&otilde;es&quot;</p>
<p><img src="../../images_www/articles/win-with-netbeans/fiximports.png" width="483" height="139"></p>
<p><b>Use a ferramenta &quot;Corrigir importa&ccedil;&otilde;es&quot;</b>.</p>

<p>Voc&ecirc; pode verificar se a declara&ccedil;&atilde;o.</p>
<p><b>import javax.swing.table.AbstractTableModel;</b></p>
<p>foi inserida junto ao topo do c&oacute;digo-fonte.</p>
<p>Mas o sublinhado vermelho ainda permanece. A causa remanescente &eacute; falta de implementa&ccedil;&atilde;o dos m&eacute;todos abstratos apropriados.<br>
  Isso &eacute; corrigido pela ferramenta &quot;sobrescrevendo o m&eacute;todo&quot; chamada desta forma...</p>
<p><img src="../../images_www/articles/win-with-netbeans/toolovmethods.png" width="455" height="267"></p>
<p><b>Use a ferramenta &quot;Sobrescrever m&eacute;todos&quot;</b>.</p>

<p>As implementa&ccedil;&otilde;es necess&aacute;ris s&atilde;o extra&iacute;das selecionando &quot;Mostrar somente m&eacute;todos abstratos&quot;. </p>
<p><img src="../../images_www/articles/win-with-netbeans/overridelist.png" width="484" height="197"></p>
<p><b>As implementa&ccedil;&otilde;es necess&aacute;rias s&atilde;o listadas</b>.</p>
<p>Selecione todos os tr&ecirc;s m&eacute;todos ao clicar no n&oacute; e em &quot;OK&quot;.</p>
<p><img src="../../images_www/articles/win-with-netbeans/methodimplemented.png" width="436" height="421"></p>
<p><b>As implementa&ccedil;&otilde;es necess&aacute;rias s&atilde;o inseridas automaticamente</b>.</p>
<p>Agora a linha vermelha desapareceu! </p>
<p>De fato, n&oacute;s tamb&eacute;m precisamos sobrescrever o m&eacute;todo <b>getColumnName</b>(int param), caso contr&aacute;rio n&oacute;s n&atilde;o iremos obter cabe&ccedil;alhos personalizados para a tabela.</p>

<p>Vamos preencher o conte&uacute;do.<br>
  O c&oacute;digo &eacute; especificado para acessar a tabela &quot;cars&quot; espec&iacute;fica, portanto, o n&uacute;mero de colunas &eacute; fixado em 4. <br>
  Cada nome de coluna tamb&eacute;m &eacute; conhecido e pode ser definido diretamente.</p>
<p>Desta vez usei Generics, um novo recurso do JDK 5.0, pela primeira vez. Funcionou com &ecirc;xito no NB (Aplausos!)<br>
</p>

<h2><a name="db07"></a>Criando a classe JFrame Form -o Form design</h2>
<p>Vamos agora criar o aplicativo JFrame Form, a classe principal deste projeto! &quot;JFrame Form&quot; pode ser selecionado no novo assistente. No meu caso o nome &eacute; &quot;InsertTable&quot;, que criou um arquivo de c&oacute;digo-fonte, &quot;InsertTable.java&quot;.</p>

<p>Primeiro, desenhe o formul&aacute;rio. Ela deveria ser uma janela longa na vertical, portanto, corrigi o tamanho do formul&aacute;rio ao inves de usar &quot;packing&quot;.<br>
  Selecione o n&oacute; &quot;JFrame&quot; na janerla Inspetor para mostrar suas propriedades. Altere a &quot;Pol&iacute;tica de tamanho de formul&aacute;rio&quot; do padr&atilde;o &quot;Generate pack()&quot; para&quot;Generate Resize Code&quot;.</p>

<p><img src="../../images_www/articles/win-with-netbeans/resizeform.png" width="275" height="282"></p>
<p><b>Para corrigir o tamanho do formul&aacute;rio</b>.</p>
<p>A propriedade &quot;Tamanho do formul&aacute;rio&quot; se torna edit&aacute;vel. Edite-a como:</p>
<p><img src="../../images_www/articles/win-with-netbeans/resized.png" width="182" height="19"></p>
<p><b>O tamanho do formul&aacute;rio editado</b>.</p>
<p>Este formul&aacute;rio ser&aacute; separado verticalmente em tr&ecirc;s partes:</p>
<p>(1)JTextfields ou JComboBox para inserir os novos dados.<br>
  (2)JButton para enviar dados e mostrar a mensagem.<br>

  (3)A JTable.</p>
<p>As primeiras duas deveriam estar localizadas em cada JPanel e a JTable em um JScrollPane. Estas s&atilde;o as partes b&aacute;sicas.</p>
<p><img src="../../images_www/articles/win-with-netbeans/panelspanes.png" width="276" height="193"></p>
<p><b>JPanels e JScrollPane para localizar componentes</b>.</p>
<p>Observe que as posi&ccedil;&otilde;es verticais dos n&oacute;s n&atilde;o significa sua localiza&ccedil;&atilde;o real. Quero dizer, o dataPanel, sendPanel e tablePane est&atilde;o localizados para o Norte, Centro ou Sul do BorderLayout, respectivamente.</p>
<p>No dataPanel, 3JTextFields e uma JComboBox para inserir dados e 4JLabels para explica&ccedil;&otilde;es deveriam ser localizadas. Decidi que GridLayout &eacute; o melhor para definir estas localiza&ccedil;&otilde;es. O layout padr&atilde;o no JPanel &eacute; FlowLayout no NetBeans. Ele precisa ser modificado:</p>
<p><img src="../../images_www/articles/win-with-netbeans/setlayout.png" width="343" height="262"> </p>
<p><b>Altere para GridLayout</b></p>
<p>Ent&atilde;o as propriedades deste GridLayout s&atilde;o exibidas. Defina o n&uacute;mero de coluna para 2 e o n&uacute;mero da linha para 4.</p>

<p><img src="../../images_www/articles/win-with-netbeans/griddata.png" width="190" height="112"></p>
<p>A seguir, localize os componentes. Eles deveriam ser movidos ao arrastar e soltar no formul&aacute;rio, caso voc&ecirc; n&atilde;o esteja satisfeito com a localiza&ccedil;&atilde;o.</p>
<p><img src="../../images_www/articles/win-with-netbeans/griddragdrop.png" width="412" height="97"></p>
<p><b>Movendo a JComboBox dentro do GridLayout.</b></p>
<p>O componente pode escapar para uma possi&ccedil;&atilde;o bem incorreta, tal como para outro painel. N&atilde;o se preocupe, voc&ecirc; tamb&eacute;m pode mover sua localiza&ccedil;&atilde;o ao arrastar e soltar dentro da janela Inspetor.</p>
<p><img src="../../images_www/articles/win-with-netbeans/inspectordragdrop.png" width="276" height="226"></p>
<p><b>Moviendo a JComboBox dentro da janela Inspetor</b>.</p>
<p>Ap&oacute;s todos os componentes terem sido definidos, personalize seus nomes para mostrar suas fun&ccedil;&otilde;es.<br>
  Personalize tamb&eacute;m a propriedade de texto para cada JLabel, e apague isso em cada JTextField. Aqui est&aacute; um exemplo de edi&ccedil;&atilde;o da propriedade &quot;texto&quot; do JLabel:</p>

<p><img src="../../images_www/articles/win-with-netbeans/labeltxt.png" width="277" height="130"></p>
<p><b>Personalizar a propriedade &quot;texto&quot; para mostrar a &quot;ID:&quot; como uma JLabel</b></p>
<p>Ent&atilde;o sendPanel para localizar o JButton e a JLabel. Tamb&eacute;m, o GridLayout &eacute; definido para este JPanel, com uma coluna e duas linhas. O nome e a propriedade &quot;texto&quot; s&atilde;o personalizados.</p>
<p><img src="../../images_www/articles/win-with-netbeans/sendpnlcmpns.png" width="203" height="76"></p>
<p>Desta forma, os componentes, a n&atilde;o ser a JTable, s&atilde;o organizados como abaixo:</p>
<p><img src="../../images_www/articles/win-with-netbeans/firstguisetting.png" width="402" height="271"></p>

<p><b>Os componentes sem uma JTable foram personalizados</b>.</p>

<h2><a name="db08"></a>Personalizando a JTable</h2>
<p>Como mostrado acima, neste ponto a JTable tem uma estrutura 4x4 e dados vazios. Vamos personaliz&aacute;-la para mostrar o conte&uacute;do da tabela &quot;cars&quot; do banco de dados MySQL.</p>
<p>Selecione agora a JTable denominda &quot;carTable&quot; na janela Inspetor para mostrar suas propriedades. Encontre a propriedade &quot;model&quot; e clique no bot&atilde;o &quot;...&quot; na borda direita.</p>

<p><img src="../../images_www/articles/win-with-netbeans/tablemodelprop.png" width="275" height="213"></p>
<p><b>carTable e sua propriedade &quot;model&quot;</b></p>
<p>A janela do editor &eacute; aberta. A estrutura 4x4 padr&atilde;o &eacute; definida nesta janela. Vamos modificar &quot;<b>Modo de sele&ccedil;&atilde;o</b>&quot; de &quot;TableModelEditor&quot; para &quot;<b>FormConnection</b>&quot;.</p>
<p><img src="../../images_www/articles/win-with-netbeans/selectformcon.png" width="640" height="260"></p>

<p><b>Trocando do editor de tabela padr&atilde;o para o modo de conex&atilde;o de formul&aacute;rio</b>.</p>
<p>No modo Conex&atilde;o de formul&aacute;rio, clique no bot&atilde;o &quot;C&oacute;digo do usu&aacute;rio&quot; na janela de op&ccedil;&otilde;es. </p>
<p><img src="../../images_www/articles/win-with-netbeans/usercodezero.png" width="639" height="273"></p>
<p><b>Modo Conex&atilde;o de formul&aacute;rio</b></p>
<p>A seguir, examine a parte inferior desta janela. O bot&atilde;o &quot;Avan&ccedil;ado&quot; est&aacute; l&aacute;. Clique no mesmo!</p>
<p><img src="../../images_www/articles/win-with-netbeans/advancedbtn.png" width="115" height="36"></p>

<p><b>Bot&atilde;o &quot;Avan&ccedil;ado&quot; na parte inferior da janela</b>.</p>
<p>Aparece uma janela para editar antes de depois o c&oacute;digo da defini&ccedil;&atilde;o da TableModel para a JTable. Desta vez selecione ambos para editar</p>
<p><img src="../../images_www/articles/win-with-netbeans/advancedcode.png" width="358" height="381"></p>
<p>O m&eacute;todo denominado getResultFromCars deveria ser criado manualmente no c&oacute;digo-fonte da &quot;InsertTable.java&quot;, como:</p>
<pre class='examplecode'><font color="#660000"> public ResultSet getResultFromCars() {
        
        ResultSet rs=null;
        
        try{
            rs=stmt.executeQuery(&quot;Select * from cars&quot;);
        
        }
        catch(SQLException e){}
        
        return rs;
        
    } </font></pre>
<p>Clique em OK para retornar para o &quot;C&oacute;digo do usu&aacute;rio&quot; para preencher.</p>

<p><img src="../../images_www/articles/win-with-netbeans/setusermodel.png" width="263" height="47"></p>
<p>Observe que h&aacute; um ponto e v&iacute;rgula &quot;;&quot; para terminar a fase N&Atilde;O DEVERIA SER inserido. Por qu&ecirc;? Verifique o c&oacute;digo-fonte. Verifique o m&eacute;todo <b>InitComponents()</b>. Aqui!</p>
<p><img src="../../images_www/articles/win-with-netbeans/insertedtobluearea.png" width="289" height="61"></p>
<p>&Aacute;rea azul claro &quot;Protegida&quot; &quot;N&atilde;o edit&aacute;vel&quot;. Quem disse isso? Ha-ha-ha! Voc&ecirc; pode editar livremente por meios preparados pelo NetBeans!</p>


<h2><a name="db09"></a>Primeira execu&ccedil;&atilde;o do InsertTable</h2>
<p>Para efetuar uma priimeira execu&ccedil;&atilde;o de teste desta JTable personalizada, ainda h&aacute; algo a fazer. Primeiro, a declara&ccedil;&atilde;o.</p>
<p> <font color="#660000">private MyDBConnection mdbc;<br>
  private java.sql.Statement stmt;</font></p>
<p>Elas devem ser colocadas em algum lugar do c&oacute;digo-fonte. Perto do EOF, junto outras vari&aacute;veis, seria bom.</p>
<p>A seguir, o construtor. Observe que dever&iacute;amos adicionar a declara&ccedil;&atilde;o de gera&ccedil;&atilde;o junto ao mesmo</p>
<p><img src="../../images_www/articles/win-with-netbeans/exceptionconstruct.png" width="276" height="22"></p>
<p>para evitar aquele aborrecido erro de compila&ccedil;&atilde;o, &quot;java.sql.SQLException is not reported...&quot;.</p>

<p>Todo o conte&uacute;do do construtor &eacute;:</p>
<pre class='examplecode'><font color="#660000"> public InsertTable() throws  Exception{
        
         mdbc=new MyDBConnection();
         mdbc.init();
         Connection conn=mdbc.getMyConnection();
         stmt= conn.createStatement();
        
        initComponents();
    } </font> </pre>
<p>Um mais para evitar o mesmo erro de compila&ccedil;&atilde;o. Edite o m&eacute;todo principal preparado pelo NetBeans: </p>
<p><img src="../../images_www/articles/win-with-netbeans/trycatchinmain.png" width="373" height="197"></p>
<p><b>Adicione try-catch ao m&eacute;todo principal </b></p>
<p>Agora, vamos executar o projeto! Aparece uma janela para selecionar a classe principal. Na lista, voc&ecirc; somente ir&aacute; encontrar &quot;InsertTable.class&quot;. Selecione-a.</p>
<p><img src="../../images_www/articles/win-with-netbeans/tableshown.png" width="399" height="222"></p>
<p><b>A tabledata do MySQL foi mostrada</b></p>

<p>A &uacute;nica linha existente na tabela &quot;cars&quot; do banco de dados MySQL foi exibida!</p>

<h2><a name="db10"></a>Tomando um pouco de cuidado...</h2>
<p>Agora que podemos exibir os dados existentes do MySQL para a JTable, vamos parar e tomar um pouco de cuidado para obter um aplicativo melhor.</p>
<p>Uma coisa &eacute; a termina&ccedil;&atilde;o apropriada deste aplicativo. Todas as sess&otilde;es com MySQL(conex&atilde;o. declara&ccedil;&atilde;o, resultsets) precisam ser fechadas.<br>
  Este aplicativo &eacute; terminado ao fechar a janela. Portanto, dever&iacute;amos adicionar um m&eacute;todo de processamento de evento para o evento WindowClosing. <br>
  Selecione &quot;JFrame&quot; na janela Inspetor para mostrar sua janela de propriedades, e a seguir clique em &quot;Eventos&quot; para trocar de p&aacute;gina. Localize o evento &quot;windowClosing&quot;. Ele est&aacute; definido como &lt;nenhum&gt; por padr&atilde;o, mas quando voc&ecirc; clica na palavra &lt;nenhum&gt;, ela ser&aacute; automaticamente modificada para &quot;formWindowClosing&quot;..., pressione a tecla Enter enquanto esta linha estiver selecionada.</p>

<p><img src="../../images_www/articles/win-with-netbeans/windowclosing.png" width="288" height="332"></p>
<p><b>Definindo o evento windowClosing do JFrame </b></p>
<p>O c&oacute;digo-fonte aparece para ativar a edi&ccedil;&atilde;o do m&eacute;todo.</p>
<p><img src="../../images_www/articles/win-with-netbeans/windowclosingcode.png" width="452" height="93"></p>
<p><b>Edite o m&eacute;todo &quot;formWindowClosing&quot;</b>.</p>
<p>Feche a declara&ccedil;&atilde;o e a conex&atilde;o.</p>
<p>A outra coisa &eacute; definir os itens na JComboBox denominados <b>typeCombo</b>. Sim, eles deveriam estar definidos para selecionar o tipo de dire&ccedil;&atilde;o de um carrro.</p>

<p>Selecione o n&oacute; &quot;typeCombo&quot; na janerla Inspetor para mostrar suas propriedades. Localize a propriedade &quot;<b>model</b>&quot; e clique no bot&atilde;o &quot;...&quot; na borda direita, da mesma forma que fizemos para definir o TableModel para a JTable.<br>
  Aparece uma janela e desta vez n&oacute;s usamos o<b> ComboBoxModelEditor</b> padr&atilde;o.</p>

<p><img src="../../images_www/articles/win-with-netbeans/itemconbo.png" width="454" height="284"></p>
<p>Insira um novo item no campo&quot;Item:&quot; e clique no bot&atilde;o &quot;Adicionar&quot;. Isso &eacute; f&aacute;cil! Preparei o itens &quot;FF&quot;, &quot;FR&quot;, &quot;MR&quot; and&quot;4WD&quot; como o tipo de dire&ccedil;&atilde;o. H&aacute; algo mais?</p>


<h2><a name="db11"></a>Inserindo dados no MySQL</h2>
<p>A parte final! A inser&ccedil;&atilde;o de dados no MySQL deveria ser feito ao clicar no bot&atilde;o &quot;Enviar&quot; (o bot&atilde;o do JButton denominado &quot;<b>sendButton</b>&quot;).</p>
<p>No Editor de IGU do NetBeans, &eacute; muito f&aacute;cil criar o m&eacute;todo de procesamento de evento para o JButton. Basta clicar duas vezes no JButton no formul&aacute;rio.</p>
<p>O m&eacute;todo <b>&quot;sendButtonActionPerformed&quot;</b> <b> </b>&eacute; criado no arquivo de c&oacute;digo-fonte. Vamos preencher seu conte&uacute;do:</p>

<pre class='examplecode'><font color="#660000">private void sendButtonActionPerformed(java.awt.event.ActionEvent evt) {<font color="#006600"> //GEN-FIRST:event_sendButtonActionPerformed
        // TODO add your handling code here:</font>    String carid=idField.getText();
        String name=nameField.getText();        
        String vendor=vendorField.getText();
        String type=(String)typeCombo.getSelectedItem();
        
        String insertStr=&quot;&quot;;
        
        try{
            
            insertStr=&quot;insert into cars (carid, name, vendor, type) values(&quot;<b>quotate</b>(carid)+&quot;,&quot;
                    +quotate(name)+&quot;,&quot;
                    +quotate(vendor)+&quot;,&quot;
                    +quotate(type)
                    +&quot;)&quot;;
            
            int done=stmt.executeUpdate(insertStr);
            
            commentLabel.setText(&quot;1 row inserted&quot;);  <b>etContentPane().removeAll();
            initComponents();</b>  }
        catch(Exception e){
            commentLabel.setText(&quot;Error occurred in inserting data&quot;);
            e.printStackTrace();
        } </font>  <font color="#006600">//GEN-LAST:event_sendButtonActionPerformed</font>
</pre>
<p>Observe que o m&eacute;todo <b>initComponents</b> &eacute; chamado ap&oacute;s a inser&ccedil;&atilde;o dos dados, e ap&oacute;s <b>remover o painel do conte&uacute;do atual</b>. &Eacute; necess&aacute;rio atualizar a apar&ecirc;ncia da JTable...Caso tiv&eacute;ssemos mais conhecimento, poder&iacute;amos atualizar somente a JTable, ao inv&eacute;s de todo o container. Isso &eacute;, como dito em Japon&ecirc;s, &eacute; como &quot;Ceifar o tofu com um machado&quot;. Desculpe!</p>

<p>Observe aqui que o m&eacute;todo <b>quotate</b> &eacute; chamado. Eu o criei para n&atilde;o ter tantas aspas:</p>
<pre class='examplecode'> <font color="#660000">public String quotate(String content){<br>    <br>        return &quot;'&quot;+content+&quot;'&quot;;<br>    }</font>

</pre>
<p>Agora temos todo o c&oacute;digo para o<a href="https://netbeans.org/files/documents/4/299/InsertTable.java"> InsertTable.java</a>. </p>
<p>Execute o projeto! Insira dados e clique no bot&atilde;o &quot;Enviar&quot;. Agora voc&ecirc; pode ver outra linha inserida na JTable. Repita inserindo algumas mais!</p>
<p><img src="../../images_www/articles/win-with-netbeans/appresult.png" width="399" height="263"></p>
<p><b>Operando o aplicativo completado</b></p>
<p>...E vamos assegurar que estes dados tamb&eacute;m ser&atilde;o vis&iacute;veis de um utilit&aacute;rio do NetBeans.</p>
<p><img src="../../images_www/articles/win-with-netbeans/resultconfirmed.png" width="307" height="106"></p>

<p>Trabalho duro! Mas atrav&eacute;s deste projeto, aprendemos:</p>
<ul>
  <li>Como operar um banco de dados a partir de um utilit&aacute;rio do NetBeans.</li>
  <li>Como &quot;editar&quot; os c&oacute;digos &quot;protegidos&quot; na &aacute;rea azul clara.</li>
  <li>Como usar a TableModel &eacute;rsonalizada para a JTable.</li>
</ul>
<p>...e assim por diante.</p>


<p>&nbsp;</p>
</body>
</html>

