<html>
<head>
<title>Apresenta&ccedil;&atilde;o NetBeans 4.0 - Plug-ins</title>
<META NAME="description" CONTENT="Presentation of NetBeans 4.0 - Plugins">
<link rel="stylesheet" type="text/css" href="../../netbeans.css">
<META NAME="EXPIRES" CONTENT="N">
<meta name="author" content=""/>
<meta name="indexed" content="y"/>
<meta name="description" content="Presentation of NetBeans 4.0 - Plugins"/>
</head>
<body>
<h1>Apresenta&ccedil;&atilde;o NetBeans 4.0 - Plug-ins</h1>
<div class="articledate" style="margin-left:0px;">Contribui&ccedil;&atilde;o de Jean-Baptiste Renaux como parte da competi&ccedil;&atilde;o <a href="../../competition/win-with-netbeans.html">Win With NetBeans</a></div></p>

<p>Este artigo faz parte de uma s&eacute;rie de tr&ecirc;s artigos:</p>
<ul>
<li><a href="presenting-netbeans40-1.html">Apresenta&ccedil;&atilde;o geral</a></li>
<li><a href="presenting-netbeans40-2.html">Praticando com o NetBeans</a></li>
<li>Plug-ins (p&aacute;gina atual)</li>
</ul>

<h2>Praticando com o NetBeans</h2>
<p><b>Resumo</b></p>
<ul>
  <li><a href="#j2me">J2ME</a></li>
  <li><a href="#j2ee">J2EE com o Sun Application Server</a></li>
  <li><a href="#profiler">Perfilador</a></li>
<li><a href="#misc">Diversos</a></li>
<li><a href="#advantage">Vantagens e desvantagens</a></li>
<li><a href="#conclusion">Conclus&atilde;o</a></li>
</ul>

<h2><a name="j2me"></a>J2ME</h2>
<div class="indent">
<p>Os aplicativos Java podem funcionar em celulares, televis&otilde;es interativas e s&atilde;o um eldorado para o Java. A Sun fornece um kit de desenvolvimento para o J2ME. Este &eacute; integrado no NetBeans, ao instalar o kit de mobilidade.
<p>Voc&ecirc; o obt&eacute;m neste endere&ccedil;o da Web: <a href="https://netbeans.org/kb/trails/mobility.html">https://netbeans.org/kb/trails/mobility.html</a>
<p>Ent&atilde;o, receber&aacute; os modelos, bibliotecas e emuladores J2ME:</p>

<p><a href="../../images_www/articles/win-with-netbeans/j2me.jpg"><img src="../../images_www/articles/win-with-netbeans/j2me.jpg" alt="clique para obter o tamanho completo" width="600" height="394" class="align-center" alt="" vspace="5" hspace="50" class="b-none"></a></p>
<p><img src="../../images_www/articles/win-with-netbeans/mobile.jpg" class="align-center" alt="" vspace="5" hspace="50"></p>

<h3 class="tutorial">Criar uma aplicativo J2ME</h3>

<p>Vamos usar um projeto modelo para explorar as diferentes funcionalidade do plug-in de mobilidade:</p>
<p>Selecione Arquivo &gt; Novo projeto (Ctrl-Shift-N). 
<br>Escolha a subcategoria &quot;M&oacute;vel&quot; -&gt; &quot;Aplicativo m&oacute;vel&quot;.
<br>Clique em Pr&oacute;ximo e nomeie o projeto como &quot;MyJ2ME&quot;.
<br>Ao deixar todas as escolha de par&ecirc;metros como padr&atilde;o, clique em &quot;Terminar&quot;.

<p>Voc&ecirc; ver&aacute; que o NetBeans usou uma classe de modelo com estes elementos:</p>
<ul><li>o m&eacute;todo startApp()
<li>o m&eacute;todo pauseApp()
<li>o m&eacute;todo destroyApp()
<li>o m&eacute;todo commandAction(Command c, Displayable s)
<li>a classe estende a classe MIDlet e implementa a interface CommandListener.</li></ul>

<p>Voc&ecirc; pode executar o projeto que ser&aacute; iniciado em um emulador de telefone celular.</p>

<h3 class="tutorial">Configura&ccedil;&otilde;es de projeto</h3>

<p>N&oacute;s podemos criar diferentes configura&ccedil;&otilde;es, nos permitindo usar nosso projeto em diferentes contextos.
<ul><li>Selecione o projeto na aba Projeto, clique com o bot&atilde;o direito do mouse e selecione &quot;Propriedades&quot;. </li></ul>

<p><a href="../../images_www/articles/win-with-netbeans/hellowj2me.jpg"><img src="../../images_www/articles/win-with-netbeans/hellowj2me-small.jpg" width="600" height="450" alt="clique para obter o tamanho completo" class="align-center" alt="" vspace="5" hspace="50" class="b-none"></a><br><center>Janela Configura&ccedil;&atilde;o</center></p>

<ul><li>No topo da janela, na caixa combo, selecione &quot;Adicionar configura&ccedil;&atilde;o...&quot;. Nomeie a nova configura&ccedil;&atilde;o como &quot;WithKeyboard&quot;.
<li>Cancele a sele&ccedil;&atilde;o da ciaxa de sele&ccedil;&atilde;o &quot;Usar valores da configura&ccedil;&atilde;o padr&atilde;o&quot;.
<li>Na caixa combo &quot;Dispositivo&quot;, selecione &quot;Dispositivo Qwerty&quot; e clique em OK.</li></ul>

Agora, vamos iniciar seu projeto com a configura&ccedil;&atilde;o &quot;WithKeyboard&quot;:

<ul><li>Clique com o bot&atilde;o direito do mouse no projeto e selecione &quot;Definir como projeto principal&quot;, para assegurar que este seja o projeto principal.
<li>Na barra de ferramentas n&oacute;s temos que selecionar nossa configura&ccedil;&atilde;o, como abaixo mostrado:</li></ul>

<p><img src="../../images_www/articles/win-with-netbeans/config.jpg" class="align-center" alt="" vspace="5" hspace="50"><br><center>Janela Configura&ccedil;&atilde;o</center></p>

<ul><li>Finalmente, n&oacute;s temos que executar o projeto ao selecionar &quot;Executar -&gt; Executar projeto principal...&quot;.
<li>Voc&ecirc; ver&aacute; o emulador selecionado, denominado QwertyDevice, executando seu software j2me.</li></ul>

Al&eacute;m disso, as configura&ccedil;&otilde;es permitem selecionar o n&iacute;vel de ofusca&ccedil;&atilde;o, como o arquivo jar &eacute; criado e como o javadoc &eacute; criado,...
</div>
<br/>
<h2><a name="j2ee"></a>J2EE com o Sun Application Server</h2>
<div class="indent">
<p>A proxima vers&atilde;o do NetBeans ir&aacute; fornecer um recurso chave, que &eacute; a integra&ccedil;&atilde;o com o Sun Application Server 8.1. Al&eacute;m disso, o suporte ao EJB e Servi&ccedil;os da Web ser&aacute; adicionado. Estas funcionalidade ainda est&atilde;o reservadas para IDEs dispendiosos.</p>
</div>
<h2><a name="profiler"></a>Perfilador do NetBeans</h2>
<div class="indent">
<p>O objetivo deste plug-in &eacute; o de fornecer uma solu&ccedil;&atilde;o poderosa e flex&iacute;vel para perfilamento e que est&aacute; bem integrada no fluxo de trabalho do IDE. Ai utiliz&aacute;-lo, voc&ecirc; ter&aacute; uma &quot;vis&atilde;o do overhead&quot; de seu software Java em tempo de execu&ccedil;&atilde;o.</p>
<p>Ele ser&aacute; liberado em Abril de 2005, e alguma funcionalidade j&aacute; pode ser usada na vers&atilde;o beta.</p>

<p>Caso deseje test&aacute;-lo:</p>
<ul><li>Fa&ccedil;a o download do m&oacute;dulo em http://profiler.netbeans.org/index.html.   </li>
<li>Ap&oacute;s extra&iacute;do, voc&ecirc; precisa selecionar o arquivo. nbm no menu &quot;Ferramentas -&gt; Centro de atualiza&ccedil;&atilde;o -&gt; Instala&ccedil;&atilde;o manual dos m&oacute;dulos &quot;.</li>
<li>Ap&oacute;s instalado, siga para a aba Projeto, e selecione classe de seu projeto que cont&eacute;m a fun&ccedil;&atilde;o main() e, finalmente, selecione o menu Perfilador -&gt; Arquivo do perfilador ... </li></ul>

<p>Aviso:
<br>Na vers&atilde;o beta, &eacute; preciso usar a m&aacute;quina virtual Java 1.4. Consequentemente, se voc&ecirc; tiver a 1.5, poder&aacute; selecionar o argumento &quot;-source 1.4&quot; com o compilador ou instlar a 1.4. Somente o segundo item completado em meu computador.</p>

<p>Aqui est&atilde;o algumas capturas de tela:</p>
<p><img src="../../images_www/articles/win-with-netbeans/profileclass.jpg" class="align-center" alt="" vspace="5" hspace="50"><br><center>Esta janela permite criar diferentes configura&ccedil;&otilde;es de perfilamento.</center></p>

<p><a href="../../images_www/articles/win-with-netbeans/profilerlast.jpg"><img src="../../images_www/articles/win-with-netbeans/profilerlast-small.jpg" class="align-center" alt="clique para obter o tamanho completo" width="600" height="481" vspace="5" hspace="50" class="b-none"></a><br><center>Os threads s&atilde;o mostrados em lindos relat&oacute;rios visuais.</center></p>
</div>
<h2><a name="misc"></a>Diversos</h2>
<div class="indent">
<p>O NetBeans tem uma ampla variedade de &quot;plug-ins&quot; para suportar outras linguagens, como C/C++, Fortran, ... ou at&eacute; UML. Um perfilador, permitindo testar o desemepenho de nosso aplicativo, tamb&eacute;m foi liberado. N&oacute;s n&atilde;o iremos falar dele aqui e vamos deixar que voc&ecirc; o fa&ccedil;a:-) Embora, a maioria do plug-ins est&atilde;o dispon&iacute;veis para a vers&atilde;o 3.6 do NetBeans, eles n&atilde;o s&atilde;o utiliz&aacute;veis com a quarta vers&atilde;o. Esperamos que isso seja obtido em breve.
</p>
<p>Lista de plug-ins: <a href="http://plugins.netbeans.org/">http://plugins.netbeans.org/</a>
</p>
</div>
<h2><a name="advantages"></a>Diversos</h2>
<div class="indent">
<p>Vantagens:	</p>
<ul><li>Uma grande paleta de funcionalidades incorporadas : xml, documenta&ccedil;&atilde;o, bacos de dados, tomcat ...</li>
<li>atrativas para trabalhar com o Java em aplicativos desktop, Web e m&oacute;veis.</li></ul>
<p>Desvantagens:</p>
<ul><li>O m&oacute;dulos J2EE n&atilde;o ser&atilde;o liberados antes da Primavera de 2005, na vers&atilde;o 4.1.</li>
<li>A maioria dos plug-ins n&atilde;i est&atilde; dispon&iacute;veis para a quarta vers&atilde;o.</li></ul>

</div>
<h2><a name="conclusion"></a>Conclus&atilde;o</h2>
<div class="indent">
<p>O NetBeans permite uma grande facilidade de desenvolvimento para os programadores, ao tomar conta de partes dif&iacute;cies e secund&aacute;rias de seus projetos. Usando o NetBeans, voc&ecirc; ir&aacute; economizar tempo, dinheiro e paz de esp&iacute;rito. Consequentemente, voc&ecirc; pode se concentrar com facilidade em seu c&oacute;digo.
</p>
<p>Links :
<br><a href="http://www.netbeans.org">http://www.netbeans.org</a>: site da Web oficial do NetBeans
<br><a href="http://java.sun.com">http://java.sun.com</a>: site da Web oficial doJava, onde &eacute; possivel baixar o NetBeans em um conjunto integrado com o Java
</p>
</div>



</body>

</html>

