<html>
<head>
<title>Apresenta&ccedil;&atilde;o do NetBeans 4.0 - Geral</title>
<META NAME="AUDIENCE" CONTENT="NBUSER">
<META NAME="TYPE" CONTENT="ARTICLE">
<META NAME="TOPIC" CONTENT="BASIC">
<META NAME="description" CONTENT="Presentation of NetBeans 4.0 - General">
<link rel="stylesheet" type="text/css" href="../../netbeans.css">
<META NAME="EXPIRES" CONTENT="N">
<meta name="author" content=""/>
<meta name="indexed" content="y"/>
<meta name="description" content="Presentation of NetBeans 4.0 - General"/>
</head>
<body>
<h1>Apresenta&ccedil;&atilde;o do NetBeans 4.0 - Geral</h1>
<div class="articledate" style="margin-left:0px;">Contribui&ccedil;&atilde;o de Jean-Baptiste Renaux como parte da competi&ccedil;&atilde;o <a href="../../competition/win-with-netbeans.html">Win With NetBeans</a></div></p>

<p>Este artigo faz parte de uma s&eacute;rie de tr&ecirc;s artigos:</p>
<ul>
<li>Apresenta&ccedil;&atilde;o geral (p&aacute;gina atual)</li>
<li><a href="presenting-netbeans40-2.html">Praticando com o NetBeans</a></li>
<li><a href="presenting-netbeans40-3.html">Plug-ins</a></li>
</ul>

<h2>Apresenta&ccedil;&atilde;o geral</h2>
<table>
<tr>
	<td><p><b>Resumo</b>
<ul>
  <li><a href="#intro">Introdu&ccedil;&atilde;o</a></li>
  <li><a href="#history">Hist&oacute;rico</a></li>
  <li><a href="#general">Apresenta&ccedil;&atilde;o geral</a></li>
  <ul>
<li><a href="#project">Gerente de Projetos</a></li>
<li><a href="#supported">Arquivos suportados</a></li>
<li><a href="#autocomplete">Auto-conclus&atilde;o</a></li>
<li><a href="#autocorrect">Corre&ccedil;&atilde;o autom&aacute;tica</a></li>
<li><a href="#refactor">Refatora&ccedil;&atilde;o</a></li>
<li><a href="#fileorg">Organiza&ccedil;&atilde;o de arquivos</a></li>
<li><a href="#generate">Gerar arquivos de documenta&ccedil;&atilde;o</a></li>
<li><a href="#autocompile">Compila&ccedil;&atilde;o autom&aacute;tica</a></li>
<li><a href="#debug">&quot;Hora de depurar&quot;</a></li>
<li><a href="#testclass">Testar classes (estrutura Junit)</a></li>
<li><a href="#inter">Internacionaliza&ccedil;&atilde;o</a></li>
<li><a href="#cvs">Usando o CVS</a></li>
<li><a href="#connect">Conectando com o banco de dados</a></li>
<li><a href="#autocomment">Coment&aacute;rio autom&aacute;tico neste c&oacute;digo</a></li></ul>
</ul></td>
	<td><img src="../../images_www/articles/win-with-netbeans/splash4.jpg" class="align-center" alt="Tela splash 4.0 " vspace="5" hspace="50"></p></td>
</tr>
</table>

<h2 class="intro"><a name="intro"></a>Introdu&ccedil;&atilde;o</h2><div class="indent">

<p>Um Ambiente de Desenvolvimento Integrado &eacute; um conjunto de ferramentas para ajudar os programadores. O NetBeans &eacute; uma delas e ele &eacute; especializado em Java. Voc&ecirc; pode, desta forma, liberar seu pensamento e se concentrar com facilidade em seu c&oacute;digo. </p>

<p>N&oacute;s iremos explorar a maioria da funcionalidades do sofware, e as mais importantes pela primeira vez, e ent&atilde;o vamos praticar com tutoriais. Por fim, n&oacute;s iremos terminar com uma apresenta&ccedil;&atilde;o dos plug-ins e as vantagens e desvantagens deste IDE.</p> 

<p>Ele &eacute; desenvolvido pela Sun Microsystems, e pode ser baixado de gra&ccedil;a neste site da Web oficial: www.netbeans.org. </p>

<p>Aviso: o objetivo deste artigo n&atilde;o &eacute; o de apresentar todas as funcionalidades, mas obter uma vis&atilde;o geral de suas possibilidades. Sugiro que voc&ecirc; consulte o site da Web oficial e a documeta&ccedil;&atilde;o caso tenha algum problema.</p>
</p>
</div>
<h2 class="history"><a name="history"></a>Hist&oacute;rico</h2>
<div class="indent">
<p>1996: O projeto NetBeans foi lan&ccedil;ado por uma empresa Tcheca denominada Xelfi. Ela queria escrever um ID tipo delph para o Java e escrito com o Java. Havia duas vers&otilde;es comerciais, &quot;Desenvolvedor&quot; 2.0 e 2.1 .</p>

<p>Maio de 1999: a vers&atilde;o 3.0 beta &eacute; liberada. </p>

<p>Outubro de 1999: a Sun Microsystems compra o NetBeans. O IDE muda de nome para &quot; Sun Forte For Java Community Edition &quot;. Esta vers&atilde;o &eacute; gr&aacute;tis a profissional tem de ser comprada.</p>

<p>Junho de 2000: a Sun libera o NetBeans com c&oacute;digo-fonte aberto (que &eacute; renomeado para seu nome original). </p>

<p>Dezembro de 2004: a quarta vers&atilde;o &eacute; liberada com novos recursos, tal como o suporte para o java 5, um melhor gerenciador de projetos, uma interface gr&aacute;fica aprimorada, o Ant &eacute; inclu&iacute;do em projetos, ...</p>
<h3 class="tutorial">Para o futuro:</h3>

<p>Primavera de 2005. A vers&atilde;o 4.1 ser&aacute; liberada, com m&oacute;dulos J2EE.</p> 

<p>Na pol&iacute;tica da Sun, o NetBeans &eacute; um software raiz para o &quot;Sun ONE Studio&quot;, o IDE do ONE (One Net Environment). O ONE &eacute; um projeto para fornecer um grupo de aplicativos para ajudar os profisionais de rede e desenvolvimento. Neste projeto, podemos ver que o &quot;Sun ONE Application server&quot;, &quot;Sun ONE Web Services platform&quot;, ...</p>

<p>NetBeans ir&aacute; funcionar no Win32, Linux, MacOs X e Solaris. A arquitetura &eacute; escrita 100% em java.</p>

<p>Mais ainda, todas as ferramentas que veremos s&atilde;o gr&aacute;tis. O NetBeans &eacute; o canivete su&iacute;&ccedil;o do programador. 
</p>
</div>
<h2><a name="general"></a>Apresenta&ccedil;&atilde;o geral</h2><br/>
<div class="indent"
<h3 class="tutorial"><a name="project"></a>Gerente de Projetos:</h3>
<br>Vamos entrar em <b>Arquivo -&gt; Novo projeto</b>

<p><a href="../../images_www/articles/win-with-netbeans/newproject.jpg" ><img src="../../images_www/articles/win-with-netbeans/newproject-small.jpg" width="600" height="406" class="align-center" alt="Novo projeto" vspace="5" hspace="50" class="b-none" /></a></p>

<p>	O NetBeans prop&otilde;e modelos de projetos prontos para uso:  
<ul>
<li>Para um aplicativo padr&atilde;o (para linhas de comando de software, interfaces gr&aacute;ficas,...).</li>
<li>Para sites da Web. A vers&atilde;o 4.1 ir&aacute; fornecer modelos para J2EE, tal como os servi&ccedil;os da Web EJB. </li>
<li>Um item de menu de &quot;amostra&quot; que cont&eacute;m exemplos de c&oacute;digo.</li>
</ul>
Os modelos de projetos tornam mais f&aacute;cil seu trabalho, porque o NetBeans ir&aacute; automaticamente configurar o software em seu ambiente, tais como os da Web (Tomcat, que veremos mais adiante).
</p>

<p>N&oacute;s iremos criar um projeto em <b>Padr&atilde;o -&gt; Aplicativo Java</b>, denominado &quot;NetBeans&quot;.</p>
<p><img src="../../images_www/articles/win-with-netbeans/standard.jpg" class="align-center" alt="Novo projeto" vspace="5" hspace="50" /></p>
<p>H&aacute; dois pacotes:</p>

<p>&quot;Pacotes de c&oacute;digo-fonte&quot; que cont&ecirc;m seu c&oacute;digo-fonte. N&oacute;s iremos colocar seus arquivos, figuras...</p> 
<p>&quot;Pacotes de teste&quot; que cont&ecirc;m o c&oacute;digo-fonte de arquivos JUnit. O JUnit &eacute; uma estrutura de teste (o veremos mais adiante).</p>

<p>Aviso: estes pacotes n&atilde;o s&atilde;o os mesmo que os da linguagem Java.</p>

<p>Se desejarmos adicionar um novo elemento em nosso software, selecione o projeto na aba Projeto, e selecione o menu <b>Arquivo -&gt; Novo arquivo</b> ... </p>
<p><a href="../../images_www/articles/win-with-netbeans/newfile.jpg"><img src="../../images_www/articles/win-with-netbeans/newfile-small.jpg" width="600" height="406" class="align-center" alt="Novo arquivo" vspace="5" hspace="50" class="b-none" /></a></p>

<p>Temos nesta janela muitos modelos de arquivos, pacotes e servlets Java, ou interfaces gr&aacute;ficas Swing. </p>

<p>Aqui n&oacute;s criamos a classe Java:</p>

<p><b>Classes Java -&gt; Classe Java</b></p>

<p>Lhe aconselho a testar muitos destes tipos de modelos para entender as funcionalidades do NetBeans.</p>
<p>Antes que esque&ccedil;a, criei dois pacotes Java: netbeans e netbeans.teste, e duas classes Java: Main.java e Test.java.</p>
<p><img src="../../images_www/articles/win-with-netbeans/main.jpg" class="align-center" alt="Classe Java" vspace="5" hspace="50" /></p>

<p>Se voc&ecirc; deseja criar um arquivo de modelo, clique com o bot&atilde;o direito do mouse em um arquivo de projeto e selecione <b>Salvar como modelo ...</b></p>

<p>Veremos mais adiante como compilar, executar e distribuir um projeto. </p>


<h3 class="tutorial"><a name="supported"></a>Arquivos suportados:</h3>

<p>Um IDE tem de suportar arquivos de uso comum para ajudar no trabalho do programador. O NetBeans pode reconhecer a estrutura destes arquivos, colorindo alguma palavras l&eacute;xicas e sintaxes: 
<ul>
<li>arquivo Java com palavras l&eacute;xicas e sintaxes coloridas, conclus&atilde;o autom&aacute;tica e corre&ccedil;&atilde;o de erro </li>
<li>xml, com sintaxe colorida, e gerador de dtd e xsl e um validador</li>
<li>html e css, com sintaxe colorida</li>
</ul>
</p>
<h3 class="tutorial"><a name="autocomplete"></a>Auto-conclus&atilde;o:</h3>

<p>A conclus&atilde;o autom&aacute;tica, algumas vezes chamada de &quot;intelig&ecirc;ncia&quot; em alguns outros IDEs, permitem sugerir o fim de suas palavras. Um exemplo seria bom para entend&ecirc;-lo:</p>

<p>Aqui come&ccedil;amos uma nova linha e escrevemos &quot;String&quot;, <b>ao pressionar CTRL-Espa&ccedil;oe</b>, um menu suspenso &eacute; aberto com o noe de classes e interfaces utiliz&aacute;veis e at&eacute; uma documenta&ccedil;&atilde;o est&aacute; vis&iacute;vel:</p>
<p><img src="../../images_www/articles/win-with-netbeans/string.jpg" class="align-center" alt="Auto-conclus&atilde;o" vspace="5" hspace="50" /></p>
<p>A documenta&ccedil;&atilde;o Java &eacute; desta forma integrada no NetBeans, como acabamos de ver.</p>

<h3 class="tutorial"><a name="autocorrect"></a>Corre&ccedil;&atilde;o autom&aacute;tica:</h3>
<p>Ao escrever a linha a seguir:
	<br>StringBuffer sb = new StringBuffer(&quot;test&quot;,5);</p>
<p>O NetBeans a sublinha. O motivo &eacute; que nenhuma construtor est&aacute; dispon&iacute;vel para estes dois argumentos, como o NetBeans o indica:
</p>
<p><img src="../../images_www/articles/win-with-netbeans/autocorrect.jpg" class="align-center" alt="Corre&ccedil;&atilde;o autom&aacute;tica" vspace="5" hspace="50" /></p>

<p>A corrre&ccedil;&atilde;o autom&aacute;tica est&aacute; dispon&iacute;vel mesmo antes de compliar o arquivo.</p>

<h3 class="tutorial"><a name="refactor"></a>Refatora&ccedil;&atilde;o:</h3>

<p>A refatora&ccedil;&atilde;o &eacute; uma funcionalidade que permite renomear pacotes ou arquivos, sem precisar escrever/modificar uma linha de c&oacute;digo. Se voc&ecirc; deseja renomear um pacote, por exemplo, selecione-o na aba Projeto e escolha no menu <b>Refatora&ccedil;&atilde;o -&gt; Renomear</b> ... 
</p>
<p><img src="../../images_www/articles/win-with-netbeans/refactor1.jpg" class="align-center" alt="Refatora&ccedil;&atilde;o" vspace="5" hspace="50" /></p>

<p>Clique em &quot;Pr&oacute;ximo&quot; e ver&aacute; um resumo de todas as a&ccedil;&otilde;es que ser&atilde;o executadas pelo NetBeans:</p>
<p><img src="../../images_www/articles/win-with-netbeans/refactor2.jpg" class="align-center" alt="Refatora&ccedil;&atilde;o" vspace="5" hspace="50" /></p>
<p>Ao clicar em &quot;Fazer refatora&ccedil;&atilde;o&quot;, o pacote &quot;netbeans&quot; ser&aacute; renomeado para &quot;supinfo.labo.sun&quot;, e o arquivo main.java ser&aacute; movido para o novo pacote.</p>

<h3 class="tutorial"><a name="fileorg"></a>Organiza&ccedil;&atilde;o de arquivos:</h3>

<p>Podemos ver diferentes arquivos em diferentes diret&oacute;rios:
<ul><li>build cont&eacute;m os arquivos de classes.</li>
<li>dist cont&eacute;m os arquivos finais de seu projeto. H&aacute; um jar de seu aplicativo e o javadoc.</li>
<li>nbproject cont&eacute;m os arquivos de configura&ccedil;&atilde;o ant, que determina como compilar, executar, implementar... um projeto.</li>
<li>src cont&eacute;m o c&oacute;digo-fonte do projeto.</li>
<li>test cont&eacute;m os arquivos de teste do projeto (veremos mais adiante o JUnit).</li>
<li>outros arquivos: build.xml &eacute; usado para compilar (este &eacute; um arquivo ant) e manifest.mf para definir o projeto.</li></ul>
<img src="../../images_www/articles/win-with-netbeans/fileorg.jpg" class="align-center" alt="Organiza&ccedil;&atilde;o de arquivos" vspace="5" hspace="50" /></p>

<h3 class="tutorial"><a name="generate"></a>Gerar arquivos de documenta&ccedil;&atilde;o</h3>
<p>
A cria&ccedil;&atilde;o da documenta&ccedil;&atilde;o permite que outros programadores entendam a arquitetura de seu c&oacute;digo. N&oacute;s podemos usar a ferramenta javadoc, fornecida no JDK, atrav&eacute;s da interface gr&aacute;fica do NetBeans. 
</p>
<p>O javadoc usa os coment&aacute;rios em seu c&oacute;digo para escrever os arquivos de documenta&ccedil;&atilde;o (com os s&iacute;mbolos /** @authi nome_do_autor */, por exemplo).</p> 
	
<p>Ao selecionar no menu <b>Build -&gt; Gerar javadoc para o projeto</b>, a documenta&ccedil;&atilde;o &eacute; feita. Voc&ecirc; pode consult&aacute;-la no arquivo dist/javadoc de seu projeto.</p>

<h3 class="tutorial"><a name="autocompile"></a>Compila&ccedil;&atilde;o autom&aacute;tica:</h3>
<p>A compila&ccedil;&atilde;o &eacute; executada por arquivos xml, interpretados pelo Ant. Sem necessidades especiais, esta parte &eacute; automaticamente gerada.</p>

<p>A compila&ccedil;&atilde;o &eacute; autom&aacute;tica na execu&ccedil;&atilde;o do software ao selecionar <b>Executar ---&gt; Executar projeto principal</b> ... A compila&ccedil;&atilde;o pode ser inciciada manualmente ao selecionar no menu <b>Build -&gt; Build o projeto principal</b>. O arquivo jar do aplicativo estar&aacute; localizado no diret&oacute;rio &quot;dist&quot; no diret&oacute;rio raiz do aplicativo (que voc&ecirc; pode ver na aba &quot;Arquivos&quot;).</p>

<p>O arquivos xml que devem ser usados pelo Ant s&atilde;o automaticamente gerados nos arquivos &quot;nbproject&quot; no diret&oacute;rio raiz do aplicativo. Eles ser&atilde;o ausados mais tarde na complia&ccedil;&atilde;o, no momento da gera&ccedil;&atilde;o da documenta&ccedil;&atilde;o e no momento da inicializa&ccedil;&atilde;o. </p>

<p>Caso n&atilde;o saiba como o ant est&aacute; funcionando, sugerimos ler a documenta&ccedil;&atilde;o oficial.</p>

<h3 class="tutorial"><a name="debug"></a>&quot;Hora de depurar&quot;</h3>
<p>Enquanto estiver escrevendo seu c&oacute;digo, &eacute; importante controlar cada parte da execu&ccedil;&atilde;o de seu software. Caso deseje iniciar seu aplicativo etapa por etapa, aqui est&atilde;o os tr&ecirc;s est&aacute;gios:</p> 
<ul><li>&Eacute; preciso colocar pontos de quebra em seu c&oacute;digo ao <b>clicar com o bot&atilde;o direito do mouse em seu c&oacute;digo-fonte -&gt; alternar Ponto de quebra</b></li>
<li>Selecione no menu <b>Executar -&gt; Depura&ccedil;&atilde;o</b> , e o projeto ser&aacute; automaticamente compilado e iniciado.</li>
<li>Seu programa ir&aacute; pausar no primeiro ponto de quebra encontrado. O menu Executar lhe oferece muitas funcionalidades, como: <b>Executar -&gt; Passar sobre, Executa -&gt; Executar at&eacute; o cursor</b>, ... </li></ul>

<p>A janela em <b>Janela -&gt; Depurar</b> lhe oferecer&aacute; diversas informa&ccedil;&otilde;es sobre vari&aacute;veis, threads, ...</p>
<p><ul><li>Na pr&oacute;xima captura de tela, voc&ecirc; ver&aacute; tr&ecirc;s coisas importantes:</li>
<li>Pontos de quebra coloridos em vermelho</li>
<li>A linha verde, que mostra onde seu software parou</li>
<li>Abaixo, podemos ver os objetos de fato usados</li></ul>
<img src="../../images_www/articles/win-with-netbeans/debug.jpg" class="align-center" alt="Depura&ccedil;&atilde;o" vspace="5" hspace="50" /></p>

<h3 class="tutorial"><a name="testclass"></a>Testar classes (estrutura Junit):</h3>
<p>Os testes est&atilde;o crescendo de import&acirc;ncia na medida em que seus projetos s&atilde;o maiores e maiores. &Eacute; impens&aacute;vel escrever os mesmos em um fun&ccedil;&atilde;o main(). N&oacute;s dever&iacute;amos organiz&aacute;-los em classes de teste, criando uma classe de teste para cada classe em seu aplicativo. Desta forma, a estrtura JUnit permite simular a execu&ccedil;&atilde;o de seu aplicativo.
</p>
<p>Como criar um teste: 
<ul><li>Coloque o cursor em uma classe na aba &quot;Projeto&quot;. </li>
<li><b>Clique com o bot&atilde;o direito do mouse em ---&gt; Ferramentas ---&gt; Testes JUnit ---&gt; Criar teste</b> ... e valide a janela que &eacute; mostrada com as op&ccedil;&otilde;es padr&atilde;o.</li>
<li>Uma classe em &quot;Pacotes de teste&quot; ser&aacute; criada. Essa estende um TestCase e essa classe da estrtura JUnit permite criar os testes.</li></ul>
</p>
Essa classe cont&eacute;m um construtor, uma fun&ccedil;&atilde;o denominada setUp (utilizada como o inicializador do teste), tearDown (utilizada em todos os tempos de fechamento do teste) e, finalmente, um n&uacute;mero infinito de m&eacute;todos denominados testXXX onde XXX &eacute; o nome do teste.

<p>Aqui est&aacute; uma exemplo para uma classe JUnit:
<br><img src="../../images_www/articles/win-with-netbeans/junit.jpg" class="align-center" alt="Depura&ccedil;&atilde;o" vspace="5" hspace="50"></p>

<p>Essa classe JUnit pode ser iniciada a qualquer momento, na interface do NetBeans, ao selecionar <b>Executar ---&gt; Executar outro ---&gt; Arquivo de teste.</b></p>

<p>Neste caso, a classe JUnit faz a sa&iacute;da destas sequ&ecirc;ncias de caracteres:
<br>maintTest
<br>setUp &lt;--- at testHello() execution
<br>hello
<br>tearDown
<br>setUp &lt;--- at testHello2() execution
<br>hello2
<br>tearDown
</p>
<p>Voc&ecirc; pode consultar um bom tutorial sobre o JUnit em seu site da Web oficial: <a href="http://junit.sourceforge.net/doc/testinfected/testing.htm">http://junit.sourceforge.net/doc/testinfected/testing.htm</a></p>

<h3 class="tutorial"><a name="inter"></a>Internacionaliza&ccedil;&atilde;o:</h3>

<p>O NetBeans permite usar as fun&ccedil;&otilde;es java (i18n) de internacionaliza&ccedil;&atilde;o.</p>
<p>Crie um novo projeto padr&atilde;o, com uma nova classe e escreva esta linha no m&eacute;todo main():
<ul><li><b>System.out.println();</b></li></ul>
e coloque o cursor entre as aspas. Siga e selecione no menu:
<ul><li><b>Ferramentas ---&gt; Internacionaliza&ccedil;&atilde;o ---&gt; Inserir a sequ&ecirc;ncia de caracteres de internacionaliza&ccedil;&atilde;o</b> ...</li></ul>
Crie um &quot; bundle &quot;, com uma chave e um valor relativo. Pressione &quot;OK&quot; e uma refer&ecirc;ncia para a chave ser&aacute; criada.
<p><img src="../../images_www/articles/win-with-netbeans/internationalization.jpg" class="align-center" alt="Internacionaliza&ccedil;&atilde;o" vspace="5" hspace="50"></p>

<p>O NetBeans irpa inserir um valor em sua linha:
<ul><li><b>System.out.println(java.util.ResourceBundle.getBundle(&quot;supinfo/labo/sun/i18n&quot;).getString(&quot;key_name&quot;));</b></li></ul>
N&oacute;s iremos inserir um novo valor.
<ul><li>Na aba &quot;Projeto&quot;, selecione o arquivo de conjunto, clique com o bot&atilde;o direito do mouse em ...&gt;Adcionar local..., e a seguir selecione o novo valor.</li></ul>
</p>
Novas refer&ecirc;ncias ser&atilde;o adicionadas abaixo do arquivo i18n.properties.

<p><img src="../../images_www/articles/win-with-netbeans/locale.jpg" class="align-center" alt="Internacionaliza&ccedil;&atilde;o" vspace="5" hspace="50"></p>

<p>Para selecionar valores de chave, voc&ecirc; pode usar valores finais no pacote java.util.Locale, tal como Locale.FRANCE, Locale.CANADA_FRENCH, Locale.CHINESE, ... Voc&ecirc; ter&aacute; que colocar o valor do local no segundo argumento do m&eacute;todo getBundle():
<ol><b>System.out.println(java.util.ResourceBundle.getBundle(&quot;supinfo/labo/sun/i18n&quot;,Locale.JAPAN).getString(&quot;key_name&quot;)); </b></ol>
</p>
<h3 class="tutorial"><a name="cvs"></a>Usando o CVS</h3>
<p>O Trabalho em Equipe permite sincronizar seu trabalho com seus companheiros. O NetBeans fornece um cliente CVS incorporado. N&oacute;s iremos conectar ao servidor CVS do projeto NetBeans.</p>

<p>Vamos usar o cliente CVS:
<ul><li>Vers&atilde;o ---&gt; Gerenciador de vers&atilde;o ...</li>
<li>Clique em Adicionar, para adicionar um novo diret&oacute;rio de trabalho.</li>
<li>Insira esta informa&ccedil;&atilde;o:
<ul>
<li>Diret&oacute;rio de trabalho: o diret&oacute;rio em seu sistema operacional para onde o c&oacute;digo-fonte dever&aacute; ser enviado.</li>
<li>Tipo de servidor CVS: pserver</li>
<li>Nome do servidor CVS: cvs.netbeans.org</li>
<li>Porta: 2401 </li>
<li>Nome do usu&aacute;rio: anoncvs</li>
<li>Reposit&oacute;rio: /cvs</li></ul></li></ul>

<img src="../../images_www/articles/win-with-netbeans/cvs.jpg" class="align-center" alt="CVS" vspace="5" hspace="50"></p>
<ul><li>&quot;Executar retirada&quot; tem de ser selecionado.</li>
<li>Clique em &quot;Pr&oacute;ximo&quot; na parte inferior da janela e finalmente em &quot;Terminar&quot;.</li></ul>
<p>
O NetBeans ir&aacute; baixar os arquivos de c&oacute;digo-fonte. Levar&aacute; bastante tempo para retirar todos os arquivos de c&oacute;digo-fonte, mas voc&ecirc; pode cancelar, pois era somente um teste.
</p>
<h3 class="tutorial"><a name="connect"></a>Conectando com o banco de dados:</h3>
<p>A maioria dos softwares da Web trabalham com um banco de dados, permitindo salvar informa&ccedil;&otilde;es. O NetBeans tem uma ferramenta incorporada para se conectar com um banco de dados. 
</p>
<p>Iremos testar essa parte como MySql. Primeiro, voc&ecirc; ter&aacute; que baixar os drivers deste site da Web: 
<br><a href="http://dev.mysql.com/downloads/connector/j/">http://dev.mysql.com/downloads/connector/j/</a></p>
<ul><li>Selecione a aba &quot;Execut&aacute;vel&quot; e o submenu &quot;Banco de dados&quot; </li>
<li>Clique com o bot&atilde;o direito do mouse em <b>Drivers, Adicionar drivers</b> ... e selecione o driver MySQL (ele &eacute; um arquivo jar).</li>
<li>Selecione seu driver no subdiret&oacute;rio <b>Driver</b>, e crie uma conex&atilde;o ao <b>clicar com o bot&atilde;o direito do mouse em ---&gt; Conectar usando</b> ... Para este teste n&oacute;s inserimos as seguintes informa&ccedil;&otilde;es:
<ul><li>Database Url : jdbc:mysql://localhost:3306/mysql (onde localhost &eacute; nossa m&aacute;quina local e onde o dom&iacute;nio mysql est&aacute; sendo executado).</li>
<li>Nome de usu&aacute;rio e senha: ... s&atilde;o os seus ... !</li></ul></li>
</ul>
<p>
Voc&ecirc; pode selecionar dados, criar tabelas, criar vistas (mas esta funcionalidade ainda n&atilde;o existe no MySQL).
</p>
<h3 class="tutorial"><a name="autocomment"></a>Coment&aacute;rio autom&aacute;tico:</h3>

<p>H&aacute; uma editor gr&aacute;fico que ir&aacute; ajud&aacute;-lo a escrever seus coment&aacute;rios nas classes Java. Para us&aacute;-lo, clique com o bot&atilde;o direito do mouse em uma classe Java, na aba &quot;Projeto&quot; ou &quot;Arquivo&quot;, e selecione <b>Ferramentas -&gt; Coment&aacute;rio autom&aacute;tico</b> ... 
</p>
<p>Uma interface ir&aacute; mostrar todos os m&eacute;todos, classes que podem ser comentados... &eacute; muito f&aacute;cil e mais atrativo que escrever-los a m&atilde;o.
</p>
</div>
</body>

</html>

