<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
  <title>Tutorial do mapeador de consulta para o concurso NetBeans</title>
<META NAME="description" CONTENT="Query Mapper Tool">
<META NAME="AUDIENCE" CONTENT="NBUSER">
<META NAME="TYPE" CONTENT="ARTICLE">
<META NAME="TOPIC" CONTENT="BASIC">
<link rel="stylesheet" type="text/css" href="../../netbeans.css">
</head>
<body >
<h1>Ferramenta Mapeador de consulta</h1>
<div class="articledate" style="margin-left:0px;">Contribui&ccedil;&atilde;o de Zsolt Kiss como parte da competi&ccedil;&atilde;o <a href="../../competition/win-with-netbeans.html">Win With NetBeans</a></div></p>
<p><a href="https://netbeans.org/projects/www/downloads?action=download&dlID=478">Download de arquivos e c&oacute;digo-fonte</a></p>
<div id="contentLeft">
<table >
  <tbody>
    <tr>

      <td>
      <p>Como um programador da Web, com frequ&ecirc;ncia estava a frente do problema de como os recursos do projeto se tornaram uma bagun&ccedil;a n&atilde;o gerenci&aacute;vel. Por fim decido criar uma pequena e inteligente ferramenta que ajuda a examinar meus arquivos de c&oacute;digo-fonte e os coincidir com outros recursos relacionados. </p>
      <p>Ao desenvolver um aplicativo robusto dirigido por banco de dados, parece ser uma boa id&eacute;ia manter as declara&ccedil;&otilde;es de seu banco de dados em um &uacute;nico arquivo de propriedades, na forma de chave - valor, tal como </p>
      <pre class="examplecode">		sql.t_machine.insert=insert into t_machine (id, mcname, headnum) values (?,?,?)<br>	</pre>
Para usar este formul&aacute;rio, voc&ecirc; deveria somente ler o arquivo de propriedades para seu c&oacute;digo Java, e ent&atilde;o ser&aacute; poss&iacute;vel construir uma inst&acirc;ncia de objeto PreparedStatement e fazer a parametriza&ccedil;&atilde;o necess&aacute;ria com valores recebidos de um formul&aacute;rio html.
      <pre class="examplecode">		Properties props = new Properties();<br>		FileInputStream in = new FileInputStream(&quot;./query.properties&quot;);<br>		props.load(in);<br>		....<br>		Connection con = DriverManager.getConnection(dbURL);<br>		String sqlUpdate = props.getProperty(&quot;sql.employees.update&quot;);<br>		PreparedStatement pstm = con.preparedStatement(sqlUpdate);<br>		pstm.setString(1, &quot;Jacob&quot;);		//updates firstname field<br>		pstm.setString(2, &quot;Nielsen&quot;);		//updates lastname field<br>		pstm.setInt(3, 47);			//sets record id in 'where' clause of update statement<br>	</pre>

      <p>At&eacute; aqui, tudo OK, mas se voc&ecirc; tem centenas de declara&ccedil;&otilde;es no arquivo de propriedades e al&eacute;m disso alguns aparecem em mais de uma classe Java? Se voc&ecirc; alterou algo - ou qualquer outra pessoa trabalhando no projeto alterou algo - (por exemplo, a contagem de par&acirc;metros ou a ordem pela qual uma declara&ccedil;&atilde;o sql aguarda), voc&ecirc; deve conhecer TODAS as classes Java, e o JSP e p&aacute;ginas HTML relativos &agrave;quela declara&ccedil;&atilde;o que seguem as altera&ccedil;&otilde;es. </p>
      <p>Todos conhecem os programadores de banco de dados e suas necessidades para alterar tabelas e consultas com a mesma frequ&ecirc;ncia que os desenvolvedores Java v&atilde;o tomar um caf&eacute;. Sem deixar de mencionar as constantes altera&ccedil;&otilde;es das necessidades do cliente. Portanto, tenho certeza que seu arquivo de propriedades n&atilde;o ficar&aacute; est&aacute;tico. E quando as declara&ccedil;&otilde;es sql mudam, seu c&oacute;digo precisa ser modificado! Logo, voc&ecirc; ir&aacute; precisar examinar as declara&ccedil;&otilde;es uma a uma no arquivo de propriedades e as classes Java que tratam e parametrizam as mesmas. </p>
      <p>Penso que voc&ecirc; come&ccedil;a a entender a necessidade de ter uma ferramenta inteligente de &uacute;til de mapeamento de consulta... </p>
      <p>Bom, vamos ver sobre que estou falando! </p>
      <p>Vamos criar um aplicativo de amostra simples da Web com somente alguns JSPs que fornece ao usu&aacute;rio os formul&aacute;rios para enviar inser&ccedil;&otilde;es, atualizar e selecionar declara&ccedil;&otilde;es no banco de dados. Quando um usu&aacute;rio solicita uma p&aacute;gina - normalmente clica em um link, &iacute;cone, elemento da barra de menus, etc. - muitas coisas podem acontecer em segundo plano. Por exemplo, uma declara&ccedil;&atilde;o de sele&ccedil;&atilde;o no banco de dados que produz uma lista ou tabela na tela que vir&aacute;. Quando o usu&aacute;rio termina de trabalhar na p&aacute;gina -- normalmente ao colocar dados em elementos do formul&aacute;rio -- clica e envia uma nova solicita&ccedil;&atilde;o &eacute; enviada para o servidor da Web. E, novamente, ma de suas classes Java pode fazer alguma opera&ccedil;&atilde;o no banco de dados. </p>
      <p>Aqui est&aacute; uma IGU da Web bem est&uacute;pida para ajud&aacute;-lo a imaginar: </p>

      <p> <img src="../../images_www/articles/win-with-netbeans/pic2.gif"  hspace="15" vspace="15"></p><p>O usu&aacute;rio clicou no item de menu &quot;Quadro negro de novidades&quot; na esquerda (real&ccedil;ado em vermelho) e a p&aacute;gina de resposta apareceu na direita. A tabela superior e seus dados da moldura direita foram produzidos por uma opera&ccedil;&atilde;o no banco de dados. O usu&aacute;rio agora tem a permiss&atilde;o de selecionar um registro na lista para reescrever dados. Quando tiver terminado, clique no bot&atilde;o &quot;Gravar&quot; para salvar os dados no banco de dados.<br>
Pode ser facilmente imaginado que se seu aplicativo tem muitas p&aacute;ginas a serem exibidas cada uma com trabalho em segundo plano do banco de dados, haver&aacute; um ponto em que todo o processo de desenvolvimento se tornar&aacute; n&atilde;o gerenci&aacute;vel. Ser&aacute; preciso ter alguma refer&ecirc;ncia cruzada entre a IGU e os itens de menus, JSPs, p&aacute;ginas html e c&oacute;digos Java e as declara&ccedil;&otilde;es SQL relacionadas, quando chegar o momento de alterar algo em uma ou duas declara&ccedil;&otilde;es e arquivos. </p>
      </td>
    </tr>
    <tr>
      <td height="20">&nbsp;</td>
    </tr>

    <tr>
      <td>
      <h2>A ferramenta </h2>
      <p>Mapeador de consulta tem quatro vistas em um JFrame contendo um JTabbedPane com uma aba para cada vista. As abas na ordem s&atilde;o: </p>
      <ul>
        <li>Vista do aplicativo</li>
        <li>Vista das propriedades </li>

        <li>Vista do c&oacute;digo </li>
        <li>Vista da tabela </li>
      </ul>
</p>
<p>
<img src="../../images_www/articles/win-with-netbeans/appview.gif"  hspace="15" vspace="15" width="" height=""></p><p>
A <b>Vista do aplicativo</b> pode conter alguma ordem l&oacute;gica do aplicativo. Escolhi a hierarquia de menus, mas esta &eacute; uma escolha do programador. Caso esteja examinando algo com base no mapa de aplicativo ou somente &eacute; capaz de encontrar uma fun&ccedil;&atilde;o a partir daqui - inicie o uso da Vista do aplicativo. Voc&ecirc; pode ver que o n&oacute; do n&iacute;vel um da Vista do aplicativo coincide com a estrutura de menu do aplicativo de amostra &quot;Two Storks Fly &amp; Drive&quot; anteriormente apresentado. Se voc&ecirc; clicar em um n&oacute; ver&aacute; dois tipos de subn&oacute;s: uma p&aacute;gina de solicita&ccedil;&atilde;o e um formul&aacute;rio de envio. Com estes podemos dividir as declara&ccedil;&otilde;es sql em dois grupos: os que s&atilde;o <i>executados antes da renderiza&ccedil;&atilde;o </i> e o resultado que ser&aacute; exibido na p&aacute;gina que vir&aacute;, e os outros que s&atilde;o <i>executados ap&oacute;s o envio</i> do formul&aacute;rio. As folhas na &aacute;rvore s&atilde;o as sequ&ecirc;ncias de caracteres de propriedades sql de seu arquivo de propriedades. A vista completa fornece uma imagem ao desenvolvedor de qual parte do aplicativo a determinada declara&ccedil;&atilde;o &eacute; chamada e qual a intera&ccedil;&atilde;o do usu&aacute;rio -solicitando uma p&aacute;gina ou enviando um formul&aacute;rio -- far&aacute; com que a consulta seja executada.

</p>
<br clear="all">
<p>
<b>Vista das propriedades</b> mostrar chaves da declara&ccedil;&atilde;o sql de seu arquivo de propriedades, chaves que seu c&oacute;digo Java tamb&eacute;m usa.</p>
<p><img src="../../images_www/articles/win-with-netbeans/propview.gif"  hspace="15" vspace="15" width="" height=""></p>
<p>
A expans&atilde;o aqui do n&oacute;s exibe as entradas l&oacute;gicas relacionadas (nomes da barra de menus que o usu&aacute;rio clica para iniciar um fun&ccedil;&atilde;o). E no n&iacute;vel inferior h&aacute; tr&ecirc;s tipos de arquivos de c&oacute;digo fonte que se relacionam com a determinada declara&ccedil;&atilde;o. Os tr&ecirc;s tipos s&atilde;o:
<ul>
	<li>datasource</li>
	<li>setter</li>
	<li>processor</li>

</ul>

Um <b>datasource</b> pode ser representado por qualquer html jsp ou at&eacute; um servlet (se um servlet gera um html din&acirc;mico &quot;noname&quot;). Os datasources s&atilde;o normalmente os arquivos (p&aacute;ginas) dos quais a declara&ccedil;&atilde;o ser&aacute; limitada, ou seja, onde o usu&aacute;rio pode colocar valores para envi&aacute;-los para o servidor. N&atilde;o &eacute; anormal n&atilde;o existir nenhum datasource (por exemplo, uma declara&ccedil;&atilde;o 'select' sem nenhuma cl&aacute;usula where n&atilde;o envia nenhuma entrada, etc.).<br><br>
Na minha terminologia, um <b>setter</b> &eacute; um arquivo Java ou JSP, que trata os valores recebidos do formul&aacute;rio do usu&aacute;rio de um datasource. Os setters podem fazer a valida&ccedil;&atilde;o, mas <i>cada vez que fazem a substitui&ccedil;&atilde;o</i>, a pergunta marca um PreparedStatement com as entradas do usu&aacute;rio.<br><br>
E por fim, os <b>processors</b> s&atilde;o as classes Java (at&eacute; paginas JSP), que processam a determinada declara&ccedil;&atilde;o - eles cont&ecirc;m as chamadas aos m&eacute;todos <i>executeQuery(), executeUpdate(), executeBatch() etc.</i>.

</p>
<br clear="all">
<p>
<b>Vista do c&oacute;digo</b> a lista completa de arquivos do aplicativo agrupados por tipos de arquivos. Sob cada nome de arquivo, voc&ecirc; pode ver n&oacute;s expandidos com as declara&ccedil;&otilde;es relacionadas.
</p><p>
<img src="../../images_www/articles/win-with-netbeans/codeview.gif"  hspace="15" vspace="15" width="" height=""></p><p>
Se voc&ecirc; come&ccedil;a com uma Vista do aplicativo e clica em um item de menu, est&atilde;o escolhe uma declara&ccedil;&atilde;o sql relativa ao menu e entra na Vista de propriedades para ver a declara&ccedil;&atilde;o selecionada real&ccedil;ada. Expanda seus secund&aacute;rios, escolha um arquivo de recursos, clique no menos e mude para a Vista do c&oacute;digo. A Vista do c&oacute;digo ir&aacute; ent&atilde;o revelar o recurso selecionado e todas as declara&ccedil;&otilde;es que afetam este recurso. Passando de vista para vista, &eacute; poss&iacute;vel filtrar as informa&ccedil;&otilde;es nas quais est&aacute; interessado, ou estudar a estrutura de seu projeto do ponto de vista do desenvolvedor.
</p>
<br clear="all">
<p>
<img src="../../images_www/articles/win-with-netbeans/tableview.gif"  hspace="15" vspace="15" width="" height=""></p><p>
Tudo isso n&atilde;o teria nenhum valor se n&oacute;s n&atilde;o pud&eacute;ssemos verificar qual <i>declara&ccedil;&atilde;o sql real</i> est&aacute; sob as chaves do arquivo de propriedades... Por isso temos uma <b>Vista da tabela</b>. A Vista da tabela mostra todas as declara&ccedil;&otilde;es sql do aplicativo agrupadas sob tablenames. Com certeza a refer&ecirc;ncia principal &eacute; a chave da propriedade aqui tamb&eacute;m, mas clique na mesma e a declara&ccedil;&atilde;o real &eacute; revelada.

</p>
<br clear="all">
<p>
Se voc&ecirc; for continuar a ler, lhe conduzirei atrav&eacute;s do processo do desenvolvimento deste aplicativo com o <span style="color:red;font.weight:bold;">NetBeans 4.0</span>.
</p>

	</td>
    </tr>
    <tr>
	<td>
<p>Isso cont&eacute;m os seguintes t&oacute;picos:

</p>
<ul>
  <li><a href="#setup">Configurando um novo aplicativo com o NetBeans IDE 4.0</a></li>
  <li><a href="#createxml">Criando o arquivo xml e de propriedades para o projeto</a></li>
  <li><a href="#javaclasses">Criando classes Java</a></li>
  <li><a href="#compileandrun">Compilar e executar o projeto</a></li>
  <li><a href="#runwithargs">Como executo o projeto com argumentos da linha de comando</a></li>

 </ul>
<p>
<h2><a name="setup"></a>Configurando um novo aplicativo com o NetBeans IDE 4.0</h2>

<ol>
	<li>
<p>
Escolha Arquivo &gt; Novo projeto &gt; Geral &gt; Aplicativo Java, e clique em Pr&oacute;ximo.
</p>
	</li>
	<li>
<p>

Nome do projeto: QueryMapperTool. Procure algum local onde deseja que o NetBeans coloque a pasta do projeto. Assegure que as caixas de sele&ccedil;&atilde;o &quot;Definir como projeto principal&quot; e &quot;Criar classe principal&quot; estejam selecionadas. Digite o nome da classe principal com um nome adequado do pacote completo - Eu usei com.zsoltkiss.qmt.QueryMapper. A escolha &eacute; sua neste caso. Clique em Terminar e o NetBeans cria uma pasta de projeto no caminho determinado. Assegure que em seu IDE as vistas Projeto e Arquivo estejam ativadas: pressione Ctrl+1 e Ctrl+2. Voc&ecirc; pode verificar os arquivos, estrutura do pacote, classes, etc., de seu projeto, a qualquer momento com essas vistas.
</p>
	</li>
	<li>
<p>
O aplicativo usa o JDOM API, que pode ser baixado de <a href="http://www.jdom.org">http://www.jdom.org</a>.
</p>
	</li>
<p>
Caso tenha baixado o JDOM API, precisa informar o NetBeans sobre o fato, e que seu projeto precisa do mesmo. Clique na aba Projeto no IDE (ou pressione Ctrl+1 se estiver oculta), clique com o bot&atilde;o direito do mouse no nome de seu projeto e escolha Propriedades. Na se&ccedil;&atilde;o Build escolha Compilar c&oacute;digo-fonte. Clique em Adicionar JAR/Pasta. Agora tem de mostrar ao NetBeans a pasta onde instalou o JDOM. Sob o diret&oacute;rio de instala&ccedil;&atilde;o do JDOM na subpasta do build clique em jdom.jar e em Abrir. Voc&ecirc; tem de seguir estas etapas sempre que desejar adicionar um arquivo .jar de terceiros ou seu pr&oacute;prio aos recursos do projeto.
</p>
	</li>

	<li>
<p>
Voc&ecirc; tamb&eacute;m vai precisar de alguns arquivos .gif, um arquivo de propriedades e de um arquivo xml. Os gifs s&atilde;o usados com &iacute;cones de folha com objetos JTree. Voc&ecirc; pode criar seus pr&oacute;prios ou usar os que acompanham este tutorial. Criar arquivos xml e de propriedades &eacute; muito f&aacute;cil com o NetBeans, como veremos mais adiante. Caso tenha estes arquivos, copie os mesmos em sua pasta do projeto. Verifique se eles est&atilde;o presentes na vista Arquivo do projeto ap&oacute;s copiar.
</p>
	</li>

</ol>
</p>
<h2><a name="createxml"></a>Criando o arquivo xml e de propriedades para o projeto</h2>

<ol>
	<li>
<p>

Clique com o bot&atilde;o direito do mouse no nome do projeto na aba Projeto no IDE, e escolha Novo &gt; Arquivo/Pasta. Sob Categorias escolha XML, e clique em Documento XML como o tipo de arquivo. Clique em Pr&oacute;ximo. Digite querymapping como o nome do arquivo e deixe o local vazio. Portanto, o arquivo ser&aacute; colocado diretamente sob sua pasta do projeto. Clique em Pr&oacute;ximo. Na p&aacute;gina Selecionar tipo de documento deixe marcado Documento bem formado. Clique em Terminar. 
</p>
	</li>
	<li>
<p>
Se tudo correu bem, agora seu documento xml est&aacute; na moldura do editor. Este documento &eacute; importante para seu aplicativo. Tenha cuidado ao edit&aacute;-lo. Primeiro altere o elemento raiz, como segue: <pre>&lt;query-mapping&gt;</pre> Para facilitar voc&ecirc; pode usar o xml que acompanha este tutorial. Aqui est&aacute; uma pequena parte do mesmo:
<pre class="examplecode">
&lt;query-mapping&gt;
	&lt;query name=&quot;sql.crosstable.afterdate&quot; desc=&quot;Select users entered after a specified date&quot;&gt;

		&lt;app-section name=&quot;Newly Ones' Blackboard&quot; call=&quot;on-submit-form&quot;&gt;
                    	&lt;datasource src=&quot;Parameterizer.java&quot; /&gt;
                    	&lt;setter src=&quot;DoQuery.java&quot; /&gt;
                    	&lt;processor src=&quot;DoQuery.java&quot; /&gt;
                &lt;/app-section&gt;
 	&lt;/query&gt;

		...

	</pre>
Ao editar n&atilde;o se esque&ccedil;a de ir salvando. Este documento xml descreve se&ccedil;&otilde;es do aplicativo - ou seja, a estrutura de menus - e sua conex&atilde;o com declara&ccedil;&otilde;es sql, java, jsp e arquivos html. Estudo isso um pouco - os nomes s&atilde;o auto-descritivos.
</p>
	</li>
	<li>
<p>
Agora vamos criar nosso arquivo de propriedades no qual as declara&ccedil;&otilde;es sql s&atilde;o coincididas com nomes de propriedades simb&oacute;licas. Voc&ecirc; pode usar o arquivo que acompanha este tutorial. Clique com o bot&atilde;o direito do mouse no nome do projeto na aba Projeto, clique em Novo, Arquivo/Pasta, sob Categorias clique em Outra e deixe os tipos de arquivos como Arquivo de propriedades. Clique em Pr&oacute;ximo. Digite query como o nome do arquivo e deixe vazia a caixa Pasta. Clique em Terminar. Seu arquivo de propriedades ser&aacute; criado diretamente sob sua pasta do projeto. Sob a vista Arquivos no IDE, voc&ecirc; pode clicar duas vezes em seu nome e come&ccedil;ar a editar. Clique com o bot&atilde;o direito do mouse na linguagem padr&atilde;o, e a seguir em Adicionar propriedade. Na caixa di&aacute;logo suspensa que vir&aacute;, voc&ecirc; pode criar os pares necess&aacute;rios de chave-valor para declara&ccedil;&otilde;es sql. N&atilde;o se esque&ccedil;a de salvar seu trabalho com frequ&ecirc;ncia.
</p>
	</li>

</ol>
<a name="javaclasses">Criando classes Java</a>


<ol>
	<li>
<p>
Voc&ecirc; tem a escolha de adicionar arquivos existentes de c&oacute;digo-fonte em seu projeto. Caso deseje ir mais fundo no c&oacute;digo, voc&ecirc; pode usar os c&oacute;digo-fonte que acompanha este tutorial. Neste caso, voc&ecirc; copia os arquivos necess&aacute;rios com seu diret&oacute;rio contidos sob sua pasta src do projeto. Tenha cuidado com pacotes e sua estrutura coincidente de diret&oacute;rios. A maneira mais segura e elegante de criar uma nova classe &eacute; a de clicar duas vezes no nome do projeto, escolher Novo &gt; Arquivo/Pasta, e a seguir clicar em Classe Java sob categorias e tipo de arquivo. Nesta tela sempre temos a escolha de criar uma classe sob um novo pacote. Nosso projeto usa dos pacotes pr&oacute;prios definidos: com.zsoltkiss.qmt e com.zsoltkiss.qmt.util. A estrutura de pastas que coincide com esta hierarquia &eacute; sempre criada sob a pasta src do projeto.
</p>
	</li>
	<li>
<p>
Uma vez criadas as classes necess&aacute;rias, voc&ecirc; pode digitar o c&oacute;digo-fonte ou copiar-colar os mesmos do c&oacute;digo-fonte que acompanha este tutorial.
</p>
	</li>

</ol>
<h2><a name="compileandrun">Compilar e executar o projeto</a></h2>

<ol>
	<li>
<p>
A maneira mais f&aacute;cil para mim de compilar &eacute; Limpar e compilar, e sempre use Shift+F11. Isso depende do desenvolvedor. Os que preferem passar o mouse para digitar, usam a barra de menus do IDE e acionam a fun&ccedil;&atilde;o ao clicar no &iacute;cone Limpar e compilar ou a partir do menu Compilar. Voc&ecirc; pode ver as mensagens do tempo de compila&ccedil;&atilde;o do IDE na janela de sa&iacute;da, que pode ser ativa por Ctrl+4 se estiver oculta.
</p>
	</li>
	<li>
<p>
Se a compila&ccedil;&atilde;o e o build tiveram &ecirc;xito, &eacute; poss&iacute;vel executar o projeto com F6 ou ao clicar em seu &iacute;cone ou ao escolher o menu Executar.
</p>

	</li>

</ol>
<h2><a name="runwithargs"></a>Como executo o projeto com argumentos da linha de comando</h2>
<ol>
	<li>
<p>
O uso de arquivos de propriedades e xml que residem na pasta de seu projeto nem sempre &eacute; uma boa solu&ccedil;&atilde;o. Caso voc&ecirc; tenha arquivos em um caminho alterado, &eacute; preciso executar a classe principal do projeto com par&acirc;metros na linha de comando. Teste o mesmo! Remova o query.properties e/ou querymapping.xml da pasta do projeto e tente executar o aplicativo. N&atilde;o obteve &ecirc;xito, correto?
</p>
	</li>
	<li>
<p>
Agora, coloque os arquivos que foram removidos em um diret&oacute;rio em algum lugar de seu disco r&iacute;gido que n&atilde;o seja a pasta de seu projeto. No NetBeans IDE, na janela Projeto, clique com o bot&atilde;o direito do mouse no nome do projeto, escolha Propriedades, e a seguir Executar projeto. No painel direito da janela, digite em Argumentos os caminhos apropriados para os diret&oacute;rios para onde moveu os arquivos de propriedade e xml. Para o primeiro, digite o caminho para o arquivo de propriedades, e a seguir digite um espa&ccedil;o no fim e digite o caminho para o arquivo xml. Clique em OK e execute o projeto com F6. Agora obteve &ecirc;xito. 
</p>
	</li>
</ol>
</td>
    </tr>
    <tr>
	<td>
Espero que voc&ecirc; tenha constru&iacute;do com &ecirc;xito o aplicativo Query Mapper Tool, que tenha seguido as etapas anteriores e que agora esteja experimentando-a um pouco. Tentei escrever um c&oacute;digo completamente comentado, portanto, n&atilde;o vou entrar em mais detalhes. Com o uso da ferramenta, &eacute; poss&iacute;vel entender com facilidade seu funcionamento e os arquivos de propriedades e xml, para que possa desenvolver sua pr&oacute;pria vers&atilde;o, caso seja necess&aacute;rio. Como qualquer pessoa sempre pode tornar um aplicativo melhor, queria apenas dar uma id&eacute;ia. Realmente, as possibilidades s&atilde;o infinitas. Por exemplo, com algum esfor&ccedil;o ela poderia ser unida com um editor, a partir do qual o usu&aacute;rio poderia abrir os arquivos diretamente para edi&ccedil;&atilde;o.<br>  De qualquer forma o problema ainda est&aacute; l&aacute; - todos os dias o enfrento. Talvez seria realmente v&aacute;lido escrever uma ferramenta robusta e confort&aacute;vel para solucionar isso. Ou tornar este tipo de ferramenta parte do NetBeans?<br><br></td>
    </tr>
  </tbody>

</table>
</div>
</body>
</html>