<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Tutorial do J2ME MIDP RSS Reader para o NetBeans 4.0</title>
<META NAME="description" CONTENT="How to create a J2ME MIDP RSS Reader application with NetBeans 4.0">
<META NAME="AUDIENCE" CONTENT="NBUSER">
<META NAME="TYPE" CONTENT="ARTICLE">
<META NAME="TOPIC" CONTENT="ADVANCED">
<link rel="stylesheet" type="text/css" href="../../netbeans.css">

</head>
<body>


			<h1>Como criar um aplicativo J2ME MIDP RSS Reader com o NetBeans 4.0</h1>
<div class="articledate" style="margin-left:0px;">Contribui&ccedil;&atilde;o de Tommi Laukkanen como parte da competi&ccedil;&atilde;o <a href="../../competition/win-with-netbeans.html">Win With NetBeans</a></div></p>
			<p>
        Este tutorial ir&aacute; mostrar como criar um aplicativo J2ME MIDP RSS com o NetBeans 4.0. Com o RSS Reader, &eacute; poss&iacute;vel ler alimenta&ccedil;&otilde;es RSS com seu dispositivo m&oacute;vel. Este aplicativo est&aacute; projetado para trabalhar com o MIDP 1.0, portanto, ele &eacute; tamb&eacute;m compat&iacute;vel com dispositivos mais antigos. 
			</p>
      <p>
        Caso seja novo com o RSS, ele significa <b>R</b>eally <b>S</b>imple <b>S</b>yndication. O RSS &eacute; um formato XML de formato leve projetados para compartilhar manchetes e outros blogs e not&iacute;cias de conte&uacute;do. Voc&ecirc; pode, por exemplo, obter as not&iacute;cias mais recentes do NetBeans.org como uma alimenta&ccedil;&atilde;o RSS <a href="https://netbeans.org/rss-091.xml">daqui</a>. 
      </p>

      <p>
        Aqui est&atilde;o algumas capturas de tela deste aplicativo em a&ccedil;&atilde;o:<br/>
        <table summary="Screenshots" class="b-none">
        <tr>
          <td><img src="../../images_www/articles/win-with-netbeans/pic1_launch.png" alt="Iniciar" border="1" /></td>
          <td><img src="../../images_www/articles/win-with-netbeans/pic2_bookmarks.png" alt="Bookmarks" border="1" /></td>
          <td><img src="../../images_www/articles/win-with-netbeans/pic3_loading.png" alt="Carregando" border="1" /></td>
	</tr>
 <tr>
          <td>&Iacute;cone Iniciar</td>
          <td>Lista de bookmarks</td>
          <td>Formul&aacute;rio de carga</td>
	</tr>

	<tr>
          <td><img src="../../images_www/articles/win-with-netbeans/pic4_headers.png" alt="Cabe&ccedil;alhos" border="1" /></td>
          <td><img src="../../images_www/articles/win-with-netbeans/pic5_topic.png" alt="T&oacute;pico" border="1" /></td>
	  <td></td>
        </tr>
       	<tr>
          <td>Lista de cabe&ccedil;alhos</td>
          <td>Formul&aacute;rio do t&oacute;pico</td>
	  <td></td>
        </tr>        
        </table>
      </p>
      <p>
        Este tutorial cobre estes assuntos:
        <ul>
        <li>Criando novo projeto de aplicativo m&oacute;vel com o NetBeans 4.0</li>
        <li>Configurando seu projeto do NetBeans 4.0 para permitir o uso de bibliotecas de terceiros (exemplo, kXML 2)</li>

        <li>Usando o obsfucador para reduzir o tamanho do arquivo jar distribu&iacute;vel com o NetBeans 4.0</li>
        <li>Executando o aplicativo m&oacute;vel no emulador com o NetBeans 4.0</li>
        </ul>
      </p>
      <h2>Projetando o aplicativo</h2>
      <div class='indent'>
			<p>
				 O projeto tem cinco arquivos de c&oacute;digo-fonte: <br/></p>

         <ul>
				 <li><tt>RssFeed.java</tt>, o c&oacute;digo para a classe de alimenta&ccedil;&atilde;o RSS</li>
         <li><tt>RssItem.java</tt>, o c&oacute;digo para a classe de item de alimenta&ccedil;&atilde;o RSS</li> 
         <li><tt>RssFeedParser.java</tt>, o c&oacute;digo para a classe de analisador da alimenta&ccedil;&atilde;o RSS</li>
         <li><tt>Settings.java</tt>, o c&oacute;digo para a classe do utilit&aacute;rio de configura&ccedil;&otilde;es</li>

         <li><tt>RssReaderMIDlet.java</tt>, o c&oacute;digo para a classe MIDlet</li>
         </ul>
         <p>
            Este tutorial n&atilde;o ir&aacute; explicar em profundidade a funcionalidade de cada classe. Voc&ecirc; pode adquirir os arquivos de c&oacute;digo-fonte <a href="https://netbeans.org/files/documents/4/308/RssReader_src.zip">aqui</a>.
         </p>
	 </div>
         <h2>Requisitos</h2>
	 <div class='indent'>
		 <p>

        &Eacute; preciso tem o NetBeans IDE 4.0 e o NetBeans Mobility Pack 4.0 instalados antes de poder iniciar o desenvolvimento J2ME MIDP. Consulte a p&aacute;gina de download do J2ME MIDP Development para obter instru&ccedil;&otilde;es de como baixar e instalar todo o ambiente. Tamb&eacute;m ser&aacute; preciso baixar a biblioteca de classe m&oacute;vel <a href="http://www.kxml.org">kXML</a>. A vers&atilde;o mais recente da biblioteca no momento da reda&ccedil;&atilde;o era a 2.1.9. Voc&ecirc; pode baixar a vers&atilde;o mais recente da kXML <a href="http://sourceforge.net/project/showfiles.php?group_id=9157">aqui</a>. Baixe o kxml2-min.jar para qualquer pasta em seu computador.
			</p>
			</div>
			<h2>Criando um projeto de biblioteca de classe m&oacute;vel</h2>
			<div class='indent'>
			<p>
				<h3 class='tutorial'>Criar um novo projeto de aplicativo m&oacute;vel</h3>
							<ol>
								<li><p>Escolha Arquivo &gt; Novo projeto (Ctrl-Shift-N). Em Categorias, selecione <i>M&oacute;vel</i></p></li>
								<li><p>Selecione <i>Aplicativo m&oacute;vel</i> em Projetos. Clique em Pr&oacute;ximo.</p></li>

								<li><p>Em Nome do projeto, digite <tt>RSS Reader</tt>.</p></li>
								<li><p>Altere o local do projeto para qualquer pasta do computador.</p></li>
                <li><p>Selecione a caixa de sele&ccedil;&atilde;o <tt>Definir como projeto principal</tt>.</p></li>
                <li><p>Cancele a sele&ccedil;&atilde;o da caixa de sele&ccedil;&atilde;o <tt>Criar MIDlet Al&ocirc;</tt>.</p></li>

								<li><p>Clique em Terminar. </p></li>
                <p>Agora o n&oacute; do projeto na janela Projetos deveria se parecer com:</p>
                <img src="../../images_www/articles/win-with-netbeans/pic7_project.png" alt="N&oacute; do projeto" border="1" />
							</ol>
						<h3 class='tutorial'>Criar novos pacotes Java para arquivos de c&oacute;digo-fonte e &iacute;cone do aplicativo</h3>
							<ol>
								<li><p>Clique com o bot&atilde;o direito do mouse no n&oacute; do projeto RSS Reader na janela Projetos e selecione Novo &gt; Pacote Java.</p></li>
                <p><img src="../../images_www/articles/win-with-netbeans/pic8_package.png" alt="" border="1" /></p>
								<li><p>Em Nome do pacote, digite <tt>RssReader</tt>.</p></li>
								<li><p>Clique em Terminar. </p></li>

                <li><p>Repita as a&ccedil;&otilde;es anteriores e adicione o pacote <tt>icons</tt>.</p></li>
  							<p>
                  Agora voc&ecirc; tem os pacotes necess&aacute;rios para os arquivos de c&oacute;digo-fonte e para os &iacute;cones do aplicativo.
  							</p>
                <p><img src="../../images_www/articles/win-with-netbeans/pic9_packages.png" alt="" border="1" /></p>
							</ol>
						<h3 class='tutorial'>Configurar o projeto</h3>
							<ol>
								<li><p>Clique com o bot&atilde;o direito do mouse no n&oacute; do projeto RSS Reader na janela Projetos e selecione Propriedades.</p></li>
								<li><p>Selecione Descritor do aplicativo &gt; Atributos.</p></li>

								<li><p>Selecione a linha MIDlet-Vendor na lista Atributos gerais e clique em Editar.</p></li>
                <li><p>Em Valor, digite seu pr&oacute;prio nome.</p></li>
                <li><p>Feche a janela de edi&ccedil;&atilde;o ao clicar no bot&atilde;o OK.</p></li>
                <p>Agora vamos adicionar uma refer&ecirc;ncia &agrave; biblioteca kXML, que voc&ecirc; baixou para seu computador.</p>
                <li><p>Selecione Build &gt; Bibliotecas e recursos.</p></li>
                <li><p>Clique em Adicionar Jar/Zip.</p></li>

                <li><p>Navegue para o arquivo kxml2-min.jar baixado.</p></li>
  							<p>
                  Agora voc&ecirc; adicionou a refer&ecirc;ncia &agrave; biblioteca kXML e pode usar o analisador kXML em seu aplicativo.
  							</p>
							</ol>
						<h3 class='tutorial'>Criando os arquivos de c&oacute;digo-fonte</h3>
							<ol>
                <p>
                Agora vamos criar o c&oacute;digo-fonte para este projeto. Voc&ecirc; deveria ter baixado os arquivos existentes de c&oacute;digo-fonte, como mencionado na se&ccedil;&atilde;o de requisitos. Agora dever&aacute; mov&ecirc;-los para a subpasta <tt>src/RssReader</tt> da sua pasta do projeto.
                </p>
                <p>
                Ap&oacute;s ter copiado os arquivos de c&oacute;digo-fonte na pasta RssReader, o pacote RssReader da janela Projetos deveria se parecer igual a figura abaixo. Pode levar alguns segundos para atualizar o conte&uacute;do de pacotes na janela Projetos.        
                </p>

                <p><img src="../../images_www/articles/win-with-netbeans/pic10_addfiles.png" alt="Adicionar arquivos" border="1" /></p>
                <p>
                Caso ainda n&atilde;o tenha o c&oacute;digo-fonte pronto, use os recursos de Nova &gt; Classe Java ou Novo &gt; Midlet, e escrever seu pr&oacute;prio c&oacute;digo.
                </p> 
							</ol>
						<h3 class='tutorial'>Adicionar um &iacute;cone para seu aplicativo</h3>
							<ol>
                <p>
                Agora vamos adicionar um &iacute;cone para seu aplicativo m&oacute;vel.
                </p>
                <li><p>Clique com o bot&atilde;o direito do mouse na figura abaixo e baixe a mesma para a subpasta src/icons/ do projeto RSS Reader.</p></li>
                <p><img src="../../images_www/articles/win-with-netbeans/rss.png" alt="&Iacute;cone do aplicativo" border="1"  /></p>
								<li><p>Clique com o bot&atilde;o direito do mouse no n&oacute; do projeto RSS Reader na janela Projetos e selecione Propriedades.</p></li>

                <li><p>Selecione Descritor do aplicativo &gt; MIDlets.</p></li>
                <li><p>Clique em Adicionar.</p></li>
                <p>O NetBeans IDE &eacute; suficientemente inteligente para preencher os campos, e voc&ecirc; somente precisa selecionar o &iacute;cone que deseja que seu aplicativo tenha.</p>
                <li><p>Em &Iacute;cone MIDlet, selecione <tt>/icons/rss.png</tt>.</p></li>
                <p><img src="../../images_www/articles/win-with-netbeans/pic11_addmidlet.png" alt="Adicionar MIDlet" class="b-none"  /></p>
                <li><p>Feche ambas as janelas ao clicar no bot&atilde;o OK.</p></li>

							</ol>
						
			</p>
			</div>
			<h2>Usando a Obsfuca&ccedil;&atilde;o para reduzir o tamanho do arquivo MIDlet</h2>
			<div class='incent'>
			<p>
				<h3 class='tutorial'>Construindo o projeto</h3>
							<ol>
                <p>Agora vamos construir o projeto.</p>
                <li><p>Pressione F11 para construir seu projeto.</p></li>
                <p>Alternativamente, voc&ecirc; pode selecionar <tt>Build &gt; Build projeto principal</tt> no menu principal.</p>

                <li><p>Clique com o bot&atilde;o direito do mouse em RSS_Reader.jar na janela Arquivos e selecione Propriedades.</p></li>
                <p><img src="../../images_www/articles/win-with-netbeans/pic12_files.png" alt="Arquivos" border="1"  /></p>
                <p>Observe que o tamanho do arquivo jar &eacute; de quase 24kb.</p>
                <p><img src="../../images_www/articles/win-with-netbeans/pic13_jarsize.png" alt="Tamanho jar" class="b-none"  /></p>
                <li><p>Clique com o bot&atilde;o direito do mouse no n&oacute; do projeto RSS Reader e selecione Propriedades.</p></li>
                <li><p>Selecione Build &gt; Obsfuca&ccedil;&atilde;o.</p></li>
                <li><p>Deslize o N&iacute;vel de obsfuca&ccedil;&atilde;o para o valor m&aacute;ximo (=Alta).</p></li>

                <li><p>Clique no bot&atilde;o OK.</p></li>
                <li><p>Reconstrua o aplicativo pressionando F11.</p></li>
                <li><p>Clique com o bot&atilde;o direito do mouse em RSS_Reader.jar na janela Arquivos e selecione Propriedades.</p></li>
                <p>Observe que o tamanho do arquivo jar foi reduzido para 15kb bytes.</p>
                <p><img src="../../images_www/articles/win-with-netbeans/pic14_jarsize.png" alt="Tamanho jar" border="1"  /></p>
                <p>
                O uso de mem&oacute;ria em dispositivos m&oacute;veis menores &eacute; uma quest&atilde;o cr&iacute;tica, portanto, a obsfuca&ccedil;&atilde;o &eacute; uma parte muito importante do desenvolvimento do aplicativo m&oacute;vel. N&oacute;s agora economizamos quase 10 kb de mem&oacute;ria somente ao mudar as configura&ccedil;&otilde;es do obsfucador em nosso NetBeans IDE.  
                </p> 
							</ol>

						
			</p></div>
			<h2>Usando o emulador</h2>
			<div class='indent'>
			<p>
				<h3 class='tutorial'>Executar o projeto</h3>
							<ol>
								<li><p>Pressione F6 para executar o projeto principal.</p></li>
                <p>
                Alternativamente, voc&ecirc; pode selecionar <tt>Executar &gt; Executar o projeto principal</tt>
                </p>

                <li><p>Pressione o bot&atilde;o <tt>Iniciar</tt> no emulador padr&atilde;o.</li>
                <p>
                    O RSS Reader est&aacute; agora em execu&ccedil;&atilde;o e voc&ecirc; pode us&aacute;-lo para ver alimenta&ccedil;&otilde;es RSS. As capturas de tela a seguir foram tiradas de um emulador Sony Ericsson.
                </p>
							</ol>
						
            				<table class="b-none">
            				    <tr>
                                    <td><img src="../../images_www/articles/win-with-netbeans/pic1_launch.png" alt="Iniciar" border="1" /></td>
                                    <td><img src="../../images_www/articles/win-with-netbeans/pic2_bookmarks.png" alt="Bookmarks" border="1" /></td>
                                    <td><img src="../../images_www/articles/win-with-netbeans/pic3_loading.png" alt="Carregando" border="1" /></td>
                                   </tr>
				<tr>
                                  <td>&Iacute;cone Iniciar</td>
                                  <td>Lista de bookmarks</td>
                                  <td>Formul&aacute;rio de carga</td>
				  </tr>
				
				   <tr>
				    <td><img src="../../images_www/articles/win-with-netbeans/pic4_headers.png" alt="Cabe&ccedil;alhos" border="1" /></td>
				    <td><img src="../../images_www/articles/win-with-netbeans/pic5_topic.png" alt="T&oacute;pico" border="1" /></td>
				    <td></td>
                                </tr>
                                  <tr>
                                  <td>Lista de cabe&ccedil;alhos</td>
                                  <td>Formul&aacute;rio do t&oacute;pico</td>
				  <td></td>
                                </tr>    
                            </table>
                       
			</p></div>
			<h2>Fim.</h2>
			<div class='indent'>
			<p>
				<h3 class='tutorial'>Conclus&atilde;o e id&eacute;ias de desenvolvimento </h3>
              <p>
              Isso conclui o tutorial do J2ME MIDP RSS Reader. Agora voc&ecirc; pode continuar a desenvolver este aplicativo ao adicionar novos recursos. Voc&ecirc; poderia, por exemplo, adicionar o suporte para alimenta&ccedil;&otilde;es Atom XML. Me mantenha informado sobre o que voc&ecirc; vier a fazer com esse c&oacute;digo :-)
              </p>
						
			</p>
			</p>
      <p>

      </p>
		</div>
</body>
</html>

