<html>
  <head>
    <title>A Oracle apresenta o NetBeans IDE 7.1: Fornece o suporte para JavaFX 2.0</title>
    <meta name="description" content="Oracle Previews NetBeans IDE 7.1: Delivers Support for JavaFX 2.0 : NetBeans Press Release 2011-10-04">
    <link rel="stylesheet" type="text/css" href="/netbeans.css">
    
<!-- ====================================================== -->
<!-- Please do not edit this file by hand, it is rebuilt    -->
<!-- automatically and your changes will be lost.  Contact  -->
<!-- webmaster for details.  Rebuilt at                     -->
<!-- #TIMESTAMP# 06 Oct 2011 13:10 CEST                      -->
<!-- ====================================================== -->
  </head>
<body>

<h1>Comunicado &agrave; Imprensa</h1>
<p><b>A Oracle apresenta o NetBeans IDE 7.1: Fornece o suporte para JavaFX 2.0</b>
<div class="articledate" style="margin-left:0px;">04 de outubro de 2011</div>
<div class="articledate" style="margin-left:0px;">Introdu&ccedil;&atilde;o inicial em : : <a href="http://www.oracle.com/us/corporate/press/513016">http://www.oracle.com/us/corporate/press/513016</a></div>
<div class="articledate" style="margin-left:0px;">Comunica&ccedil;&otilde;es Corporativas da Oracle</div>
<p><center><hr width="80%" noshade size="1"></center><p>
<H1>A Oracle apresenta o NetBeans IDE 7.1: Fornece o suporte para JavaFX 2.0</H1>
<br>
<b>A nova vers&atilde;o ganha momento j&aacute; que o NetBeans alcan&ccedil;a um milh&atilde;o de usu&aacute;rios ativos</b>
<br><br>
JAVAONE, S&Atilde;O FRANCISCO &ndash; 4 de outubro de 2011
<br><br>
<b>Fatos de Not&iacute;cia</b><br><br>
<li>Para demonstrar o continuado &ecirc;xito e expans&atilde;o do Ambiente Integrado de Desenvolvimento do NetBeans (IDE), a Oracle anunciou hoje o forte crescimento da comunidade de desenvolvedores do NetBeans e a disponibilidade da vers&atilde;o Beta do NetBeans IDE 7.1.
<li>O NetBeans IDE agora tem mais de um milh&atilde;o de usu&aacute;rios ativos com os desenvolvedores aumentando sua sele&ccedil;&atilde;o do NetBeans IDE para criar com rapidez aplicativos de desktop, Web e m&oacute;veis, usando a Plataforma Java, assim como o PHP, JavaScript e Ajax e o C/C++.
<li>O NetBeans IDE est&aacute; dispon&iacute;vel para o Windows, Mac, Linux e Oracle Solaris, e &eacute; o primeiro IDE a suportar as especifica&ccedil;&otilde;es e padr&otilde;es mais recentes da Plataforma Java. Para estender o suporte para os padr&otilde;es Java, a Vers&atilde;o Beta do NetBeans IDE 7.1 fornece o suporte para o JavaFX 2.0, permitindo o completo ciclo de desenvolvimento de compila&ccedil;&atilde;o, depura&ccedil;&atilde;o e perfilamento para aplicativos JavaFX 2.0.
<li>A vers&atilde;o mais recente do IDE 7.0, &eacute; o primeiro IDE a fornecer o completo suporte para o JDK 7, tornando conveniente aos desenvolvedores adaptarem a base de seu c&oacute;digo existente para utilizar os recursos novos e aprimorados da especifica&ccedil;&atilde;o JDK 7.
<li>O NetBeans IDE 7.0 tamb&eacute;m oferece a integra&ccedil;&atilde;o aprimorada como o Oracle WebLogic Server 11g e o suporte Java EE 6 l&iacute;der da ind&uacute;stria para o Oracle Database, GlassFish Server Open Source Edition 3.1e o Oracle GlassFish Server 3.1.
<li>A Vers&atilde;o Beta do NetBeans IDE 7.1 est&aacute; dispon&iacute;vel aqui para download. Termos, condi&ccedil;&otilde;es e restri&ccedil;&otilde;es se aplicam.
<li>A Oracle est&aacute; efetuando apresenta&ccedil;&otilde;es do NetBeans IDE no JavaOne 2011 em mais de 25 sess&otilde;es combinadas de confer&ecirc;ncias, BOFs e Laborat&oacute;rios Pr&aacute;ticos, assim como no JavaOne Exhibition Hall.
<br><br>
<b>Declara&ccedil;&otilde;es de Apoio</b>
<br>
<li>&quot;O crescimento da base de desenvolvedores do NetBeans &eacute; o resultado dos muitos aprimoramentos que a comunidade criou para o NetBeans IDE,” afirmou Ted Farrell, Arquiteto Chefe e Vice-presidente S&ecirc;nior, Ferramentas e Middleware, Oracle. “Ao oferecer com rapidez o suporte para as especifica&ccedil;&otilde;es e padr&otilde;es mais recentes, o, NetBeans est&aacute; movendo a ind&uacute;stria, permitindo que os desenvolvedores tirem vantagem dos avan&ccedil;os na plataforma para desenvolver melhor e mais r&aacute;pido aplicativos desktop, Web e m&oacute;veis com base no Java”.
<li>“Quando n&oacute;s selecionamos o NetBeans IDE como a plataforma para a pr&oacute;xima gera&ccedil;&atilde;o de nosso MPLAB&reg; X IDE l&iacute;der da ind&uacute;stria&ndash; que foi projetado para desenvolver aplicativos incorporados utilizando os microcontroladores PIC&reg; e dsPIC&reg; da Microchip &ndash; n&oacute;s sab&iacute;amos que est&aacute;vamos usando o melhor IDE de c&oacute;digo-fonte aberto,” afirmou Derek Carlson, Vice-presidente de Ferramentas de Desenvolvimento da Microchip Technology Inc. “N&oacute;s estamos excitados com as oportunidades que o NetBeans IDE 7.1 oferece, j&aacute; que ele de distingue mais ainda nas comunidades de c&oacute;digo-fonte aberto e de projetos incorporados”.
<br><br>
<b>Recursos de Apoio</b>
<br>
NetBeans IDE Documenta&ccedil;&atilde;o do NetBeans e Ferramentas de Desenvolvimento no Portal da Oracle da Comunidade NetBeans de Recursos
<br><br>
<b>Sobre o JavaOne</b>
<br>
O JavaOne em S&atilde;o Francisco retorna para a regi&atilde;o de 2 a 6 de outubro, uma vizinhan&ccedil;a amig&aacute;vel ao desenvolvedor. No cora&ccedil;&atilde;o da regi&atilde;o encontra-se o Mason Street Cafe, um playgroung e lounge em todo um bloco circundado por hot&eacute;is JavaOne (o Hilton San Francisco Union Square, Hotel Nikko e o Parc 55 Wyndham). O JavaOne junta renomados especialistas e entusiastas por uma extraordin&aacute;ria semana de aprendizado e compartilhamento focado inteiramente em todas as coisas do Java e para mover adiante a plataforma de desenvolvimento n&uacute;mero um. Com ias de 400 sess&otilde;es cobrindo os t&oacute;picos que se expandem no universo Java, palestras dos maiores vision&aacute;rios do Java, e a condu&ccedil;&atilde;o de atividades dirigidas aos desenvolvedores, o JavaOne &eacute; o evento mundial mais importante para a comunidade Java. Para obter mais informa&ccedil;&otilde;es, visite: www.oracle.com/JavaOne.
<br><br>
<b>Sobre a Oracle</b>
<br>
A Oracle (NASDAQ: ORCL) &eacute; a empresa mundial mais completa de sistemas de software administrativo e hardware completos, abertos e integrados. Para obter informa&ccedil;&otilde;es sobre a Oracle, visite nosso site na Web em http://www.oracle.com.
<br><br>
<b>Marcas Comerciais Registradas</b>
<br>
<i>Oracle e Java s&atilde;o marcas comerciais registradas da Oracle Corporation e/ou de suas empresas afiliadas. Outros nomes podem ser marcas comerciais de seus respectivos propriet&aacute;rios.</i>
<p><center><hr width="80%" noshade size="1"></center><p>
<p><a href="releases.html">Voltar para Arquivos da Imprensa</a>

</body>
</html>
