<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Troque para o NetBeans IDE</title>
  <meta name="description" content="Switch to NetBeans IDE">
  <meta http-equiv="content-type" content="text/html; charset=UTF-8">
  <link rel="stylesheet" type="text/css" href="../netbeans.css">
</head>
<body>
<h1>Troque para o NetBeans IDE</h1>
Mais e mais desenvolvedores est&atilde;o trocando para o NetBeans IDE e tirando vantagem de todos os recursos dispon&iacute;veis imediatamente. N&oacute;s, a Equipe do NetBeans, poder&iacute;amos facilmente dizer o porque do NetBeans IDE ser uma &oacute;tima ferramenta, mas porque n&atilde;o ouvir de seus pares? Leia as est&oacute;rias de desenvolvedores que fizeram a troca. Saiba porque esles trocaram, como o NetBeans IDE aprimora sua produtividade e qu&atilde;o f&aacute;cil &eacute; fazer a troca!
<br>
<div style="text-align: center;">
<div style="text-align: center;"> <a
 href="https://netbeans.org/downloads/index.html"><img
 src="../images_www/v6/dl-nb-ide.gif" alt="Fa&ccedil;a o download agora"
 style="border: 0px solid ; width: 242px; height: 27px;"></a></div>
</div>
<p></p>
<br>
<h2>Porque trocar para o NetBeans IDE</h2>
O NetBeans IDE fornece um rico conjunto de recursos e um ambiente de trabalho mais produtivo do que outro IDE. E, ele apenas funciona: voc&ecirc; n&atilde;o tem de gastar tempo valioso de desenvolvimento procurando por plug-ins. O NetBeans IDE permite criar aplicativos estado da arte, sejam eles independentes, da Web, m&oacute;veis ou J2EE.<br>
<br>
Leia as<a href="why.html">Raz&otilde;es principais para trocar para o NetBeans IDE</a>.<br>
<br>
<div align="center">
<p><a href="../kb/docs/intro-screencasts.html"><img
 alt="V&iacute;deo de Vis&atilde;o Geral do NetBeans" title="V&iacute;deo de Vis&atilde;o Geral do NetBeans"
 src="../images_www/v7/nb70-video-thumb.png"
 style="border: 0px solid ; width: 130px; height: 126px;"><br>
Porque o NetBeans IDE?</a><br>
Assista aos v&iacute;deos do NetBeans em a&ccedil;&atilde;o!</p>
</div>
<h2>Ou&ccedil;a de pessoas que est&atilde;o trocando</h2>
<p> N&oacute;s ouvimos de muitas pessoas que est&atilde;o trocando de outros IDEs. Leia suas est&oacute;rias verdadeiras e saiba porque elas est&atilde;o fazendo a troca. <br>
</p>
<ul>
  <li><span style="text-decoration: underline;"></span><a
 href="../switch/realstories.html">Est&oacute;rias reais de desenvolvedores</a> </li>
  <li><a href="../features/ide/testimonials.html">Testemunhos de desenvolvedores</a></li>
</ul>
<br>
<h2>Fa&ccedil;a a troca para o NetBeans</h2>
Como resposta direta as demandas dos desenvolvedores por uma f&aacute;cil migra&ccedil;&atilde;o do Eclipse e outros IDEs, o NetBeans oferece o M&oacute;dulo de Importa&ccedil;&atilde;o de Projeto Eclipse para uma transi&ccedil;&atilde;o simples e f&aacute;cil de implementar de projetos com base no Eclipse para o NetBeans IDE.<br>
<br>
Leia mais em <a href="make-the-switch.html">Como fazer a troca</a>.<br>
<br>
<h2>Juntes-se a Comunidade NetBeans</h2>
H&aacute; diversas coisas boas acontecendo na Comunidade NetBeans. Para que voc&ecirc; esteja a par dos desenvolvimento mais recentes, &eacute; poss&iacute;vel verificar o <a
 href="https://netbeans.org/community/releases/roadmap.html">Mapa do caminho do NetBeans</a>, assinar para a <a
 href="https://netbeans.org/community/news/newsletter/">Newsletter do NetBeans</a>, e se conectar com outros desenvolvedores. Voc&ecirc; tamb&eacute;m pode fazer parte da a&ccedil;&atilde;o ao contribuir com a Comunidade do NetBeans- escrevedo c&oacute;digo, desenvolvendo plug-ins, submentendo tutoriais, registrando quest&otilde;es t&eacute;cnicas nas listas de correio, e mais.<br>
&nbsp;<br>
Leia mais na <a href="../community/index.html">p&aacute;gina Comunidade NetBeans</a>.
</body>
</html>
