<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>



  
  
  
  
  
  
  
  
  
  
  
  
  
  <title>Trocar para o NetBeans IDE: Est&oacute;rias reais de desenvolvedores</title>














  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta name="NAV_LINK" content="Real Stories">














  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta name="NAV_PRIORITY" content="2">













  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta name="description" content="Switch to NetBeans: Real Stories">














  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta http-equiv="content-type" content="text/html; charset=UTF-8">













  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <link rel="stylesheet" type="text/css" href="../netbeans.css">














</head><body>
<h1>Est&oacute;rias reais de pessoas trocando para o NetBeans IDE!</h1>














<p>Muitos desenvolvedores est&atilde;o migrando seus aplicativos para o NetBeans IDE a partir de outros IDEs. <br>
Aqui est&atilde;o algumas de suas est&oacute;rias. <br>
</p>








<!--
<h2>Name</h2>
<blockquote>
</blockquote>
-->






<h2>Kalvin Osborne, Desenvolvedor L&iacute;der para <a href="http://xipolec.tk/">XIPOLEC</a>, Northern British Columbia, Canad&aacute;</h2>



<blockquote>Usei quase todos, sen&atilde;o todos, os IDEs que pareciam bons o suficiente para serem testados. Meus dois principais: Notepad++ e NetBeans. Eu nunca usaria o NotePad++ para o C/C++/Java, por isso uso o NetBeans. Eu costumava usar o Code::Blocks, &eacute; um &oacute;timo IDE, mas n&atilde;o me entenda mal, mas logo um determinado erro e como ele age atingiram o nervo errado. VC++... bom, para come&ccedil;ar n&atilde;o gosto dos produtos da Microsoft, portanto, este era um desastre natural esperando para acontecer, e adivinhe... ele aconteceu...
<br>
  <br>
Portanto, procurei pelo Java on-line, a linguagem que estava recusando fazia tempo. Eu sabia sobre o NetBeans e Eclipse, e sabia que ambos eram muito bons com o Java. O Eclipse era interessante, mas o NetBeans tinha uma apar&ecirc;ncia mais confort&aacute;vel. Abri o NetBeans, e encontrei algumas coisas boas, o que mais tarde descobri que o Eclipse n&atilde;o tem! Portanto, estou muito feliz com o NetBeans, e o estarei usando, ao menos para o Java. </blockquote>




<h2>Pete, KP Direction</h2>





<blockquote>
Tenho desenvolvido sites da Web desde 1999, e na kpdirection desde 2001, come&ccedil;ando com o Macromedia Dreamweaver Ultradev. Permaneci com as ferramentas DW at&eacute; a vers&atilde;o 8, quando finalmente me enchi com os cont&iacute;nuos custos de atualiza&ccedil;&atilde;o e os tradicionais bugs na vers&atilde;o 1 de qualquer vers&atilde;o. 
<br><br>
Procurando por uma alternativa, encontrei o Aptana, e ele me impressionou muito. Um PHP IDE com depura&ccedil;&atilde;o incorporada (o DW n&atilde;o o tina naquele tempo) e grandes recursos. Descontinuei o DW e fui um usu&aacute;rio leal do Aptana por cerca de um ano. At&eacute; que eles descontinuaram todo o suporte PHP da ferramenta, alteraram o m&eacute;todo FTP (e o quebraram), e mostraram em termos gerais que eles n&atilde;o mais tinham a estrat&eacute;gia de dar suporte aos desenvolvedores PHP.

<br><br> Procurei ent&atilde;o por alternativas. A pesquisa durou algumas semanas, e testei todos os IDEs PHP no mercado. O NetBeans se tornou o vencedor - n&atilde;o ao menos porque n&atilde;o tinha base em um plataforma Eclipse, e sendo gr&aacute;tis, n&atilde;o podia discutir com o pre&ccedil;o. Tenho usado o NetBeans desde que o 6.8 foi liberado, e estou completamente satisfeito de que esta &eacute; a escolha correta para as necessidade de desenvolvimento no futuro. Parabenizo pelo bom trabalho feito por todas as pessoas envolvidas em produzir um IDE t&atilde;o excelente.

</blockquote>









 
<h2>Werner Vesteraas, Noruega</h2>





<blockquote>
Ap&oacute;s quatro anos o Eclipse me encheu. Ele se tornou uma besta pregui&ccedil;osa. O NetBeans &eacute; agora minha escolha de arma. 
  </blockquote>














  
<h2>Doug Puchalski</h2>






<blockquote>







Software gr&aacute;tis &eacute; &oacute;timo. Mas &eacute; estranho n&atilde;o ter que pagar por este!
<br><br>
Tentei usar o Eclipse, Zend Studio, Komodo, RubyMine... e quase n&atilde;o me importei com o NetBeans, porque me parecia que qualquer IDE estava fadado ao desapontamento. Fiquei surpreso com o grau de resposta sem sacrifica a funcionalidade de alto n&iacute;vel, e um conjunto de recursos que parece antecipar exatamente o que desejo que estivesse projetado no produto. E continuo a descobrir coisas incr&iacute;veis a cada semana.
<br><br>N&atilde;o posso falar o suficiente sobre as boas coisas do NetBeans. Raramente uso o software que parece antecipar minhas necessidades antes que Eu mesmo me dou conta.
  </blockquote>




<h2>Daniel Noz </h2>



<blockquote>Resumo da entrada do blog: <a style="font-style: italic;" href="http://daniel-noz.blogspot.com/2009/07/netbeans-ide-67-refcard.html">NetBeans IDE 6.7 Refcard</a><br>
<br>
Troquei do Eclipse para NetBeans a cerca de 2 anos e estou completamente satisfeito com o mesmo. O que gosto mais &eacute; que seu IDE se torna melhor com cada vers&atilde;o, mesmo com vers&otilde;es candidatas ou vers&otilde;es master. Penso que a diferen&ccedil;a principal entre o Eclipse e o NetBeans, e que o NetBeans tem o foco de fornecer a funcionalidade bem b&aacute;sica para um desenvolvedor. Ele &eacute; bem testado e tem um &oacute;tima integra&ccedil;&atilde;o com bancos de dados e servidores de aplicativos.
</blockquote>



<h2>Adam McMahon</h2>















<blockquote>

Nenhuma configura&ccedil;&atilde;o maluca &eacute; necess&aacute;ria. Ela funciona de imediato!<br>
<br>

Tendo usado o Eclipse por diversos anos para o desenvolvimento de Servlet. Decidi experimentar o NetBeans 6, e fiquei impressionado com a integra&ccedil;&atilde;o do ambiente de desenvolvimento. Em minha experi&ecirc;ncia, posso dizer que leva muito tempo para configurar o Eclipse para desenvolver apropriadamente componentes da Web. Sim direto da caixa, o NetBeans est&aacute; pr&eacute;-configurado para desenvolver, depurar e implementar rapidamente componentes da Web no Tomcat (que est&aacute; inclu&iacute;do com o download). Embora ainda esteja pesquisando seus recursos, estou impressionado com a rapidez para implementar um novo aplicativo da Web.

</blockquote>








<h2>Josh Eckerman, Eventux, LLC</h2>











<blockquote>Queria apenas dizer que o NetBeans 6.7.1 impressionou muito a mim e minha equipe. O Eclipse e o Aptana Studio Pro eram nossa outra op&ccedil;&atilde;o. Ap&oacute;s usando isso, come&ccedil;amos a migra&ccedil;&atilde;o para o NetBeans, e todos est&atilde;o obtendo r&aacute;pidos resultados. N&atilde;o deveria tamb&eacute;m cham&aacute;-la de &quot;migra&ccedil;&atilde;o&quot;. Basta importar, e seguir adiante. Excelente trabalho, parab&eacute;ns a todos os envolvidos. </blockquote>










<h2>Jamie P</h2>










<blockquote>
Troquei para o NetBeans a cerca de 6 meses, ap&oacute;s usar quase todos os IDEs dispon&iacute;veis pelos &uacute;ltimos 9 anos. Nunca vou voltar...

  <br>
  <br>
Resumo da entrada do blog: <a style="font-style: italic;" href="http://www.saynotoflash.com/archives/20-great-non-php-tools-for-php-developers/">20 Great non-PHP Tools for PHP Developers</a><br>
  <br>
O NetBeans &eacute; um IDE que se sobressai a todos os outros. Ele &eacute; completamente gr&aacute;tis. Ele oferece um cliente FTP incorporado (Muito superior ao Dreamweaver) ou suporta a publica&ccedil;&atilde;o &quot;subversion&quot;. Ele &eacute; muito pequeno, r&aacute;pido e tem muitos recursos incorporados para ajudar a criar um c&oacute;digo melhor e mais eficaz. O NetBeans oferece o melhor ID, com a menor quantidade de bugs, e visualmente sem curva de aprendizado (Tente isso com o Eclipse...), comparado com que usei.

  <br>
  <br>
Se voc&ecirc; estiver se mantendo preso ao Dreamweaver por causa do FTP, ou alguma outra fun&ccedil;&atilde;o que falta no Eclipse PDE ou Zend Studio, aconselho examinar o NetBeans. Quando n&atilde;o estou usando o SVN, posso salvar o arquivo no qual estou trabalhando, e ele &eacute; automaticamente carregado no servidor da Web ou de teste. Experimente, voc&ecirc; n&atilde;o ficar&aacute; desapontado!</blockquote>






<h2>Alan Stanley</h2>















<blockquote>

Amo o NetBeans. Eu trabalho em uma entidade de desenvolvimento e suporte. Conseguir converter alguns aficionados do Eclipse para o NetBeans.<br>
  <br>

O NetBeans &eacute; desempacotado e instalado com facilidade. A interface do usu&aacute;rio &eacute; intuitiva, e as paletas de arrastar e soltar s&atilde;o f&aacute;ceis e transparentes. A integra&ccedil;&atilde;o autom&aacute;tica das Estruturas (junto com os tutoriais), torna relativamente f&aacute;cil a aquisi&ccedil;&atilde;o de facilidade com novas tecnologias Java. Eu agora implemento com facilidade o MVC sem ter que memorizar estruturas de diret&oacute;rios enigm&aacute;ticas. Os aplicativos de exemplo incorporados s&atilde;o auto-explicativos e altamente instrutivos. <br>
  <br>

&Eacute; um com produto com pre&ccedil;o atrativo. Escrevi e implementei aplicativos de suporte com base na Web para alguns de meus clientes, em poucas horas, uma ou duas.

</blockquote>

















<h2>James </h2>









<div style="margin-left: 40px;">






Resumo da entrada do blog: <a style="font-style: italic;" href="http://www.tkstudios.com/2009/03/13/a-few-software-recommendations/">A Few Software Recommendations for PHP/Javascript</a></div>















<blockquote>

Bom, agora sou um aut&ocirc;nomo. Isso significa que preciso de software, e preciso que seja gr&aacute;tis ou de baixo custo. [...] Isso levou algum tempo de pular de site para site, verificando tabelas de compara&ccedil;&atilde;o de recursos, testando diferentes softwares, e assim por diante. Eu queria algo gr&aacute;tis e com muitos recursos. Meus requisitos principais era o &oacute;timo tratamento de c&oacute;digo PHP, e um &oacute;timo Javascript - jQuery em particular.<br>
  <br>

No final cheguei ao embate entre o Aptana Studio e o NetBeans, e embora estivessem bem pr&oacute;xims, o plug-in PHP do Aptana&rsquo;s PHP flalhou miseravelmente quando o uso real: Quando iniciei o site (atrav&eacute;s da fun&ccedil;&atilde;o &quot;Executar&quot;, se me lembro bem), todo meu site foi colocado em uma linha. Isso significa que abrir coment&aacute;rios <tt>//&lt;![CDATA [</tt> iria comentar (desativar) todos os scripts. N&atilde;o &eacute; necess&aacute;rio dizer que isso eliminou completamente a viabilidade do Aptana, e ap&oacute;s procurar por uma corre&ccedil;&atilde;o por cerca de uma hora, declarei o NetBeans como o vencedor. Posso dizer que ele &eacute; um substituo permanente para o Dreamweaver em meu trabalho; o NetBeans &eacute; o sonho realizado do codificador PHP.

</blockquote>
















<h2>Travis Walters</h2>









<div style="margin-left: 40px;">





Resumo da entrada do blog: <a href="http://zachelko-programming.blogspot.com/2008/04/netbeans-why-it-matters.html"><span style="font-style: italic;">The second coming of NetBeans</span></a></div>















<blockquote>[...] Detesto dizer isso... Tr&ecirc;s strikes e voc&ecirc; est&aacute; fora do Eclipse! Estarei usando o NetBeans para todo meu desenvolvimento Ruby, Groovy e eventualmente Scala. Tamb&eacute;m planejo testar o NetBeans em meu pr&oacute;ximo trabalho Java, para ver como ele se comporta em um ambiente de desenvolvimento corporativo. Se voc&ecirc; n&atilde;o uso o NetBeans por algum tempo, recomendo com &ecirc;nfase que o examine.<br>
</blockquote>







<h2>Laurin1</h2>







<blockquote>


</blockquote>







<div style="margin-left: 40px;">





Resumo do Zend Forum:&nbsp;<a href="http://www.zend.com/forums/index.php?t=msg&amp;goto=19723&amp;S=96434f6de53ce182fb8fc12b0f9c37c7">NetBeans 6.5....Zend Studio, por favor preste aten&ccedil;&atilde;o</a></div>







<blockquote>








Minha empresa comprou licen&ccedil;as de 3 anos do Zend Studio, antes desta semana e algumas semanas atr&aacute;s. N&atilde;o havia nada mais no mercado que chegasse perto em atender nossos requisitos. Ent&atilde;o, o NetBeans 6.5 foi liberado com suporte PHP. Direto do port&atilde;o, seu suporte PHP e JavaScript &eacute; no todo, t&atilde;o melhor e mais r&aacute;pido que o produto da Zend, com muito menos bugs, e a despeito de termos gasto $1,000 este ano investindo no produto da Zend, e pessoalmente gastei tempo com o suporte t&eacute;cnico e desenvolvedores da Zend (boas pessoas, de muita ajuda), estou ajudando minha equipe a migrar para usar o NetBeans para a maior parte de nosso desenvolvimento....

</blockquote>















<h2>Kevin Yank</h2>









<div style="margin-left: 40px;">










Resumo da entrado do blog: <a style="font-style: italic;" href="http://www.sitepoint.com/blogs/2008/12/16/php-support-in-netbeans-65/">PHP support in NetBeans 6.5</a></div>



















<blockquote>

        H&aacute; muito tempo desconsiderado como um &quot;IDE Java de brinquedo&quot;, o NetBeans&mdash;o IDE da Sun&mdash;realmente cresceu nos anos recentes. Ela n&atilde;o mais &eacute; apensas para o Java, tamb&eacute;m: para os desenvolvedores da Web, o NetBeans 6.5 agora suporta o Ruby e PHP direto da caixa. Com surpresa, aquele suporte &eacute; t&atilde;o bom que agora de comparava favoravelmente com produtos mais estabelecidos, como o Eclipse, Komodo IDE e Zend Studio.<br>
&nbsp;<br>
        
        Me acostimei a escrever meu c&oacute;digo PHP em um editor de texto simples (jEdit, se voc&ecirc; estiver imaginando), portanto, tem se apssado algum tempo desde que apreciei os luxos de completar c&oacute;digo no &acirc;mbito do projeto, refatora&ccedil;&atilde;o de c&oacute;digo e um depurador completo. Todos esses e mais est&atilde;o dispon&iacute;veis no NetBeans 6.5. [...]
  <br>
        
        <br>
&Eacute; claro, escrever aplicativos PHP &eacute; mais do que apenas c&oacute;digo PHP. Temos tamb&eacute;m que escrever c&oacute;digo HTML, CSS e JavaScript. Quando voc&ecirc; o faz, ficar&aacute; prazeirosamente surpreso em encontrar o mesmo n&iacute;vel de suporte para esas linguagens incorporadas tamb&eacute;m no NetBeans! E quando um&uacute;nico arquivo mistura junto estas linguagens, o NetBeans trata todas racionalmente.
  <br>

        <br>
O NetBeans n&atilde;o mais &eacute; um brinquedo para aprender o Java. Nestes dias, ele &eacute; um ambiente de desenvolvimento poderoso, m&uacute;tiplas linguagens, e que &eacute; gratis para ser usado. Se voc&ecirc; trabalha em projetos PHP de tamanho razo&aacute;vel e n&atilde;o est&aacute; usando um IDE como o NetBeans, ficar&aacute; supreso com o tanto de tempo que uma ferramenta como essa pode lhe economizar!

</blockquote>





















<h2>Membro da audi&ecirc;ncia do Java Day 2008, Bratislava </h2>





















<blockquote>
Porque preciso pagar $250 pelo IntelliJ quando posso obter o NetBeans de gra&ccedil;a?
</blockquote>






















<h2>Branko</h2>









<div style="margin-left: 40px;">










Resumo da entrada do blog: <a href="http://activecodeline.com/netbeans65-php-edition/"><span style="font-style: italic;">NetBeans 6.5 PHP Edition</span></a></div>



















<blockquote>
...H&aacute; alguns recursos que espero que meu IDE tenha. A conclus&atilde;o do c&oacute;digo &eacute; um deles, e no NetBEans isso parece incr&iacute;vel. ... Estou oficialmente apaixonado agora pelo NetBeans. Tenho usado o NuSphere PhpEd por algum tempo, ele tamb&eacute;m tem recursos similares, mas n&atilde;o escreve as declara&ccedil;&otilde;ies necess&aacute;rias como o NetBeans. S&atilde;o as pequenas coisas que tornam as pessoas felizes. Outra coisa, e a mais importante, o NetBeans &eacute; de gra&ccedil;a. H&aacute; algumas outras coisas que fazem com que o NetBeans de destaque na multid&atilde;o, tal como a conclus&atilde;o de c&oacute;digo HTML, e assim por diante. Este resumo n&atilde;o tem a inten&ccedil;&atilde;o de ser uma revis&atilde;o detalhada do produto. &Eacute; meramente uma observa&ccedil;&atilde;o pessoal. Estou apenas dizendo que me sinto agora mais confort&aacute;vel, hoje, usando o NetBeans em lugar do Zend ou NuSpere; sem deixar de mecionar o custo de cada um deles. Se tiver algum tempo livre, experimente-o.
</blockquote>





















<h2>Compucoder</h2>





















<blockquote>
Para a equipe NB:<br>
  <br>
...pessolamente considero que voc&ecirc;s t&ecirc;m o melhor IDE do mercado, pronto para o desenvolvimento PHP. Voc&ecirc;s n&atilde;o ter&atilde;o nenhum problema em fazer com que as pessoas convertam de outros IDEs para o NetBeans, disso tenho certeza... Quantos mais usu&aacute;rios voc&ecirc; puderemalcn&ccedil;ar nesses est&aacute;gios iniciais, mais ajudar&aacute; o feedback dos usu&aacute;rios para conduzir o desenvolvimento futuro de recursos. J&aacute; troquei toda a empresa para o NetBeans para PHP, mas somente Eu sou pouco para alcan&ccedil;ar as massas. :) Penso que seus esfor&ccedil;os e produtos s&atilde;o at&eacute; aqui t&atilde;o bons, que deveriam fazer com que as pessoas corram pelas ruas usando camisetas e cantando. :) </blockquote>




















<h2>Rob Eastman</h2>




















<blockquote>
Tenho sido usu&aacute;rio do Microsoft Visual Studio por algum tempo. Programei a maioria em C#. Baixei o programa IDE para um projeto de curso de rede de meus pares para meus estudos de gradua&ccedil;&atilde;o. Estou muito impressionado com a funcionalidade do Netbeans IDE para a programa&ccedil;&atilde;o Java! Quero apenas dizer &quot;excelente trabalho&quot;! Irei usar o NetBeans IDE para meus cursos remanescentes de n&iacute;vel de gradua&ccedil;&atilde;o em ci&ecirc;ncia da computa&ccedil;&atilde;o na Universidade da Fl&oacute;rida.
</blockquote>





















<h2>Zachelko</h2>









<div style="margin-left: 40px;">










Resumo da entrada do blogo: <a href="http://zachelko-programming.blogspot.com/2008/04/netbeans-why-it-matters.html"><span style="font-style: italic;">NetBeans: Why it Matters</span></a></div>




















<blockquote>
... O fato do NetBeans oferecer um IDE completo que pode ser executado em m&uacute;ltiplas plataformas, &eacute; suficiente em si pr&oacute;prio. O fato de ter suporte para cada linguagen que possa desejar (ou precisar) para escrever c&oacute;digo &eacute; quase sem precedentes. O fato de fazer isso melhor do que qualquer IDE que Eu j&aacute; tenha visto &eacute; tentador e elevado. O fato de abrir c&oacute;digo-fonte &eacute; enloquecedor...<br>
  <br>
A guerra dos IDEs nunca ser&aacute; decidida. Talvez isso seja o melhor, para cada um deles. No entanto, o resultado final &eacute; que o NetBeans o torna um melhor desenvolvedor. Ele lhe ajuda a fazer seu trabalho e ajuda a fazer bem o seu trabalho. O fato de cobrir os principais elementos de todas as linguagens que ele suporta, o torna o segundo para nenhum. Quebrar seu c&oacute;digo por classes? Feito. Anexar um perfilador em prefundidade? Simples. Depurador? Pode acreditar. Controle de c&oacute;digo-fonte? Olhe m&atilde;e, sem as m&atilde;os...<br>
  <br>
Se voc&ecirc; nunca experimentou o NetBeans, recomendo com &ecirc;nfase que o fa&ccedil;a. Est&aacute; certo, voc&ecirc; n&atilde;o tem de dizer a ningu&eacute;m que est&aacute; usando o NetBeans. Voc&ecirc; pode se isolar, desligar as luzes, cobrir seu rosto se for preciso, mas experimente-o. Uma vez que voc&ecirc; coloque o excitamento de lado, ir&aacute; descorbir qu&atilde;o valiosa &eacute; uma ferramenta como o NetBeans. E a&iacute; ir&aacute; se perguntar porque n&atilde;o a estava usando anos atr&aacute;s.<br>
</blockquote>































<h2>Rob Dempster, &Aacute;frica do Sul</h2>




















<blockquote>
Resumo da entrada do blogo: <a style="font-style: italic;" href="http://sun-java.cs.ukzn.ac.za/%7Erobd/myblog/netbeans.html">Java and NetBeans - Finally a Brew that I am Able to Enjoy</a><br>

  <br>
  Como um professor acad&ecirc;mico de Ci&ecirc;ncia da Computa&ccedil;&atilde;o pelos &uacute;ltimos 30 anos (no momento <a href="http://www.cs.ukzn.ac.za/">aqui</a>), tenho observado mudan&ccedil;as principais havidas em termos do ambiente de trabalho do programador ... No entanto, devido ao comprometimento de minha universidade com a Microsoft, tenho tamb&eacute;m usado o IDE de programa&ccedil;&atilde;o do Borland com o Pascal, C, C++ e Java. Mas, por causa de meu compromisso com software gr&aacute;tis, sempre estive procurando por um IDE que pudesse compartilhar com meus alunos, eles trabalhando sob a MD e Eu sob o Linux.<br>
  <br>
Quando o NetBeans apreceu pela primeira vez, experimentei o mesmo, mas apenas uma vez, porque era lento em minha caixa e era n&atilde;o utiliz&aacute;vel. Isso, no entanto, mudou nos tempos recentes e voltei a experiment&aacute;-lo, somente para abandon&aacute;-lo por ser um excesso para pequenos projetos de programa&ccedil;&atilde;o a n&iacute;vel de ensino. Tamb&eacute;m experimentei o Eclipse e o abandonei pelo mesmo motivo. Estes esfor&ccedil;os mais recentes foram esfor&ccedil;os renovados para migrar do Emacs para trazer-me em linha com meus colegas e alunos, e como j&aacute; mencionei, a maioria usava o IDE do Borland. Devo tamb&eacute;m admitir que tamb&eacute;m queria o acesso &agrave;s capacidades adicionais que estes IDEs agora oferecem.<br>
  <br>
Neste ano experimentei de novo o NetBeans e o Eclipse. Desta vez o NetBeans 6.0 me ganhou. Trabalhei direto da caixa sob o Windows XP e openSUSE 10.3. Ele tamb&eacute;m &eacute; r&aacute;pido gra&ccedil;as aos avan&ccedil;os do hardware, e at&eacute; aqui me ajudou a desenvolver com facilidade aplicativos Java n&atilde;o de IGU (atribui&ccedil;&otilde;es de programa&ccedil;&atilde;o) para o m&oacute;dulo Programa&ccedil;&atilde;o aorientada ao objeto, que estou no momento ensinando. Meus alunos que usavam anteiromente o JBuilder da Borland, ficaram igualmente impressionados.
  <br>
Para mim, o NetBeans agora funciona e encorajei meus colegas a considerar seu uso para seu ensino!
</blockquote>




















<h2>Ryan Penn</h2>


















<blockquote>
Amo o suporte do Ruby e do Ruby on Rails no NetBeans! Acho que &eacute; o melhor IDE Ruby do mercado. Por favor, continuem a fazer o bom trabalho. Abandonei o RadRails para o NetBeans.
</blockquote>


















<h2>David Heffelfinger</h2>


















<blockquote>
Resumo da entrada do blog: <i><a href="http://www.jroller.com/heffel/entry/eclipse_veteran_tries_and_keeps"> Eclipse Veteran Switches To NetBeans</a></i><br>
  <br>
...Experimentei um pouco o NetBeans antes, no entanto, voltei para o Eclipse, porque ele oferecia um editor Java muito melhor. Penso que isso mudou na vers&atilde;o 6 do NetBeans. Coisas que faltavam no editor do Eclipse agora est&atilde;o dispon&iacute;veis no NetBeans, tal como:<br>
  <br>
  <ul>
    <li>o realce de uma vari&aacute;vel a destaca em todos os lugares no arquivo, tornando f&aacute;cil ver onde &eacute; usada.<br>
    </li>
    <li>crtl+clique em uma chamada de m&eacute;todo navega para a declara&ccedil;&atilde;o do m&eacute;todo.<br>
    </li>
    <li>Qualquer arquivo pode ser rapidamente aberto atrav&eacute;s de atalho de teclado (no Eclipse &eacute; ctrl+shift+R, no NetBeans &eacute; shift+alt+O).<br>
    </li>
    <li>ctrl+espa&ccedil;o sugere automaticamente nones de vari&aacute;veis.</li>
  </ul>
  
...No todo, os aprimoramentos feitos no editor do NetBeans, a integra&ccedil;&atilde;o mais pr&oacute;xima com o Maven, e a forma dolorosa de configurar um projeto JSF (essencialmente, toda a conclus&atilde;o de c&oacute;digo e recursos necess&aacute;rios, funciona &quot;como m&aacute;gica autom&aacute;tica&quot;), o NetBeans passou o Eclipse em termos de usabilidade. Conte comigo como um novo convertido.
</blockquote>




















<h2>James Carr</h2>




















<blockquote>
Resumo da entrada do blog: <i><a href="http://blog.james-carr.org/2007/11/18/netbeans-is-now-my-favorite-java-ide/"> NetBeans is Now My Favorite Java IDE</a></i><br>
  <br>
Desculpe Eclipse, mas isso estava fadado a acontecer. Instalei o Eclipse em meu laptop a algum tempo atr&aacute;s e tenho sofirido um pouco intensamente em tentar apenas prevenir que meu espa&ccedil;o PermGen seja todo utilizado.... Finalmente, decidi experimentar o NetBeans, e Gra&ccedil;as a Deus, ainda n&atilde;o tenho problemas&hellip; Completei agora minha implementa&ccedil;&atilde;o n&ordm; 300 e nenhum aviso de mem&oacute;ria, sem sobressaltos. E ainda melhor, a reimplementa&ccedil;&atilde;o parecer correr suavemente e leva alguns segundos para ser feita. E me apaixonei pelo monitor HTTP.
</blockquote>

















<h2>Scott Carpenter, Profisisonal S&ecirc;nior de TI, Minnesota, EUA</h2>
















<blockquote>
Resumo da entrada do blog: <i><a href="http://www.movingtofreedom.org/2007/08/28/moving-to-netbeans-for-java-from-eclipse/"> Moving to NetBeans (from Eclipse)</a></i><br>
  <br>
...Ent&atilde;o o que me levou ao NetBeans? Isso volta para a programa&ccedil;&atilde;o IGU e come&ccedil;ou [] quando fui procurar como faz&ecirc;-lo no Eclipse. Rapidamente encontrei refer&ecirc;ncias ao plug-in Visual Editor, e encontrei muitas informa&ccedil;&otilde;es sobre ele, mas n&atilde;o conseguia que funcionasse com minha instala&ccedil;&atilde;o do Eclipse. Com suficiente motiva&ccedil;&atilde;o poderia ter insistido, mas tinha a alternativa NetBeans a ser examinada...
</blockquote>
















<h2>Maciej Wegorkiewicz, Consultor de Software</h2>




















<blockquote>
Gostaria de agradecer a equipe pelo melhor IDE que uso a seis anos para o desenvolvimento do aplicativo de finan&ccedil;as pessoais, ePortfel (www.eportfel.com). <br>
  <br>
Profissionalmente, usei o Eclipse e o IntelliJ Idea em outros projetos, mas nunca pensei em trocar para nenhum deles para o ePortfel. Preciso admitir, que tamb&eacute;m gosto muito do Idea por suas capacidades de refatora&ccedil;&atilde;o e pelas muitas possibilidades que ele oferece para desenvolver aplicativos de m&uacute;ltiplas camadas. Mas para UFGs Rich Cliente, o NetBeans n&atilde;o tem competidos no mercado. <br>
  <br>
Estes s&atilde;o os principais motivos que tornam o NetBeans o melhor: <br>
  <br>
1. Excelente builder de IGU<br>
2. Excelente integra&ccedil;&atilde;o Ant (n&atilde;o a necessidade de manter a m&atilde;o a consist&ecirc;ncia entre o IDE e um script separado do build!)<br>
3. Excelente CONSIST&Ecirc;NCIA DE IU DO IDE (acaba a confus&atilde;o como no Eclipse)<br>
4. Excelente velocidade do IDE (mais r&aacute;pido do que o Eclipse, que gostava de congelar meu desktop)<br>
5. Excelente depurador<br>
6. Excelente Perfilador (f&aacute;cil e eficaz - voc&ecirc; se sente usando um assistente simples e obt&eacute;m as informa&ccedil;&otilde;es exatas)<br>
  <br>
E como resumo, posso dizer que n&atilde;o tenho a necessidade de procurar por uma ferramenta melhor. Tenho tudo no NetBeans - direto da caixa.  </blockquote>















<h2>John Blanco, Desenvolvedor JSF, Colorado, EUA</h2>















<blockquote>
Resumo da entrada do blog: <i> <a href="http://zablanc.blogspot.com/2007/02/eclipse-hit-matnetbeans-new-champ.html"> Eclipse Hits The Mat...NetBeans New Champ! </a></i><br>
  <br>
Recentemente, passei por algumas mudan&ccedil;as em meu ambiente de desenvolvimento. Isso tudo come&ccedil;ou quando verifiquei que n&atilde;o estava indo r&aacute;pido ao tentar escrever c&oacute;digo PHP com o plug-in PHPEclipse...O NetBeans foi selecionado para substituir o pr&oacute;prio Eclipse para meus projetos Java e Java ME. Isso me deixou bem nervoso, j&aacute; que pode ser quase uma dan&ccedil;a tratar com depend&ecirc;ncias Java, etc. Tinha medo que teria que passar por montanhas de tutoriais para obter meu n&iacute;vel de profici&ecirc;ncia que tinha com o Eclipse. <br>
  <br>
Totalmente errado. <br>
  <br>
Atrav&eacute;s de todo o processo de efetuar a transi&ccedil;&atilde;o de meus projetos, NUNCA tive o problema de entender o que fazer...e n&atilde;o examinei nenhum tutorial. Os rapazes da Sun fizeram um incr&iacute;vel trabalho de escrever um IDE despido de qualquer coisa muito enigm&aacute;tica. E apenas funcionou...e perfeitamente! Al&eacute;m disso, a ferramenta &eacute; agrad&aacute;vel e limpa...<br>
  <br>
Meu conselho para os desenvolvedores Java est&aacute; l&aacute; fora: Experimente o NetBeans! N&atilde;o ir&aacute; precisar de nenhum treinamento por ser t&atilde;o f&aacute;cil. Voc&ecirc; ir&aacute; am&aacute;-lo!
</blockquote>















<h2>Levan Dvalishvili</h2>















<blockquote>
Aqui est&atilde;o os 5 principais recursos que me tiraram do Eclipse para ir para o NetBeans:
  <ol>
    <li> Editor JSP muito decente, mais a integra&ccedil;&atilde;o racional com o Tomcat. (Me economiza muito tempo). </li>
    <li> Implementa&ccedil;&otilde;es incrementais (isso &eacute; incr&iacute;vel). (Me economiza muito tempo). </li>
    <li> Monitor HTTP que realmente funciona. (Me economiza muito tempo). </li>
    <li> Perfilador que realmente funciona. Usei o mesmo algumas vezes, mas ainda &eacute; um bom recurso. </li>
    <li> Depurador que realmente funciona bem com aplicativos da Web. </li>
    <li> Compartilhamento de c&oacute;digo (colabora&ccedil;&atilde;o). </li>
  </ol>
</blockquote>















<h2>David Saintloth, Arquiteto Chefe de Software, Apriority LLC</h2>















<blockquote>
Tenho usado o NetBeans desde o tempo em que se chamava Forte, desde os idos de 2001. Apreciei a facilidade de fazer com que meu projeto fosse adiante e realmente gostei a codifica&ccedil;&atilde;o em cores. Iso foi quase tudo, usei o mesmo por 6 meses antes de ser for&ccedil;ado a trabalhar com o JBuilder no in&iacute;cio de 2002. <br>
  <br>
Bom, o JBuilder era OK, mas n&atilde;o tinha a apar&ecirc;ncia intuitiva do Forte. O Forte foi substitu&iacute;do pelo NetBeans, e passei por todas as vers&otilde;es principais at&eacute; a 4.2, antes dos rumores sobre este IDE &quot;acima&quot; chamado de Eclipse come&ccedil;ou. Decidi baixar e instalar o Eclipse, e na minha opini&atilde;o n&atilde;o conhe&ccedil;o ningu&eacute;m que poderia compar&aacute;-lo com o NetBeans. Na vers&atilde;o 4, o NetBeans era incrivelmente intuitivo, est&aacute;vel, e oferecia boas ferramentas para refatora&ccedil;&atilde;o (os recursos de pesquisar e substituir global s&atilde;o dos deuses), e ent&atilde;o veio a vers&atilde;o 5, depois a 5.5, e n&atilde;o mais me dei o trabalho de usar o Eclipse. <br>
  <br>
A conclus&atilde;o de c&oacute;digo, a compila&ccedil;&atilde;o autom&aacute;tica de javadoc, a implementa&ccedil;&atilde;o automatizada de jar, e o incr&iacute;vel Perfilador, o tornam o melhor IDE existente para desenvolvedores que trabalham em projetos grandes. No momento estou trabalhando e uma estrutura de aplicativo corporativo da Web distribu&iacute;do em escala, com mais de 200 arquivos de c&oacute;digo-fonte e cerca de 2 d&uacute;zias de pacotes importados, e o NetBeans conseguiu executar o trabalho de codifica&ccedil;&atilde;o e execu&ccedil;&atilde;o perfeitamente. Recomendo com &ecirc;nfase o NetBeans para todos meus amigos codificadores, acima que qualquer outra alternativa, quando tenho a chance de faz&ecirc;-lo.
</blockquote>















<!--OLD SWITCH STORIES
<h2>Patrick Julien</h2>

<blockquote>
Excerpt from blog entry: NetBeans 6.1: <a style="font-style: italic;" href="http://codepimpsdotorg.blogspot.com/2008/03/netbeans-61-best-just-got-better.html">The
Best Just Got Better</a><br>
<br>
When it comes to IDEs, I've been around. I've used Visual C++ since
version 1.5. Tried other environments over the years, but Visual Studio
was by far the best no matter what other people claimed.
I started using Eclipse since that's what everyone around me was using
for some Java work and I hated it. I'll reserve my thoughts on that for
a future blog post but it was never a comfortable fit for me. Needless
to say, I've converted my entourage from Eclipse to NetBeans now. <br>
<br>
Version 5.5.1 of NetBeans was pretty good... .<br>
NetBeans 6 was simply fantastic... .<br>
NetBeans 6.1 has really been great for me, so great that I've ditched 6
for the 6.1 beta... .<br>
<br>
I won't be switching back to Visual Studio anytime soon. The only real
problem I have with NetBeans is that since everything is in the open
and announced upfront, I find I'm always eager to get my hands on the
next release, never truly satisfied with the current one. I would
imagine however that's a good problem for NetBeans to have.
</blockquote>

<h2>Jon Guenther, Software Developer, USA </h2>

<blockquote>
Excerpt from blog entry: <a href="http://techscribe.spaces.live.com/blog/cns%21B0C7AC7933F32DFE%21213.entry"><span style="font-style: italic;">NetBeans
6.1 IDE (Beta): Prepare to Make the Jump to Light Speed!</span><br>
</a><br>
Visual Studio and Eclipse had best find a shady spot on the side of the
inter-galactic thoroughfare, because the beta version of Sun's NetBeans
integrated development environment is out. And she's running on all
thrusters, Chewie! (Grew up in the Star Wars generation - who, me?)
I've had it on my plate now for some time to begin developing a desktop
application with a MySQL back-end that I could use to help me in my
writing. The project (codename: WriteLite©) has never gotten off the
ground to this point because of the steep learning curve and heavy
footprint of previous IDEs. <br>
<br>
Not any more! First, I get to the download page and find a beautifully
crafted Web site with a self-explanatory grid and (YES!) links for
bundled installs. So, instead of having to crank down this 900MB
monstrosity (think downloading the ISO image for the Visual Studio
Express tools), I get a 24MB file that installs and starts up in less
than five minutes - no mean feat considering my computer's 3 years old.
....
</blockquote>

<h2>Paul Clevett, Software Developer, UK</h2>


<blockquote>
The company I work for was looking at developing some large scale
applications for clients. Some of these were new applications and
others were going to be rewrites of existing systems that had stopped
performing. Our choice of NetBeans was really driven by a number of
factors:<br>
<br>
<ul>
<li>Low cost set up for developers (we only pay when we deploy) <br>
</li>
<li>The IDE is awesome and the development environment Is perfect
for
developing 3 tier client server systems <br>
</li>
<li>We can run multi platform <br>
</li>
<li>We felt there was better support with NetBeans, especially with
in
the virtual world Second Life where a lot of developers meet <br>
</li>
<li>It works perfectly with the 4 different types of database we
have to work with <br>
</li>
<li>Development of web applications and "stand alone" and mobile
apps is all done in one place <br>
</li>
<li>We have no need to copy and paste code around as the code can
be
centralised on the app server <br>
</li>
<li>Using the Sun App server we are able to give 100% uptime to our
clients rather than the standard downtime required by other
applications <br>
</li>
<li>The code completion and documentation is very elegant <br>
</li>
<li>I seem to spend more time dragging and dropping and less time
coding <br>
</li>
<li>Profiling tools are fantastic <br>
</li>
<li>The flexibility of being able to choose different frameworks
and mix
and match them is awesome <br>
</li>
<li>The integration with databases is perfect, very tight and easy.<br>
<br>
</li>
</ul>
<p>I could go on but all
in all I think my message to developers has to be get stuck in to
NetBeans, you won't regret it. Even if you are a .net or VB programmer
it's not that hard to switch any longer and there are a whole bunch of
excellent people willing to provide any assistance you need. (Although
if you are in a commercial environment Sun Developer Support is WELL
worth the money).<br>
</p>
</blockquote>


<h2>Mujtaba Alshakhouri, Systems Integration Specialist</h2>


<blockquote>
I just wanted to say a big THANK YOU to all of you guys for developing
this great IDE! I
have been using MyEclipse for more than two years and two days ago I
decided to give your
IDE a try. I was totally blown away. NetBeans is just so great and
moreover it is for damn free!
I have fired MyEclipse and dumped it into oblivion.
</blockquote>

<h2>Dustin McCartney, CTO, DAM Entertainment LLC</h2>

<blockquote>
We've been following NetBeans's development for quite some time.... And
with NetBeans 5.5, we decided to give it a shot. Unsurprisingly, we
ended up replacing Eclipse as our Java development environment of
choice with that NetBeans release. Some of the reasons for our switch
to NetBeans 5.5, were:<br>
<br>
<ul>
<li>The Matisse GUI builder enabled us to quickly build
good-looking GUI forms. </li>
<li>Robust integrated Java debugger. </li>
<li>Smaller memory footprint. </li>
<li>Faster UI responsiveness. </li>
<li>More active development/frequent release schedule. </li>
<li>More elegant project management. </li>
</ul>
With the release of Netbeans 6.0, the reasons for using NetBeans became
more compelling:<br>
<br>
<ul>
<li>Further improvements to the Matisse GUI builder. </li>
<li>Easy-to-use integrated Java profiler. </li>
<li>Cleaner "Plugin" management. </li>
<li>C++ Development... </li>
</ul>
Surprisingly, we also ended up replacing Microsoft Visual Studio .NET
2005 with NetBeans 6.0 for all our C++ development! The default
NetBeans 6.0 C++ Pack contains all the functionality we used in MSVC++
(including the 3rd Party "Visual Assist'' plugin), plus provides us
these additional benefits:<br>
<br>
<ul>
<li>A unified project for all our target C++ platforms (Windows,
Mac OS X Universal Binary, and Linux x86/x64). </li>
<li>The freedom to develop on any platform targeting any other
platform (using NetBeans's "Compiler Collections'' settings with
cross-compilers). </li>
<li>A consistent, unified development environment within which to
develop our complete applications from start to finish; including both
Java and C++ (via JNI) components. </li>
</ul>
The future looks bright for NetBeans, and I can't wait for what
subsequent releases have in store!<br>
</blockquote>

<h2>Rick Sprague, Development Engineer</h2>

<blockquote>
With regard to Forte: the last time I've seen a Sun IDE for Java.
NetBeans is a quantum leap. With regard to Eclipse: a three-year
veteran. NetBeans is FAST, POLISHED, &amp; WELL ORGANIZED.<br>
<br>
In particular, I'm impressed by your visual editor, Matisse. Eclipse
Visual Editor is no match for Matisse. Eclipse Visual Editor is so
slow, buggy, and resource intensive - not to mention unsupported in the
current Eclipse version - that I just created all my GUIs by hand.
While I would consider myself proficient at coding Swing and AWT, I
just don't have time to develop 100+ wizards/forms/dialogs etc by hand.
I need to get product out the door while at the same time developing
GUIs that are logical, consistent, attractive, and easier to hand off
to other folks that need to update the code base.<br>
<br>
Keep up the good work!
</blockquote>

<h2>Jean-Yves Mengant, CTO, Sefas Innovation </h2>

<blockquote> In order to provide cross platform portability to our
customers, our company has been involved in Java technologies since
1999. Java IDE are one of the most important piece of software for our
developers which have important impacts on development productivity.
This is the reason why after using Jbuilder and Eclipse we definitively
switch to Netbeans since it offers for free the most impressive and
efficient Java development environment available in 2006 and 2007. With
invaluable plugins and features like the matisse GUI design tools and
the integrated profile, it outperforms the Java IDE competition today.
In order to contribute ourselves to the impressive work of the netbeans
team and since Python development is also part of our development
activity, we have developed a Python development plugin environment
available for free in the Netbeans plugin catalog(jpydbg). Thanks again
to the NetBeans team for the great work done.
</blockquote>

<h2>Jens Technau, Contact Air</h2>

<blockquote>
Just wanted to express my appreciation for your IDE. I used to develop
with JBuilder
since the very beginning and refused to switch to any other IDE until
Borland said they
eventually stopped working on it. <br>
<br>
This happened by the end of last year. Being the only architect and
developer for the
paperless-cockpit project in our company, I just couldn't afford to
spend more than
one or two days in managing the transition to another IDE. I tried
Eclipse. I soon
realized that there is no GUI Builder worth mentioning. I do the whole
thing including
GUI, so I can`t use any GUI builder below the standard of JBuilder. <br>
<br>
Then I came to see NetBeans with Matisse and the ease of migrating my
J2EE projects.
Today I'm happy that Borland stopped JBuilder because otherwise I would
still work it
without enjoiing the benefits of NetBeans. Please keep on developing
NetBeans!
</blockquote>

<h2>Julien Ponge</h2>

<blockquote>
Some of you might know that I am more an Eclipse guy than a Netbeans
one. However
one would be blind not to recognize the tremendous amount of effort of
Sun toward
making Netbeans a better IDE. Quite frankly, the competition between
the 2 big players
(Eclipse and Netbeans) is fruitful.
For the moment, I think that Netbeans is strong on J2EE and Swing
development.
Eclipse is not as good if you develop a Swing project, and the J2EE
stuff in WTP
is as good as in Netbeans, but much less straightforward. Eclipse is
also more versatile,
but all of this genericity comes at the price of more customization
before you can
actually work. This is were Netbeans clearly shines when it comes to
doing J2EE development. <br>
<br>
Part of my job is to teach at a French engineering school, and I have
decided that my students will do their J2EE duties with Netbeans. Here
are some reasons why.
<ul>
<li> The Netbeans + Sun Application Server bundle: There is a
full-stack J2EE server integrated
with the IDE out of the box. </li>
<li> Running a webapp is as simple as pressing the start button. It
does everything from starting
the server, reloading the webapp, launching a web browser at the right
URL and so on. </li>
<li> Students don't have to deal with web.xml, or creating the
files in the right place. </li>
<li> NetBeans uses Ant, meaning that the project can be used
outside of Netbeans, too. </li>
<li> There is an embedded database (PointBase), which is very
useful for instance when Oracle
instances are down due to other lab courses. </li>
<li> The editors are reasonably good, and the code completion in
Java classes and JSPs is
always helpful to students. </li>
<li> The JSTL support is very good, there is no reason for teaching
plain-old and ugly
JSPs anymore. </li>
</ul>
With Eclipse, things would have been slightly more difficult: get
Eclipse, get the WTP plug-ins,
get a J2EE server, install it, configure it, integrate it with
Eclipse... I don't mean that
Eclipse is any bad for J2EE development (I actually think the
opposite), but NetBeans is a
clear winner because it is (from 4.1+) simple and works out of the box.
<br>
<br>
If you have to teach J2EE as well, I strongly recommend Netbeans.
Netbeans team: Well done and keep up the good work, you've managed to
change my mind
on your IDE so much that I do enjoy using it for J2EE.
</blockquote>

<h2>Ghetto Java</h2>

<blockquote>
Excerpt from blog entry: <i><a href="http://www.ghettojava.com/2007/12/03/netbeans-back-from-the-dead-with-a-shaved-head/">
NetBeans: Back from the Dead with a Shaved Head</a></i><br>
<br>
I have been playing with NetBeans 6 since the betas and I have to say
I’m impressed. The work that has been done on the editor is amazing and
you can tell that they are taking cues from IDEA in that regard. For
the kind of development I’ve been doing lately, Struts2/Spring/JPA
webapps, NB RC1-6.0 has been solid....
</blockquote>

<h2>Balmeyer</h2>

<blockquote>
I just tried NetBeans 5.5 under Linux, plus the VisualWeb Pack, and I
am breathless. I used Eclipse for a long time, and one day, I was
curious and gave NetBeans 5.0 a try, but I still wasn't completely
convinced. Until now.
NetBeans 5.5 is incredible! I want to tear off my T-shirt in joy! The
new website is clear and easy to navigate: I know where to find the IDE
and any packs that I need. The little palette to drag and drop JSF
components in the VisualWeb Pack? Pure bliss! <br>
<p>Original Text: <i>"Je ne sais pas si c'est le bon endroit pour
poster cette remarque, mais bon,
voilà: Je viens d'essayer NetBeans 5.5 sous Linux, plus le pack
VisualWeb, et je suis soufflé: c'est terrible! Incroyable! J'ai envie
de déchirer mon T-Shirt, de joie et d'enthousiasme! J'utilisais Eclipse
depuis pas mal de temps, et puis un jour j'ai été curieux, j'ai essayé
NetBeans 5.0 et mon coeur a balancé un bon moment... Mais là, on
atteint des sommets... le site est d'une limpidité absolue, j'ai tout
compris du premier coup d'oeil: On installe l'IDE, plus un ou deux
Packs supplémentaires, si besoin. La petite palette pour
glisser-déposer les composants JSF sur la page web, que du bonheur! Non
seulement ça concurrence sérieusement Eclipse, mais également un IDE
payant comme Visual Studio 2005, que j'utilise par ailleurs... Sans
être connaisseur, j'ai vraiment le sentiment que l'équipe Netbeans a
cravaché dur pour effectuer un sacré bon en avant..."</i></p>
</blockquote>

<h2>Hans-Joerg Alles, Project Leader, Prego Services GmbH</h2>

<blockquote>
I worked with Oracle JDeveloper for a while because of heavily used
Oracle DB's in our
company. Before Version 10.1.3, it was almost impossible to follow the
concepts and code generation
behind JDeveloper.<br>
<br>
Some months ago, I tried out NetBeans and I was really surprised. Good
and well-documented
tutorials, where the examples are really running without a mistake!!!
Easy to follow
code generation, and all you need to start as a beginner and grow with
the IDE. I also
find quick help in <a href="http://blogs.sun.com/roumen/">Roman Strobl</a>
and the guys around when I had some problems with virtual
forms.<br>
<br>
Go on, you are doing a good work !!
</blockquote>

<h2>Akintayo Olusegun Don, Java Developer, Access Solutions, Nigeria</h2>

<blockquote>
I have been developing with Java since 2001. Recently, I was
called upon by a company because they "badly needed a Java developer".
I responded and began the development process using my favorite IDE of
course. The company has several developers all vast in PHP and a little
bit of desktop apps
development, but nothing about Java at all. The first developer I
worked with
noticed the "superb code completion" that exists in Netbeans 5.5. (He
actually said, "I have
to pay for this" when he later saw 6.1's code completion.) Before,
their IDE was Macromedia Dreamweaver. I told him to try NetBeans out
and I installed the PHP plugin for him.
After two days, he did something very crazy - he uninstalled
Dreamweaver, Rapid CSS and
Notepad++. He said he didn't need any other IDE. Before long, two other
developers joined
the NetBeans campaign. One day I come in with NetBeans 6.0 with SVG
plugin; this
literally blew their minds. They have been toying with SVG for some
time and now they
have not just an IDE but superb code completion. (Code completion seems
to be
their motto now.) With NetBeans 6.1, even the most adept of them all,
fully committed to
Dreamweaver before, now uses NetBeans alongside Dreamweaver. Please
note that this is not a slight to Dreamweaver - its a super IDE, the
best in its class. But these developers
now feel that NetBeans is definitely not in that class - it belongs to
a higher class. The good
thing about all this is that they aint paying a dime for it. <br>
<br>
If you have not used NetBeans, go try it out. I have used Intelli J,
Eclipse, JBuilder and
I must say that the best of them all is NetBeans.
</blockquote>





-->

</body></html>