<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Raz&otilde;es principais para trocar para o NetBeans IDE</title>
  <meta name="NAV_LINK" content="Why Switch?">
  <meta name="NAV_PRIORITY" content="2">
  <meta name="description"
 content="Top Reasons to Switch to the NetBeans IDE">
  <meta http-equiv="content-type" content="text/html; charset=UTF-8">
  <link rel="stylesheet" type="text/css" href="../netbeans.css">
</head>
<body>
<h1>Raz&otilde;es principais para trocar para o NetBeans IDE<br>
</h1>
<br>
O ambiente de desenvolvimento integrado (IDE) do NetBeans entrega. O NetBeans IDE pode aumentar sua produtividade quando estiver trabalhando com o Java SE, Java EE, ou a tecnologia Java ME, assim como com o PHP, Groovy, JavaScript e C/C++. Ferramentas visuais que geram c&oacute;digo esqueleto tamb&eacute;m est&atilde;o dispon&iacute;veis, permitindo que voc&ecirc; crie aplicativos b&aacute;sicos sem escrever uma &uacute;nica linha de c&oacute;digo.<br>
<br>
Aqui est&atilde;o as raz&otilde;es principais para usar o NetBeans IDE:<br>
<ol>
  <li><strong>Funciona fora da caixa</strong>
    <p>Basta fazer o <a href="https://netbeans.org/downloads/index.html">download</a> e instale o NetBeans IDE e voc&ecirc; est&aacute; pronto para iniciar. A instala&ccedil;&atilde;o &eacute; super f&aacute;cil com seu pequeno tamanho de download. Todos as ferramentas e recursos do IDE est&atilde;o totalmente integrados&mdash;n&atilde;o &eacute; preciso ca&ccedil;ar plug-ins&mdash;e eles funcionam junto quando voc&ecirc; inicia o IDE.</p>
  </li>
  <li><strong>C&oacute;digo-fonte aberto e gr&aacute;tis</strong>
    <p> Quando voc&ecirc; usa o NetBeans IDE, voc&ecirc; participa de uma <a
 href="https://netbeans.org/community/index.html">comunidade de c&oacute;digo-fonte aberto</a> vibrante, de milhares de usu&aacute;rios prontos para ajudar e contribuir. H&aacute; discuss&otilde;es nas <a
 href="https://netbeans.org/community/lists/" target="_blank">listas de correio do NetBeans</a>, blogs no <a href="http://www.planetnetbeans.org/">PlanetNetBeans</a> e <a href="http://wiki.netbeans.org/wiki/view/NetBeansUserFAQ"
 target="_blank">FAQs</a> que ajudam. </p>
  </li>
  <li><strong>Desenvolvedor conectado</strong>
    <p> O NetBeans IDE &eacute; a ferramenta de escolha por equipes trabalhando em um <a
 href="https://netbeans.org/kb/trails/tools.html">ambiente colaborativo</a>. Voc&ecirc; pode criar e gerenciar projetos java.net hospedados, por exemplo; registrar relat&oacute;rios de rastreamento de quest&otilde;es usando o Jira e o Bugzilla, e colaborar com os desenvolvedores&mdash;tudo diretamente da interface familiar do IDE. </p>
  </li>
  <li><strong>Poderoso GUI Builder</strong>
    <p>O GUI Builder (anteriormente conhecido como Project Matisse) suporta um sofisticado e simplificado<a
 href="http://java.sun.com/developer/technicalArticles/javase/swingappfr/">Swing Application Framework</a> e <a
 href="https://netbeans.org/kb/docs/java/gui-binding.html">Beans Binding</a>. <span style="margin-bottom: 0in;">Agora voc&ecirc; pode <a
 href="https://netbeans.org/files/documents/4/475/matisse.html"
 target="_blank">construir IGUs</a> de forma natural.</span></p>
  </li>
  <li><strong>Suporte para padr&otilde;es e plataformas Java </strong>
    <p>O IDE fornece solu&ccedil;&otilde;es do princ&iacute;pio ao fim para todas as plataformas de desenvolvimento Java, incluindo os padr&otilde;es Java mais recentes.  </p>
    <ul>
      <li><strong>Java Mobility Support</strong> Ambiente completo para criar, testar e executar aplicativos para dispositivos m&oacute;veis. Com blocos de pr&eacute;-processador, voc&ecirc; pode tratar imediatamente de quest&otilde;es de fragmenta&ccedil;&atilde;o. O suporte para o desenvolvimento Java Mobility &eacute; o melhor entre todas as ferramentas de desenvolvimento Java.</li>
      <li><strong>Suporte para o Java Enterprise Edition (EE) 6</strong>: O primeiro IDE gr&aacute;tis de c&oacute;digo-fonte aberto para suportar as especifica&ccedil;&otilde;es do Java EE 6.</li>
      <li><strong>Suporte para o Java Standard Edition (SE)</strong>: Voc&ecirc; pode desenvolver aplicativos usando os padr&otilde;es mais recentes do Java SE. </li>
    </ul>
  </li>
  <li><strong>Ferramentas de perfilamento e depura&ccedil;&atilde;o</strong>
    <p>Com o NetBeans IDE <a href="../features/java/profiler.html"
 target="_blank">profiler</a>, voc&ecirc; pode obter um vis&atilde;o em tempo real do uso de mem&oacute;ria e potenciais gargalos de desempenho. Mais ainda, voc&ecirc; pode instrumentar partes espec&iacute;ficas do c&oacute;digo para evitar a degrada&ccedil;&atilde;o de desempenho durante o perfilamento. A ferramenta <a
 href="http://profiler.netbeans.org/docs/help/6.0/heapwalker.html"
 target="_blank">HeapWalker</a> ajuda a avaliar o conte&uacute;do do heap do Java e encontrar vazamentos de mem&oacute;ria.<br>
    </p>
  </li>
  <li><strong>Suporte para linguagem din&acirc;mica</strong>
    <p> O <span style="margin-bottom: 0in;">NetBeans IDE fornece o suporte integrado para linguagens de script, como o <a
 href="https://netbeans.org/features/php/index.html">PHP</a>, <a
 href="https://netbeans.org/features/groovy/index.html">Groovy</a> e o <a href="https://netbeans.org/features/javascript/index.html">JavaScript</a>.</span></p>
    <ul>
      <li><strong>PHP</strong>: Com o NetBeans IDE para o PHP, voc&ecirc; obt&eacute;m o melhor dos dois mundos: a produtividade de um IDE (conclus&atilde;o de c&oacute;digo, verifica&ccedil;&atilde;o de erro em tempo real, depura&ccedil;&atilde;o e mais) com a velocidade e simplicidade de seu editor de texto favorito em um download de menos de 30mb.</li>
      <li><strong>JavaScript</strong>: O NetBeans IDE tem as ferramentas do JavaScript que voc&ecirc; precisa: um editor JavaScript inteligente, conclus&atilde;o de c&oacute;digo CSS/HTML, a habilidade de depurar JavaScript no Firefox e no IE, e populares bibliotecas JavaScript incorporadas. Sua estrutura JavaScript favorita ir&aacute; lev&aacute;-lo a 80% do caminho, e o NetBeans IDE ir&aacute; ajud&aacute;-lo com os 20% restantes<span style="text-decoration: underline;"></span>.</li>
      <li><strong>Groovy</strong>: No NetBeans IDE, voc&ecirc; pode criar aplicativos Grails, integrar scripts Groovy com seu projeto JavaSE.</li>
<!--<li><strong>JavaFX</strong>: The NetBeans IDE is the official
tool for JavaFX development! See your visual code live in the editor,
and analyze your application's performance with the JavaFX Profiler. <br>
      </li>-->
    </ul>
  </li>
  <li><strong>Plataforma extens&iacute;vel</strong>
    <p> Comece com sua <a href="http://platform.netbeans.org"
 target="_blank">plataforma extens&iacute;vel</a> e adicione seus pr&oacute;prios recursos e extens&otilde;es NetBeans IDE ou construa um aplicativo to tipo IDE, mantendo somente os recursos que desejar. A extens&atilde;o da plataforma e sua funda&ccedil;&atilde;o com base no Swing economiza tempo de desenvolvimento e pode otimizar o desempenho </p>
  </li>
  <li><strong>Projetos personaliz&aacute;veis</strong>
    <p>Atrav&eacute;s do processo de compila&ccedil;&atilde;o do NetBeans IDE, que se ap&oacute;ia em padr&otilde;es da ind&uacute;stria como o <a href="http://ant.apache.org/" target="_blank">Apache Ant</a>, <a href="http://www.gnu.org/software/make/">make</a>, <a
 href="http://maven.apache.org/">Maven</a> e o <a
 href="http://rake.rubyforge.org/">rake</a>, ao inv&eacute;s de um processo de compila&ccedil;&atilde;o propriet&aacute;rio, voc&ecirc; pode personalizar com facilidade projetos e adicionar funcionalidade. Voc&ecirc; pode compilar, executar e implementar projetos em servidores fora do IDE. </p>
  </li>
  <li><strong>Suporte ao c&oacute;digo n&atilde;o Java</strong>
    <p> Voc&ecirc; n&atilde;o est&aacute; limitado &agrave; linguagem de programa&ccedil;&atilde;o Java. Voc&ecirc; pode incluir muitas outras linguagens de programa&ccedil;&atilde;o, como o <a
 href="https://netbeans.org/features/cpp/index.html">C/C++</a>, linguagens de script como o JavaScript, etc. E ainda mais excitante, <a
 href="http://wiki.netbeans.org/wiki/view/Schliemann">definir sua pr&oacute;pria linguagem</a> e inclu&iacute;-la em seus projetos.</p>
  </li>
  <li><strong>Suporte dedicado dispon&iacute;vel</strong>
    <p> Quando n&atilde;o puder obter a ajuda necess&aacute;ria da comunidade, considere usar <a href="../kb/support.html">Pacotes de Suporte ao Desenvolvedor</a>, que oferecem conselho de programa&ccedil;&atilde;o, suporte de software e cr&eacute;ditos de <a
 href="../kb/training.html">treinamento</a>. </p>
  </li>
</ol>
<h2>O que vir&aacute; a seguir?</h2>
<ul>
  <li><a href="https://netbeans.org/downloads/index.html"
 target="_blank">Fa&ccedil;a o download</a> do NetBeans IDE mais recente.<br>
  </li>
  <li>Assista aos <a
 href="https://netbeans.org/kb/docs/intro-screencasts.html"
 target="_blank">V&iacute;deos Guiados do NetBeans IDE</a> para ver como pode rapidamente colocar seus poderosos recursos em uso.</li>
  <li>Explore todos os nosso <a href="https://netbeans.org/kb/index.html">tutoriais</a>.</li>
  <li>Leia sobre o que os <a
 href="https://netbeans.org/about/press/index.html">desenvolvedores e a imprensa</a> est&atilde;o dizendo sobre o NetBeans IDE. </li>
  <li>Participe de uma <a href="https://netbeans.org/community/lists/"
 target="_blank">lista de correio</a> ou <a
 href="https://netbeans.org/community/news/newsletter/index.html"
 target="_blank">assine</a><a
 href="https://netbeans.org/community/news/newsletter/index.html"> para a NetBeans Newsletter</a>.</li>
</ul>
<p>&nbsp;</p>
</body>
</html>
