<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">

<!--
Copyright (c) 2009, 2010, Oracle and/or its affiliates. All rights reserved.
-->

<HTML>
<HEAD>
<TITLE>Assistente Cliente m&oacute;vel para aplicativo da web: Cria&ccedil;&atilde;o de um aplicativo cliente-servidor - Tutorial do NetBeans Java ME</TITLE>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" >
<link rel="stylesheet" type="text/css" href="../../../netbeans.css">

</HEAD>
<BODY>
<a name="top"></a>
<H1>Assistente Cliente m&oacute;vel para aplicativo da web: Cria&ccedil;&atilde;o de um aplicativo cliente-servidor </H1>
<p>O IDE permite que voc&ecirc; crie MIDlets clientes que podem se conectar aos servi&ccedil;os Web por meio de um aplicativo Web middleware.</p>
<P>Este tutorial mostra como usar o assistente Cliente m&oacute;vel para aplicativo Web para criar uma conex&atilde;o com os servi&ccedil;os web se os seus dispositivos n&atilde;o oferecerem suporte &agrave; <a href="http://jcp.org/en/jsr/summary?id=172">especifica&ccedil;&atilde;o JSR-172</a> para a plataforma Java ME. O assistente gera um servlet para calcular dois n&uacute;meros que se conecta a um aplicativo web que inclui um cliente de servi&ccedil;o web e cont&eacute;m o m&eacute;todo para somar os n&uacute;meros fornecidos.</p> 


<p>Se ainda n&atilde;o estiver familiarizado com o NetBeans Mobility ou o J2EE, antes de continuar seria recomend&aacute;vel ler o <A HREF="../../docs/javame/quickstart.html">Guia de in&iacute;cio r&aacute;pido do NetBeans Java ME MIDP</A>.</p>
 
 <p><b>Conte&uacute;do</b></p>
 <img  src="../../../images_www/articles/70/netbeans-stamp.gif" class="stamp" width="114" height="114" alt="O conte&uacute;do desta p&aacute;gina se aplica ao NetBeans IDE 7.0" title="O conte&uacute;do desta p&aacute;gina se aplica ao NetBeans IDE 7.0" >
  <ul class="class">
  
   <li><a href="#create-web">Criando o projeto web</a>
<ul>
	<LI><A HREF="#create">Configurando um projeto de aplica&ccedil;&atilde;o Web</A> 
	</LI>
	<LI><A HREF="#add">Adicionando l&oacute;gica de neg&oacute;cio</A> 
	</LI>
	
	<LI><A HREF="#comp">Compilando o projeto</A> 
	</LI>
</ul></li>
   <li><a href="#create-mob">Criando projeto m&oacute;vel</a>
   
<ul>
	<LI><A HREF="#create-prj">Criando o projeto
</A> 
	</LI>
	<LI><A HREF="#add-pkg">Adicionando pacote e um MIDlet visual ao projeto</A> 
	</LI>
	<li><A href="#add-component">Adicionando componentes ao projeto</a></li>
	<li><A HREF="#add-command">Adicionando comandos ao projeto</a></li>
	<li><A HREF="#connect-component">Conectando os componentes para criar um fluxo de aplicativo</a></li>
	<li><A HREF="#wizard">Assistente Usando o Cliente Java ME para aplicativo web</A></li>
	<li><A HREF="#wizCode">Adicionando c&oacute;digo-fonte to cliente Java ME</A></li>
	</ul></li>
	<LI><A HREF="#deploy">Implementado o projeto web</A> 
	</LI>
	<LI><A HREF="#run">Executando o projeto m&oacute;vel</A> 
	</LI>
	<LI><A HREF="#check">Verificando o funcionamento</A> 
	</LI>
   <li><a href="#see-also">Consulte tamb&eacute;m</a></li>
  </ul>
 <p><b>Para acompanhar este tutorial, s&atilde;o necess&aacute;rios os recursos e softwares listados abaixo.</b></p>


<table>
        <tbody>
            <tr>
                <th class="tblheader" scope="col">Software ou recurso</th>
                <th class="tblheader" scope="col">Vers&atilde;o necess&aacute;ria</th>
            </tr> 
            <tr>
                <td class="tbltd1"><a href="https://netbeans.org/downloads/index.html">NetBeans IDE com Java ME</a></td>
              <td class="tbltd1">Vers&atilde;o 7.0 e superior </td>
            </tr>
            <tr>
                <td class="tbltd1"><a href="http://www.oracle.com/technetwork/java/javase/downloads/index.html">Java Development Kit</a> (JDK)</td>
                <td class="tbltd1">Vers&atilde;o 6</td>
            </tr>      
            <tr>
                <td class="tbltd1">GlassFish ou Tomcat</td>
                <td class="tbltd1">Inclu&iacute;do no <b>Java EE</b> e em <b>todas</b> as instala&ccedil;&otilde;es do IDE</td>
            </tr>      

        </tbody>
</table>

<!--<a name="sample-app"></a>
<H2>Installing and Running the Sample Application</H2>

<P>Before we begin you might want to see final result of the tutorial.</P>
<p>Placeholder</p>

<P>Take the following steps to install the <tt>LoginScreenExample</tt> application:</P>
<OL>
	<LI>Download <A HREF="https://netbeans.org/projects/samples/downloads/download/Samples/Mobile/WebToMobile.zip">WebToMobileExample.zip</A>. This download contains the completed NetBeans Mobility and Web projects.</LI>
	<LI>Unzip the file.</LI>
	<LI>In the IDE, choose <tt>File</tt> &gt; <tt>Open Project</tt> and browse to the folder that contains the unzipped files with the <tt>WebToMobileExample</tt> project.</LI>
	<li>Click Open Project.</li>
	<LI>The Projects view should look like the following:</li>
	<p class="align-center"> 
	<IMG SRC="../../../images_www/articles/71/mobility/webtomobile/.png" NAME="graphics1" ALT="Project window with sample projects opened"  BORDER=1>  </p>
	
	<LI>In the Projects window,
	right-click the project <tt>AAA</tt> node and choose
	Run Project (or press F6 key).</li>
	<li>Right-click the
	project <tt>AAA</tt> node and choose Run Project. As the
	application runs, an emulator window opens and displays the
	application running in the default device emulator.	</LI>
	<LI>In the Emulator window, click the button underneath
	&quot;Launch&quot;.<BR>The emulator displays BBB, as shown:</li> <p class="align-center"><IMG SRC="../../../images_www/articles/71/mobility/webtomobile/.png" NAME="graphics3" ALT="placeholder" BORDER=1>  </p>
</OL>
<UL>
	<LI>Moving the cursor up and down allows you to
	navigate between the Login and Password fields. 
	</LI>
	<li>Click on the central button enables the selected text field for editing.</li>
	<LI>Click the button underneath &quot;Login&quot; to finish. 
	</LI>
	<LI>If the application  connects to the server, you'll
	see the <code>alert1</code> component displayed on the screen  with a &quot;Login
	Successful&quot; message. 
	</LI>
</UL>
 <p class="align-center"><a href="#top">top</a></p>-->
<a name="create-web"></a>
<H2>Criando o projeto web</H2>
<p>Antes de usar o assistente Cliente m&oacute;vel para aplicativo web, voc&ecirc; deve ter um projeto web que inclua um cliente de servi&ccedil;o web.</p>
<P><!--Now that you have seen the AAA in action,--> Vamos
<!--go back to the beginning and-->
 criar um novo projeto de aplicativo web para nosso Servlet Java do in&iacute;cio. Para criar um aplicativo Java no IDE, fa&ccedil;a o seguinte:</P>
<OL>
	
	<LI><A HREF="#create">Configure um projeto de aplicativo web</A> 
	</LI>
	<LI><A HREF="#add">Adicione l&oacute;gica de neg&oacute;cio</A> 
	</LI>
	
	<LI><A HREF="#comp">Compile o projeto</A> 
	</LI>

</OL>
<H3><A NAME="create"></A>Configurando um projeto de aplica&ccedil;&atilde;o Web</H3>
<OL>
	<LI>Escolha <tt>Arquivo</tt> &gt; <tt>Novo projeto (Ctrl-Shift-N)</tt>. Em Categorias, selecione Java Web. Em Projetos, selecione aplicativo Web e clique em Pr&oacute;ximo. 
	</LI>
	<LI>Digite <CODE>WebApplication</CODE> no campo Nome do projeto. Especifique a Localiza&ccedil;&atilde;o do projeto para qualquer diret&oacute;rio no computador. Para fins deste tutorial, esse diret&oacute;rio &eacute; chamado de <tt>NetBeansProjects</tt>. 
	</LI>
	<li>(Opcional) Marque a caixa de verifica&ccedil;&atilde;o Utilizar pasta dedicada para armazenamento de bibliotecas e especifique o local da pasta de bibliotecas.</li>
	<li>Desmarque a caixa de verifica&ccedil;&atilde;o Definir como projeto principal e clique em Pr&oacute;ximo. </li>
	<li>No painel Servidor e configura&ccedil;&otilde;es, deixe GlassFish Server 3.1 como o servidor no qual seu aplicativo para dispositivos m&oacute;veis ser&aacute; implementado posteriormente e deixe J2EE 1.4 como a vers&atilde;o que deseja usar com seu aplicativo.</li>
	<li>Deixe Definir n&iacute;vel de c&oacute;digo-fonte para 1.4 selecionado.
	  <p class="notes"><b>Observa&ccedil;&atilde;o:</b> o Caminho de contexto (ou seja, no servidor) se torna <tt>/WebApplication</tt>, que est&aacute; baseado no nome dado ao projeto na etapa anterior.</p>
  </li>
	<li>Clique em Pr&oacute;ximo. No painel Frameworks, clique em Terminar para criar o projeto.<br>
      O IDE cria a pasta do projeto <tt>NetBeansProjects/WebApplication</tt>. A pasta do projeto cont&eacute;m todas as fontes e metadados do projeto, como o script de constru&ccedil;&atilde;o Ant do projeto. O projeto WebApplication &eacute; aberto no IDE. A p&aacute;gina de boas vindas, index.jsp, se abre no editor de c&oacute;digo-fonte na janela principal. </li>
</ol>
<p class="align-center">
		 <a href="../../../images_www/articles/71/mobility/webtomobile/projects-window.png" rel="lytebox"
                       title="Projeto WebApplication e index.jsp"> <img src="../../../images_www/articles/71/mobility/webtomobile/projects-window-reduced.png"
                     alt="Projeto WebApplication e index.jsp" border=1></a></p>


<H3><A NAME="add"></A>Adicionando l&oacute;gica de neg&oacute;cio</H3>
<p>Para criar uma classe Java com um m&eacute;todo p&uacute;blico dentro de um projeto web que representar&aacute; a l&oacute;gica de neg&oacute;cio do aplicativo, execute as seguintes etapas: </p>
<ol>
<li>Na janela Projetos, clique com o bot&atilde;o direito do mouse no n&oacute; <tt>Pacotes de c&oacute;digo-fonte</tt> e selecione Novo &gt; Pacote Java. Digite <tt>MyPackage</tt> na caixa de texto Nome do pacote e clique em Terminar.</li>
<li>Clique com o bot&atilde;o direito do mouse no n&oacute; <tt>MyPackage</tt> criado e escolha Novo &gt; Classe Java. Digite <tt>Calculator</tt> na caixa de texto Nome da classe e clique em Terminar. </li>
<li>No arquivo <tt>Calculator.java</tt> que &eacute; aberto no Editor de c&oacute;digo-fonte, insira o seguinte m&eacute;todo: 
<pre> public int calcSum(int a, int b) {
        return a + b;
    } </pre>
	</li>
<li>Pressione Ctrl + S para salvar suas edi&ccedil;&otilde;es.</li>
</ol>
<H3><A NAME="comp"></A>Compilando o projeto</H3>
<p>Na janela Projetos, clique com o bot&atilde;o direito do mouse no n&oacute; do projeto <tt>WebApplication</tt> e escolha Compilar (F11).<br>Seu aplicativo web para somar n&uacute;meros est&aacute; pronto.</p>
<p class="notes"><b>Observa&ccedil;&atilde;o:</b> por padr&atilde;o, o projeto foi criado com o recurso Compilar ao salvar ativado, assim, n&atilde;o &eacute; necess&aacute;rio compilar o c&oacute;digo primeiro.</p>
<p class="align-center">
		 <a href="../../../images_www/articles/71/mobility/webtomobile/calculator.png" rel="lytebox"
                       title="Calculator.java"> <img src="../../../images_www/articles/71/mobility/webtomobile/calculator-reduced.png"
                     alt="Calculator.java" border=1></a></p>




<a name="create-mob"></a>
<h2>Criando o projeto m&oacute;vel</h2>
<p>O IDE permite criar um MIDlet cliente que pode se conectar a um aplicativo web rec&eacute;m-criado, fornecer dois n&uacute;meros a ele e exibir sua soma. </p>
<p> Para criar um aplicativo cliente Java ME, fa&ccedil;a o seguinte:</P>
<OL>
	
	<LI><A HREF="#create-prj">Crie o projeto</A> 
	</LI>
	<LI><A HREF="#add-pkg">Adicione pacote e um MIDlet visual ao projeto</A> 
	</LI>
	
	<LI><A HREF="#add-component">Adicione componentes ao projeto</A> 
	</LI>
	<li><A HREF="#add-command">Adicione comandos ao projeto</a></li>
	<li><A HREF="#connect-component">Conecte os componentes para criar um fluxo de aplicativo</a></li>
	<li><a href="#wizard">Assistente Cliente Java ME para aplicativo web</a></li>
</ol>
<H3><A NAME="create-prj"></A>Criando o projeto
</H3>
<p>O NetBeans IDE fornece um assistente que permite que voc&ecirc; crie rapidamente um projeto MIDP.</p>
<OL>
	<LI>Escolha <tt>Arquivo</tt> &gt; <tt>Novo projeto (Ctrl-Shift-N)</tt>. Em Categorias, selecione Java ME. Em Projetos, selecione Aplicativo m&oacute;vel e clique em Pr&oacute;ximo.	</LI>
	<LI>Digite <tt>MobileApplication</tt> no campo Nome do projeto. Altere a Localiza&ccedil;&atilde;o do projeto para um diret&oacute;rio em seu sistema. Neste tutorial, esse diret&oacute;rio &eacute; definido como <tt>NetBeansProjects</tt>.</LI>
	<LI>Desmarque a caixa de verifica&ccedil;&atilde;o Criar Hello MIDlet (ela &eacute; marcada por padr&atilde;o). Clique em Pr&oacute;ximo.	</LI>
	<LI>Deixe o Java(TM) Platform Micro Edition SDK 3.0 como a plataforma do emulador selecionada. Clique em Pr&oacute;ximo e em Terminar.<br>
	O IDE cria a pasta do projeto <tt>NetBeansProjects/MobileApplication</tt>.<br>A pasta do projeto cont&eacute;m todos os c&oacute;digos-fonte e os metadados do projeto, como o script Ant do projeto.
	<p class="align-center"> 
	<IMG SRC="../../../images_www/articles/71/mobility/webtomobile/mobile-prj-created.png" NAME="graphics1" ALT="Projeto MobileApplication criado"  BORDER=1>  </p>
	</LI>
</OL>

<h3><A NAME="add-pkg"></A>Adicionando pacote e um MIDlet visual ao projeto</h3>


<OL>
	<LI>Selecione o projeto <CODE>MobileApplication</CODE> na janela Projetos e, a seguir, selecione<tt>Arquivo</tt> &gt; <tt>Novo arquivo (Ctrl-N)</tt> . Em Categorias, selecione MIDP. Em Tipos de arquivo, selecione
	MIDlet visual. Clique em Pr&oacute;ximo.</LI>

  <LI>Digite <CODE>Calculator</CODE> nos campos Nome do MIDlet e Nome da classe MIDP e <tt>CalculatorPackage</tt> no campo de texto Pacote. Clique em Terminar.<br>
  O aplicativo &eacute; exibido na janela Design de fluxo do Visual Mobile Designer. 
	
<p class="align-center">
		 <a href="../../../images_www/articles/71/mobility/webtomobile/midlet-added.png" rel="lytebox"
                       title="Pacote e MIDlet visual adicionados"> <img src="../../../images_www/articles/71/mobility/webtomobile/midlet-added-reduced.png"
                     alt="Pacote e MIDlet visual adicionados" border=1></a></p>
					  </LI>
	
</OL>
<h3><A NAME="add-component"></A>Adicionando componentes ao projeto</h3>

<OL>

	<LI>Na Visualiza&ccedil;&atilde;o de fluxo, arraste e solte os componentes a seguir da se&ccedil;&atilde;o Exib&iacute;veis da Paleta:
	<UL>
		<LI>Tela de espera</LI>
		<LI>Formul&aacute;rio (x2)</LI>
		<li>Alerta
		<p class="align-center">
		 <a href="../../../images_www/articles/71/mobility/webtomobile/components-added.png" rel="lytebox"
                       title="Componentes adicionados"> <img src="../../../images_www/articles/71/mobility/webtomobile/components-added-reduced.png"
                     alt="Componentes adicionados" border=1></a></p></li>
	</UL> </LI>
	<li>Clique em Tela para alternar para a exibi&ccedil;&atilde;o Tela e selecione <tt>form</tt> na lista suspensa &agrave; direita do bot&atilde;o Analisador.</li>
<li>Clique com o bot&atilde;o direito do mouse no componente <tt>form</tt> e selecione <tt>Novo/Adicionar</tt> &gt; <tt>Campo de texto</tt> no menu pop-up.</li>
<li>Repita a etapa 3 para adicionar outro Campo de texto a seu formul&aacute;rio.</li>
  <li>Selecione o componente <tt>textField</tt> e digite <tt>A</tt> como o valor de <tt>Label</tt> na janela Propriedades (abaixo da Paleta).</li>
  <li>Clique com o bot&atilde;o direito do mouse no componente <tt>A</tt> e escolha Renomear no menu pop-up.</li>
 
  <li>Na caixa de di&aacute;logo Renomear, digite <tt>fieldA</tt> no campo Novo nome e clique em OK.</li>
  <li>Selecione o componente <tt>textField1</tt> e digite <tt>B</tt> como o valor de <tt>Label</tt> na janela Propriedades.</li>
  <li>Clique com o bot&atilde;o direito do mouse no componente <tt>B</tt> e escolha Renomear no menu pop-up.</li>
  <li>Na caixa de di&aacute;logo Renomear, digite <tt>fieldB</tt> no campo Novo nome e clique em OK.<br>
  Os campos renomeados representar&atilde;o os argumentos do m&eacute;todo <tt>calcSum</tt>.
  <p class="align-center">
		 <a href="../../../images_www/articles/71/mobility/webtomobile/fields.png" rel="lytebox"
                       title="Campos A e B"> <img src="../../../images_www/articles/71/mobility/webtomobile/fields-reduced.png"
                     alt="Campos A e B" border=1></a></p></li>
  <li>Selecione <tt>form1</tt> na lista suspensa &agrave; direita do bot&atilde;o Analisador.</li>
  <li>Clique com o bot&atilde;o direito do mouse no componente <tt>form1</tt> e selecione <tt>Novo/Adicionar</tt> &gt; <tt>Campo de texto</tt> no menu pop-up.</li>
  <li>Selecione o componente <tt>textField</tt> e digite <tt>Result</tt> como o valor de <tt>Label</tt> na janela Propriedades.</li>
  <li>Clique com o bot&atilde;o direito do mouse no componente <tt>Result</tt> e escolha Renomear no menu pop-up.</li>
  <li>Na caixa de di&aacute;logo Renomear, digite <tt>resultField</tt> no campo Novo nome e clique em OK.<br>O campo renomeado destina-se a exibir a sa&iacute;da do m&eacute;todo <tt>calcSum</tt>.
  <p class="align-center">
		 <a href="../../../images_www/articles/71/mobility/webtomobile/resultfield.png" rel="lytebox"
                       title="Campo do resultado"> <img src="../../../images_www/articles/71/mobility/webtomobile/resultfield-reduced.png"
                     alt="Campo do resultado" border=1></a></p></li>

<li>Selecione <tt>alert</tt> na lista suspensa &agrave; direita do bot&atilde;o Analisador.</li>
<li> Na janela Propriedades, altere a propriedade <tt>Title</tt> para <tt>Alerta</tt> e a propriedade <tt>String</tt> para <tt>Erro ao obter resultados do aplicativo web</tt>.<br>O alerta ser&aacute; exibido caso o aplicativo web n&atilde;o retorne qualquer resultado.
<p class="align-center">
		 <a href="../../../images_www/articles/71/mobility/webtomobile/alert.png" rel="lytebox"
                       title="Campo de alerta"> <img src="../../../images_www/articles/71/mobility/webtomobile/alert-reduced.png"
                     alt="Campo de alerta" border=1></a></p>	</li>				 
</ol>


<h3><A NAME="add-command"></A>Adicionando comandos ao projeto</h3>
<ol>
<li>Na visualiza&ccedil;&atilde;o Tela, com <tt>form1</tt> selecionado, clique com o bot&atilde;o direito do mouse dentro da Tela de dispositivos e selecione <tt>Novo/Adicional</tt> &gt; <tt>Comando Sair</tt> no menu pop-up.

<p class="align-center">
		 <a href="../../../images_www/articles/71/mobility/webtomobile/second-form.png" rel="lytebox"
                       title="Form1: exitCommand adicionado"> <img src="../../../images_www/articles/71/mobility/webtomobile/second-form-reduced.png"
                     alt="Form1: exitCommand adicionado" border=1></a></p> </li>
<li>Na visualiza&ccedil;&atilde;o Tela, Selecione <tt>form</tt> na lista suspensa &agrave; direita do bot&atilde;o Analisador.</li>
<li>Clique com o bot&atilde;o direito do mouse dentro da Tela de dispositivos e selecione <tt>Novo/Adicional</tt> &gt; <tt>Comando Ok</tt> no menu pop-up.</li>
<li>Repita a etapa 4 para adicionar <tt>Comando Cancelar</tt> a partir do menu pop-up.

<p class="align-center">
		 <a href="../../../images_www/articles/71/mobility/webtomobile/first-form.png" rel="lytebox"
                       title="Form: okCommand e cancelCommand adicionados"> <img src="../../../images_www/articles/71/mobility/webtomobile/first-form-reduced.png"
                     alt="Form: okCommand e cancelCommand adicionados" border=1></a></p></li>

<li>Pressione Ctrl + S para salvar suas edi&ccedil;&otilde;es.</li>
</ol>
<h3><A NAME="connect-component"></A>Conectando os componentes para criar um fluxo de aplicativo</h3>
<p>Na visualiza&ccedil;&atilde;o Fluxo, clique no texto <tt>Started</tt> no Dispositivo m&oacute;vel e arraste-o para o componente <tt>form</tt>. Da mesma forma, conecte os componentes como mostrado no gr&aacute;fico seguinte.</p>

<p class="align-center">
		 <a href="../../../images_www/articles/71/mobility/webtomobile/app-flow.png" rel="lytebox"
                       title="Fluxo de aplicativo"> <img src="../../../images_www/articles/71/mobility/webtomobile/app-flow-reduced.png"
                     alt="Fluxo de aplicativo" border=1></a></p>
<h3><A NAME="wizard"></A>Assistente Cliente Java ME para aplicativo web</h3>
<p>Vamos usar o assistente Cliente Java ME para aplicativo web para criar um cliente para dispositivos m&oacute;veis dentro do projeto m&oacute;vel com a sele&ccedil;&atilde;o do m&eacute;todo <tt>calcSum</tt>.</p>
<OL>
	<LI>Expanda <tt>MobileApplication</tt>, clique com o bot&atilde;o direito do mouse em <tt>Pacotes de c&oacute;digo-fonte</tt> e selecione <tt>Novo</tt> &gt; <tt>Cliente Java ME para aplicativo web</tt>.</LI>
	<li>No painel Tipo de servlet e de cliente, selecione o tipo de aplicativo web com o qual o MIDlet interage: digite <tt>WebToMobileServlet</tt> como o Nome do servlet, assegure-se de que op&ccedil;&atilde;o M&eacute;todos no Aplicativo web esteja selecionada (como o cliente m&oacute;vel se conectar&aacute; diretamente ao aplicativo web) e clique em Pr&oacute;ximo.
	
	
	<p class="align-center">
		 <a href="../../../images_www/articles/71/mobility/webtomobile/wizard.png" rel="lytebox"
                       title="Assistente"> <img src="../../../images_www/articles/71/mobility/webtomobile/wizard-reduced.png"
                     alt="Assistente" border=1></a></p></li>
	<li>No painel M&eacute;todos no projeto web, marque <tt>int calcSum (int a, int b)</tt> e clique em Pr&oacute;ximo.</li>
	<li>No painel Op&ccedil;&otilde;es do cliente, deixe o nome e o pacote da classe do cliente gerada como est&atilde;o, assegure-se de que as op&ccedil;&otilde;es Gerar stubs e Permitir ponto flutuante estejam marcadas e clique em Terminar.<br>
	O cliente Java ME e os arquivos de mapeamento s&atilde;o gerados sob o projeto Java ME.<br>
	O servlet e as classes de apoio s&atilde;o geradas sob o projeto web.
	<p class="align-center">
		 <a href="../../../images_www/articles/71/mobility/webtomobile/client-generated.png" rel="lytebox"
                       title="Cliente Java ME gerado"> <img src="../../../images_www/articles/71/mobility/webtomobile/client-generated-reduced.png"
                     alt="Cliente Java ME gerado" border=1></a></p></li>
</ol>
<h3><A NAME="wizCode"></A>Adicionando c&oacute;digo-fonte ao cliente Java ME</h3>
<ol>
<li>Clique na aba <tt>Calculator.java</tt>.</li>
 <li>Na visualiza&ccedil;&atilde;o Tela, Selecione <tt>waitScreen</tt> na lista suspensa &agrave; direita do bot&atilde;o Analisador.</li>
 <li>Clique com o bot&atilde;o direito do mouse na <tt>tarefa [SimpleCancellableTask]</tt> em Recursos e selecione Ir para o c&oacute;digo-fonte no menu pop-up.</li>
 <li>Na janela Editor de c&oacute;digo-fonte, localize a se&ccedil;&atilde;o <tt>// write task-execution user code here&quot;</tt> e substitua-a pelo seguinte c&oacute;digo:
<pre>    WebToMobileClient wc = new WebToMobileClient();
    int a = Integer.valueOf(getFieldA().getString()).intValue();
    int b = Integer.valueOf(getFieldB().getString()).intValue();
    int result = wc.calcSum(a, b);
    System.out.println(result);
    getResultField().setString(String.valueOf(result));</pre></li> 
<li>Pressione Ctrl + S para salvar suas edi&ccedil;&otilde;es.</li>	
</ol>


<a name="deploy"></a><H2>Implementado o projeto web</H2>
<p>Para implementar o aplicativo web, na janela Projetos, clique com o bot&atilde;o direito do mouse no n&oacute; <tt>WebApplication</tt> e selecione Implementar no menu pop-up.<br>A janela Sa&iacute;da exibe o seguinte:</p>
<p class="align-center">
		 <a href="../../../images_www/articles/71/mobility/webtomobile/web-deploy.png" rel="lytebox"
                       title="WebApplication implementado"> <img src="../../../images_www/articles/71/mobility/webtomobile/web-deploy-reduced.png"
                     alt="WebApplication implementado" border=1></a></p>


 <p class="align-center"><a href="#top">in&iacute;cio</a></p>
 <H2><A NAME="run"></A>Executando o projeto do cliente</H2>


	<p> Para executar o aplicativo cliente m&oacute;vel, selecione <tt>Executar</tt> &gt; <tt>Executar o projeto principal</tt> ou pressione F6 para executar o projeto principal.</p>
    <p class="notes"><b>Observa&ccedil;&atilde;o:</b> Antes de executar o aplicativo cliente, verifique se o aplicativo do lado do servidor est&aacute; implementado e em execu&ccedil;&atilde;o.</p>
<p>Conforme <tt>MobileApplication</tt> &eacute; executado, uma janela do emulador &eacute; aberta e exibe o aplicativo em execu&ccedil;&atilde;o no emulador do dispositivo padr&atilde;o.</p>
<p class="align-center">
		 <a href="../../../images_www/articles/71/mobility/webtomobile/client-run.png" rel="lytebox"
                       title="Aplicativo cliente no emulador"> <img src="../../../images_www/articles/71/mobility/webtomobile/client-run-reduced.png"
                     alt="Aplicativo cliente no emulador" border=1></a></p>


<a name="check"></a><H2>Verificando o funcionamento</H2>
<ol>
<li>Na janela Emulador, digite qualquer n&uacute;mero no campo A, alterne para o campo B clicando na seta para baixo no bot&atilde;o central e digite outro n&uacute;mero no campo B.
<p class="align-center"><img src="../../../images_www/articles/71/mobility/webtomobile/ab.png"
                     alt="A e B definidos" border=1></p></li>
<li>Clique no bot&atilde;o sob Menu, selecione Ok no menu pop-up e clique no bot&atilde;o central no Emulador para confirmar.<br>
 
  
Depois que WebApplication calcular a soma dos n&uacute;meros digitados, <tt>form1</tt> ser&aacute; exibido com o resultado.
<p class="align-center"><img src="../../../images_www/articles/71/mobility/webtomobile/abresult.png"
                     alt="Resultado calculado" border=1></p>
<p class="notes"><b>Observa&ccedil;&atilde;o:</b> Para ver o resultado final do tutorial, baixe <A HREF="https://netbeans.org/project_downloads/samples/Samples/Mobile/MobileClientToWebApplicationSample.zip">MobileCientToWebApplicationSample.zip</A>.</p>	</li>				 
</ol>
 <p class="align-center"><a href="#top">in&iacute;cio</a></p>
<div class="feedback-box"><a href="/about/contact_form.html?to=6&subject=Creating%20a%20Client-Server%20Application">Envie-nos seus coment&aacute;rios</a><br style="clear:both;" ></div>
<br style="clear:both;" >  

 <a name="see-also"></a>
<H2>Consulte tamb&eacute;m</H2>
<UL>
 <li><a href="smscomposer.html">Componentes padr&atilde;o do Visual Mobile Designer: criando um aplicativo SMS Composer</a></li>
 <li><a href="filebrowser.html">Componentes padr&atilde;o do Visual Mobile Designer: criando um navegador de arquivo de dispositivo m&oacute;vel</a></li>
 <li><a href="pimbrowser.html">Componentes padr&atilde;o do Visual Mobile Designer: criando um aplicativo de gerenciador de informa&ccedil;&otilde;es pessoais</a></li>
 <li><a href="splashscreen.html">Componentes padr&atilde;o do Visual Mobile Designer: usando telas de splash em aplicativos Java ME</a></li>
 <li><a href="waitscreen.html">Componentes personalizados do Visual Mobile Designer: Criando telas de espera para aplicativos m&oacute;veis</a></li>
 <li><a href="tableitem.html">Componentes padr&atilde;o do Visual Mobile Designer: usando itens de tabela em aplicativos Java ME</a></li>
 <li><a href="http://wiki.netbeans.org/VisualMobileDesignerPalatteReference">Reference: Visual Mobile Designer Palette Guide</a></li>
</UL>
 <p class="align-center"><a href="#top">in&iacute;cio</a></p>
</BODY>
</HTML>