<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<META HTTP-EQUIV="content-type" CONTENT="text/html; charset=UTF-8">
<title>Notas da vers&atilde;o do NetBeans C/C++ Development Pack 5.5.1 atualiza&ccedil;&atilde;o 1</title>
<meta name="DESCRIPTION" content="Notas da vers&atilde;o do NetBeans C/C++ Development Pack 5.5">
 </head>
 <body>
 <!-- Begin Content Area --> <a name="top"></a>
<h1>Notas da vers&atilde;o do NetBeans™ C/C++ Development Pack 5.5.1 atualiza&ccedil;&atilde;o 1</h1>
<p>Bem-vindo ao NetBeans C/C++ Development Pack.</p>

<p>O NetBeans™ C/C++ Development Pack 5.5.1 atualiza&ccedil;&atilde;o 1 permite desenvolver aplicativos em C/C++ com NetBeans IDE em sistemas operacionais Microsoft Windows, Linux e Solaris.
</p>
<p>
O NetBeans C/C++ Development Pack 5.5.1 atualiza&ccedil;&atilde;o 1 &eacute; compat&iacute;vel com NetBeans IDE 5.5.1 e NetBeans IDE 5.5.
</p>
<p><b>Conte&uacute;do</b></p>
<ul>

<li><a href="#system_requirements">Requisitos do sistema</a></li>
<li><a href="#configuration">Informa&ccedil;&otilde;es de configura&ccedil;&atilde;o</a></li>
<li><a href="#known_issues">Problemas conhecidos</a></li>
<li><a href="#documentation">Documenta&ccedil;&atilde;o</a></li>
</ul>
<blockquote>
<p><b>Observa&ccedil;&atilde;o: </b>Se deseja obter informa&ccedil;&otilde;es sobre a instala&ccedil;&atilde;o do software, consulte <a href="cnd-install_pt_BR.html">Instala&ccedil;&atilde;o e instru&ccedil;&otilde;es de configura&ccedil;&atilde;o do NetBeans C/C++ Development Pack 5.5.1 atualiza&ccedil;&atilde;o 1</a>.</p>

</blockquote>
<h2><a name="system_requirements">Requisitos do sistema</a></h2>
<blockquote>
<!--<a name="req_os"></a>-->
<h5 style="border-bottom: 0pt none;">Sistemas operacionais suportados</h5>
<p>O NetBeans C/C++ Development Pack 5.5.1 atualiza&ccedil;&atilde;o 1 &eacute; executado em sistemas operacionais que oferecem suporte &agrave; m&aacute;quina virtual Java. O NetBeans C/C++ Development Pack 5.5.1 atualiza&ccedil;&atilde;o 1 foi testado nos seguintes sistemas operacionais:
<ul>
<li>Microsoft Windows XP Professional SP2</li>
<li>Red Hat Fedora Core 3</li>
<li>Solaris™ 10 Operating System (Solaris OS) (SPARC&reg; e x86/x64 Platform Edition)</li>
<li>Mac OS X vers&atilde;o 10.4 e superior</li>
</ul>
</p>
<p>O NetBeans C/C++ Development Pack tamb&eacute;m pode ser executado nas seguintes plataformas:
<ul>
<li>Microsoft Windows 2000 Professional SP4</li>

<li>Solaris™ 8 OS (SPARC&reg; e x86/x64 Platform Edition) e Solaris™ 9 OS (SPARC&reg; e x86/x64 Platform Edition)</li>
<li>V&aacute;rias distribui&ccedil;&otilde;es do Linux</li>
</ul>
 </p>

<a name="min_hw"></a>
<h5 style="border-bottom: 0pt none;">Configura&ccedil;&atilde;o m&iacute;nima de hardware</h5>
<br>

<div class="greybox">
<p><b>Observa&ccedil;&atilde;o:</b> A resolu&ccedil;&atilde;o m&iacute;nima da tela do IDE do NetBeans &eacute; de 1024x768 pixels.</p>
</div>
<br>
<ul>
<li><b>Sistemas operacionais Microsoft Windows</b>:
<ul>
<li><b>Processador: </b>Esta&ccedil;&atilde;o de trabalho Intel Pentium III de 500 MHz ou equivalente</li>
<li><b>Mem&oacute;ria: </b>512 MB</li>

<li><b>Espa&ccedil;o em disco: </b>850 MB de espa&ccedil;o dispon&iacute;vel em disco</li>
</ul>
<br>
</li>
<li><b>Sistema operacional Linux</b>:
<ul>
<li><b>Processador: </b>Esta&ccedil;&atilde;o de trabalho Intel Pentium III de 500 MHz ou equivalente</li>
<li><b>Mem&oacute;ria: </b>512 MB</li>
<li><b>Espa&ccedil;o em disco: </b>450 MB de espa&ccedil;o dispon&iacute;vel em disco</li>

</ul>
<br>
</li>
<li><b>Solaris OS (SPARC)</b>:
<ul>
<li><b>Processador: </b> UltraSPARC II 450 MHz</li>
<li><b>Mem&oacute;ria: </b>512 MB</li>
<li><b>Espa&ccedil;o em disco: </b>450 MB de espa&ccedil;o dispon&iacute;vel em disco</li>
</ul>

<br>
</li>
<li><b>Solaris OS (x86/x64 Platform Edition)</b>:
<ul>
<li><b>Processador: </b>AMD Opteron 100 Series 1,8 GHz</li>
<li><b>Mem&oacute;ria: </b>512 MB</li>
<li><b>Espa&ccedil;o em disco: </b>450 MB de espa&ccedil;o dispon&iacute;vel em disco</li>
</ul>

<br>
</li>
<li><b>Sistema operacional Macintosh OS X</b>:
<ul>
<li><b>Processador: </b>PowerPC G4</li>
<li><b>Mem&oacute;ria: </b>512 MB</li>
<li><b>Espa&ccedil;o em disco: </b>450 MB de espa&ccedil;o dispon&iacute;vel em disco</li>
</ul>
<br>
</li>
</ul>
<a name="req_hw"></a>
<h5 style="border-bottom: 0pt none;">Configura&ccedil;&atilde;o de hardware recomendada</h5>

<ul>
<li><b>Sistemas operacionais Microsoft Windows</b>:
<ul>
<li><b>Processador: </b>Esta&ccedil;&atilde;o de trabalho Intel Pentium III de 1,4 GHz ou equivalente</li>
<li><b>Mem&oacute;ria: </b>1 GB</li>
<li><b>Espa&ccedil;o em disco: </b>1 GB de espa&ccedil;o dispon&iacute;vel em disco</li>
</ul>
<br>
</li>
<li><b>Sistema operacional Linux</b>:

<ul>
<li><b>Processador: </b>1,4 GHz Intel Pentium III ou equivalente</li>
<li><b>Mem&oacute;ria: </b>1 GB</li>
<li><b>Espa&ccedil;o em disco: </b>850 MB de espa&ccedil;o dispon&iacute;vel em disco</li>
</ul>
<br>
</li>
<li><b>Solaris™ OS (SPARC&reg;)</b>:

<ul>
<li><b>Processador: </b>UltraSPARC IIIi 1 GHz</li>
<li><b>Mem&oacute;ria: </b>1 GB</li>
<li><b>Espa&ccedil;o em disco: </b>850 MB de espa&ccedil;o dispon&iacute;vel em disco</li>
</ul>
<br>
</li>
<li><b>Solaris™ OS (x86/x64 platform edition)</b>:

<ul>
<li><b>Processador: </b>AMD Opteron 100 Series 1,8 GHz</li>
<li><b>Mem&oacute;ria: </b>1 GB</li>
<li><b>Espa&ccedil;o em disco: </b>850 MB de espa&ccedil;o dispon&iacute;vel em disco</li>
</ul>
<br>
</li>
</ul>
</li>
</ul>
<a name="req_sw"></a>
<h5 style="border-bottom: 0pt none;">Software necess&aacute;rio</h5>
<p>Antes da instala&ccedil;&atilde;o do NetBeans C/C++ Development Pack 5.5.1 atualiza&ccedil;&atilde;o 1, o NetBeans IDE 5.5.1 ou o NetBeans IDE 5.5 deve estar instalado:
</p>
<p>O NetBeans C/C++ Development Pack 5.5.1 atualiza&ccedil;&atilde;o 1 pode ser executado na plataforma Java 2 Standard Edition Development Kit 5.0 atualiza&ccedil;&atilde;o 1 ou superior (JDK 1.5.0_09 ou superior) ou JDK 6.0, que compreende o Java Runtime Environment (JRE) mais as ferramentas de desenvolvedores para compila&ccedil;&atilde;o, depura&ccedil;&atilde;o e execu&ccedil;&atilde;o de aplicativos escritos na linguagem Java. </p>
<p>
&Eacute; poss&iacute;vel fazer o download do JDK para sua plataforma em <a href="http://java.sun.com/j2se/1.5.0/">http://java.sun.com/j2se/1.5.0/</a>.
</p>
</blockquote>
<br>
<p align="center"><a href="#top">superior</a></p>
<h2><a name="configuration">Informa&ccedil;&otilde;es de configura&ccedil;&atilde;o</a></h2>
<p>O NetBeans IDE apresenta um tamanho de pilha padr&atilde;o de 128 MB. O NetBeans C/C++ Development Pack &eacute; executado corretamente com esta configura&ccedil;&atilde;o padr&atilde;o no desenvolvimento de projetos pequenos com at&eacute; 500 arquivos de c&oacute;digo e cabe&ccedil;alho.
</p>
<p>Ao desenvolver projetos grandes, ser&aacute; necess&aacute;rio aumentar o tamanho de pilha. Se for exibida uma exce&ccedil;&atilde;o OutOfMemory durante o desenvolvimento de um projeto grande, a causa de tal exce&ccedil;&atilde;o ser&aacute; provavelmente o tamanho de pilha.
</p>
<p>
Voc&ecirc; pode definir o tamanho de pilha na Java Virtual Machine (JVM)* na qual o NetBeans IDE &eacute; executado no arquivo <tt>netbeans.conf</tt>.
<p><b>Para alterar o tamanho de pilha:</b></p>
<ol>
<li>Copie o <tt>netbeans.conf</tt> da pasta <tt>etc</tt> do diret&oacute;rio de instala&ccedil;&atilde;o do NetBeans para o diret&oacute;rio de usu&aacute;rio do NetBeans (<tt>$HOME/.netbeans/5.5.1</tt>). </li>
<li>No arquivo <tt>netbeans.conf</tt> do diret&oacute;rio de usu&aacute;rio, edite as op&ccedil;&otilde;es de inicializa&ccedil;&atilde;o de Java da linha de comando <tt>-J-Xmx</tt> (em negrito abaixo) no arquivo <tt>netbeans.conf</tt> e reinicie o IDE.
<pre>
# command line switches
netbeans_default_options=&quot;-J-Xms32m <b>-J-Xmx128m</b> -J-XX:PermSize=32m
-J-XX:MaxPermSize=96m -J-Xverify:none -J-Dapple.laf.useScreenMenuBar=true&quot;
</pre></li>
</ol><p>
Os tamanhos de pilha recomendados para aplicativos m&eacute;dios e grandes do NetBeans C/C++ Development Pack s&atilde;o:
<ul>
<li>Para desenvolver aplicativos m&eacute;dios (de 500 a 2000 arquivos de c&oacute;digo e cabe&ccedil;alho) em um sistema com 1 GB ou mais de RAM: 512 MB</li>
<li>Para desenvolver aplicativos grandes (mais de 2000 arquivos de c&oacute;digo e cabe&ccedil;alho) em um sistema com 2 GB ou mais de RAM: 1 GB</li>
</ul>
<p>N&atilde;o aumente o tamanho de pilha em mais de 1 GB.
</p>
<p>Se estiver executando a Sun JVM, voc&ecirc; tamb&eacute;m pode adicionar as op&ccedil;&otilde;es de coletor de lixo <tt>-J-XX:+UseConcMarkSweepGC</tt> (coletor atual) e <tt>-J-XX:+UseParNewGC</tt> (coletor paralelo) ao arquivo <tt>netbeans.conf</tt>. Estas op&ccedil;&otilde;es permitem que o coletor de lixo seja executado junto com o mecanismo de execu&ccedil;&atilde;o principal. Outras implementa&ccedil;&otilde;es diferentes da Sun JVM podem n&atilde;o oferecer suporte a tais op&ccedil;&otilde;es.
</p>
<p>Para obter mais informa&ccedil;&otilde;es sobre as configura&ccedil;&otilde;es de op&ccedil;&otilde;es do NetBeans, consulte <a
href="https://netbeans.org/kb/archive/index.html">Configurando a se&ccedil;&atilde;o IDE de <i>Usando o NetBeans IDE 5.5</i></a>
</p>
<p>Para obter mais informa&ccedil;&otilde;es sobre o ajuste de desempenho do NetBeans, consulte <a
href="http://performance.netbeans.org/howto/jvmswitches/index.html"><i>Ajustando as op&ccedil;&otilde;es da para melhorar o desempenho</i></a>.
</p>
<p><b>* Observa&ccedil;&atilde;o:</b> Os termos &quot;Java Virtual Machine&quot; e &quot;JVM&quot; referem-se a uma m&aacute;quina virtual da plataforma Java(TM).
</p>
</blockquote>
<br>
<p align="center"><a href="#top">superior</a></p>
<br> <a name="known_issues"></a>
<h2>Problemas conhecidos</h2>
<p>Esta vers&atilde;o do NetBeans C/C++ Development Pack 5.5.1 atualiza&ccedil;&atilde;o 1 permite explorar e avaliar a nova funcionalidade no IDE. Pedimos que voc&ecirc; participe e nos d&ecirc; a sua opini&atilde;o, registrando qualquer problema que tenha encontrado no sistema de rastreamento de problemas em <a href="https://netbeans.org/community/issues.html">https://netbeans.org/community/issues.html</a>.</p>
<p>Os problemas n&atilde;o solucionados desta vers&atilde;o s&atilde;o os seguintes: </p>
    <li><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=89880">Erro #89880: O projeto n&atilde;o &eacute; reprocessado quando o conjunto de compiladores &eacute; alternado</a>
	<blockquote>
	    <p><b>Descri&ccedil;&atilde;o:</b> Se alternar os conjuntos de compiladores de um projeto, o projeto n&atilde;o &eacute; reprocessado. Ap&oacute;s a altera&ccedil;&atilde;o, o auto-completar de c&oacute;digo e os hyperlinks podem n&atilde;o funcionar corretamente no projeto.
	    </p>
	    <p><b>Solu&ccedil;&atilde;o:</b>

		Feche o projeto e abra-o novamente.
	    </p>
	</blockquote>
    </li>
    <li><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=76173">Erro #76173: N&atilde;o h&aacute; esvaziamento autom&aacute;tico da sa&iacute;da antes da entrada</a>
	<blockquote>
	    <p><b>Descri&ccedil;&atilde;o:</b> Se a propriedade padr&atilde;o Tipo de console do projeto for alterada de Terminal externo para Janela de sa&iacute;da (somente sa&iacute;da), nenhuma entrada poder&aacute; ser digitada na janela Sa&iacute;da.
	    </p>
	    <p><b>Solu&ccedil;&atilde;o:</b> Na categoria Execu&ccedil;&atilde;o das propriedades do projeto, altere a propriedade padr&atilde;o Tipo de console apenas dos aplicativos somente de sa&iacute;da.
	    </p>
	</blockquote>
    </li>
    <li><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=89343">Erro #89343: A pausa n&atilde;o funciona no Windows quando o programa espera a entrada do usu&aacute;rio</a>

	<blockquote>
	    <p><b>Descri&ccedil;&atilde;o:</b> Clicar em Pausa enquanto o programa est&aacute; esperando a entrada n&atilde;o para o programa. A pausa funciona somente depois ter fornecido a entrada.
	    </p>
	    <p><b>Solu&ccedil;&atilde;o:</b> N&atilde;o h&aacute; solu&ccedil;&atilde;o.
	    </p>
	</blockquote>
    </li>
    <li><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=90120">Erro #90120: &quot;pausa&quot; (no Windows) n&atilde;o funciona em casos extremos</a>
	<blockquote>
	    <p><b>Descri&ccedil;&atilde;o:</b> Al&eacute;m do <a href="https://netbeans.org/bugzilla/show_bug.cgi?id=89343">89343</a>, h&aacute; v&aacute;rios outros casos nos quais Pausa n&atilde;o funciona no Windows. Um destes casos &eacute; em loops muito fechados.
	    </p>

	    <p><b>Solu&ccedil;&atilde;o:</b> N&atilde;o h&aacute; solu&ccedil;&atilde;o.
	    </p>
	</blockquote>
    </li>

    <li><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=90222">Erro #90222: Os pontos de interrup&ccedil;&atilde;o n&atilde;o funcionam imediatamente durante a execu&ccedil;&atilde;o</a>
	<blockquote>

	    <p><b>Descri&ccedil;&atilde;o:</b> Se um ponto de interrup&ccedil;&atilde;o for definido durante o processo de execu&ccedil;&atilde;o, tal ponto n&atilde;o &eacute; passado para o <tt>gdb</tt> at&eacute; a pr&oacute;xima interrup&ccedil;&atilde;o do processo.
	    </p>
	    <p><b>Solu&ccedil;&atilde;o:</b> Pause o processo, defina o ponto de interrup&ccedil;&atilde;o e prossiga.
	    </p>
	</blockquote>
    </li>

    </ul>
    </blockquote>
<h2><a name="documentation"></a>Documenta&ccedil;&atilde;o</h2>
<p>
    A documenta&ccedil;&atilde;o da vers&atilde;o do NetBeans C/C++ Development Pack 5.5.1 atualiza&ccedil;&atilde;o 1 encontra-se na Web em forma de guias e no sistema de ajuda do IDE. Voc&ecirc; pode usar os documentos seguintes como introdu&ccedil;&atilde;o:
     <ul>
        <li><a href="cnd-install_pt_BR.html">Instru&ccedil;&otilde;es de instala&ccedil;&atilde;o e configura&ccedil;&atilde;o do NetBeans C/C++ Development Pack 5.5.1 atualiza&ccedil;&atilde;o 1</a></li>
        <li><a href="https://netbeans.org/kb/archive/index.html">Guia de in&iacute;cio r&aacute;pido do NetBeans C/C++ Development Pack 5.5.1 atualiza&ccedil;&atilde;o 1</a></li>
        <li><a href="https://netbeans.org/kb/archive/index.html">Documenta&ccedil;&atilde;o do NetBeans 5.5.1</a></li>
        </ul>



</body>
</html>





