<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
    <head>
        <title>Notas da vers&atilde;o do NetBeans Mobility Pack para CDC 5.5.1</title>
        <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
        <meta name="description" content="Notas da vers&atilde;o do NetBeans Mobility Pack 5.5.1 para CDC:
        Introdu&ccedil;&atilde;o, compatibilidade, problemas conhecidos, documenta&ccedil;&atilde;o">
       <link rel="stylesheet" type="text/css" href="../../../../netbeans.css">
        <style type="text/css">
<!--
.style1 {
	font-family: "Courier New", Courier, mono;
	font-style: italic;
}
-->
        </style>
    </head>
    <body>

        <a name="top"></a>

<h1>Notas da vers&atilde;o do NetBeans Mobility Pack para CDC 5.5.1</h1>


<blockquote>
  <p>Bem-vindo ao NetBeans Mobility Pack para CDC, um pacote suplementar que oferece ferramentas para criar aplicativos do Java Micro Edition (Java ME) que d&atilde;o suporte &agrave;s tecnologias Java ME, Connected Device Configuration (CDC).</p>
	</blockquote>
  <h2 style="color:#0E1B55">Conte&uacute;do</h2>
  <ul>
    <li><a href="#system_requirements">Requisitos do sistema</a>
    <li><a href="#compatibility">Compatibilidade</a></li>
    <li><a href="#known_issues">Problemas conhecidos </a></li>
    <li><a href="#documentation">Documenta&ccedil;&atilde;o</a></li>
    <li><a href="#more_info">Mais informa&ccedil;&otilde;es</a></li>
  </ul>

  <p>&nbsp;</p>
  <p><b>Observa&ccedil;&atilde;o: </b>Se desejar obter informa&ccedil;&otilde;es sobre a instala&ccedil;&atilde;o do NetBeans Mobility Pack para CDC 5.5.1, consulte <a href="mobilitycdc-install_pt_BR.html">Guia de instala&ccedil;&atilde;o do NetBeans Mobility Pack para CDC 5.5</a>. </p>
  <p align="center"><a href="#top">in&iacute;cio</a></p>

<h2><a name="system_requirements"></a>Requisitos do sistema</h2>
            <!--<a name="req_os"></a>-->
            <h5 style="border-bottom:0">Sistemas operacionais suportados</h5>

  <p>O NetBeans Mobility Pack para CDC 5.5.1 &eacute; executado no Java SE JDK, vers&otilde;es 5.0 e 6.0, composto pelo Java Runtime Environment e por ferramentas de desenvolvimento para compilar, depurar e executar aplicativos escritos na linguagem Java.
  <p>O NetBeans Mobility Pack para CDC &eacute; executado em sistemas do Microsoft Windows que oferecem suporte &agrave; m&aacute;quina virtual Java. Veja uma lista das plataformas nas quais o NetBeans IDE j&aacute; foi testado.
  <ul>
    <li>Microsoft Windows XP Professional SP2</li>
  </ul>
  <ul>
    <li>Windows Vista</li>
    <li>Ubuntu 6.x</li>
  </ul>

            <a name="min_hw"></a>

  <h5 style="border-bottom:0">Configura&ccedil;&atilde;o m&iacute;nima de hardware</h5>
  <p style="border-bottom:0">O Mobility Pack para CDC n&atilde;o requer recursos significativos al&eacute;m dos necess&aacute;rios para o NetBeans IDE. </p>

            <div class="greybox">
                <p><b>Observa&ccedil;&atilde;o:</b> A resolu&ccedil;&atilde;o de tela m&iacute;nima para o IDE &eacute; de 1.024x768 pixels.</p>
            <ul>
      <li><b>Processador: </b>Esta&ccedil;&atilde;o de trabalho Intel Pentium III de 500 MHz ou equivalente</li>
      <li><b>Mem&oacute;ria: </b>512 MB</li>
      <li><b>Espa&ccedil;o em disco: </b>850 MB de espa&ccedil;o dispon&iacute;vel em disco</li>
    </ul>
  </div>


  <a name="req_hw"></a>
                <h5 style="border-bottom: 0pt none;">Configura&ccedil;&otilde;es de hardware recomendadas</h5>


<ul>
        <li><b>Processador: </b>Esta&ccedil;&atilde;o de trabalho Intel Pentium III de 1,4 GHz ou equivalente</li>
        <li><b>Mem&oacute;ria: </b>1 GB</li>
        <li><b>Espa&ccedil;o em disco: </b>1 GB de espa&ccedil;o dispon&iacute;vel em disco</li>
  </ul>
    </li>
  </ul>


            <a name="req_sw"></a>
            <h5 style="border-bottom:0">Software necess&aacute;rio</h5>

  <p>O NetBeans IDE &eacute; executado no J2SE JDK (Java SE Development Kit), vers&otilde;es 5.0 e 6.0, composto pelo Java Runtime Environment e por ferramentas de desenvolvimento para compilar, depurar e executar aplicativos escritos na linguagem Java. </p>
  <p>&Eacute; poss&iacute;vel fazer o download do JDK para sua plataforma em <a href="http://java.sun.com/javase/downloads/index.jsp">http://java.sun.com/javase/downloads/index.jsp</a>.</p>
  <p><strong>Plataformas de emulador</strong></p>
  <p>O Sun Java Toolkit para CDC est&aacute; integrado ao NetBeans Mobility Pack. No entanto, se desejar programar aplicativos para outras plataformas suportadas, &eacute; necess&aacute;rio fazer o download de um ou mais dos seguintes SDKs e instal&aacute;-los:</p>
  <ul>
    <li>Ricoh
      <ul>
        <li>Embedded Software Architecture Emulator (registro necess&aacute;rio para o <a href="http://www.ricoh.com/esa/index.html">download</a>)</li>
      </ul>
    </li>
    <li>Sony Ericsson
      <ul>
        <li>UIQ 3 SDK (logon necess&aacute;rio para o <a href="http://developer.uiq.com/">download</a>)</li>
        <li>M600 Extension Package para o UIQ 3 SDK Beta 3 (<a href="http://developer.sonymobile.com/downloads/sdks/">download</a>)</li>
        <li>P990 Extension Package para o UIQ 3 SDK Beta 3 (<a href="http://developer.sonymobile.com/downloads/sdks/">download</a>)</li>
      </ul>
    </li>
    <li>Nokia
      <ul>
        <li>Nokia Series 80 Platform SDK para Symbian OS, para Java, perfil Pessoal (<a href="http://www.forum.nokia.com/info/sw.nokia.com/id/449a2f84-2a8a-44fa-a7f4-93b53cb9c89a/Series_80_Platform_SDK_s_for_Symbian_OS_for_Java.html">download</a>)</li>
      </ul>
    </li>
    <li>Windows Mobile com NSIcom CrEme VM
      <ul>
        <li> CrEme 4.10 Developer Support (<a href="http://nsicom.com/shared/CrEmeDevSup410.exe">download</a>)</li>
        <li>Microsoft Device Emulator 1.0 (<a href="http://www.microsoft.com/en-us/download/details.aspx?id=20259">download</a>)
        </li>
        <li>Virtual Machine Network Driver para Microsoft Device Emulator (<a href="http://www.microsoft.com/en-us/download/details.aspx?id=2863">download</a>)</li>
        <li>ActiveSync (<a href="http://www.microsoft.com/en-us/download/details.aspx?id=15">download</a>)</li>
      </ul>
    </li>
    <li> SavaJe
      <ul>
        <li> A plataforma SavaJe Mobile (n&atilde;o mais dispon&iacute;vel)</li>
      </ul>
    </li>
  </ul>
  <p>&nbsp;</p>
  <p>O CDC Pack 5.5.1 d&aacute; suporte &agrave; implanta&ccedil;&atilde;o em dispositivos do Windows Mobile (com o NSIcom VM) e do SavaJe.</p>
  <p>Instru&ccedil;&otilde;es de instala&ccedil;&atilde;o para cada emulador est&atilde;o dispon&iacute;veis no <a href="mobilitycdc-install_pt_BR.html">Guia de instala&ccedil;&atilde;o do NetBeans Mobility Pack para CDC 5.5.1. </a></p>

        <p align="center"><a href="#top">in&iacute;cio</a></p>
<h2><a name="compatibility"></a>Compatibilidade</h2>

<p>Ao executar o IDE pela primeira vez com o NetBeans Mobility Pack, &eacute; poss&iacute;vel importar um subconjunto das configura&ccedil;&otilde;es usadas no NetBeans Mobility Pack para CDC 5.5. Se escolher n&atilde;o importar as configura&ccedil;&otilde;es da vers&atilde;o anterior, o IDE ir&aacute; se abrir usando as configura&ccedil;&otilde;es padr&atilde;o. </p>
        <blockquote>
          <p><b>Observa&ccedil;&atilde;o:</b><i> O IDE s&oacute; reconhece instala&ccedil;&otilde;es anteriores se o diret&oacute;rio de usu&aacute;rio estiver no local padr&atilde;o. O IDE n&atilde;o reconhece instala&ccedil;&otilde;es em que o diret&oacute;rio de usu&aacute;rio foi especificado em <code>--userdir</code>. Se quiser importar configura&ccedil;&otilde;es de um IDE n&atilde;o reconhecido pelo instalador, fa&ccedil;a o download de uma vers&atilde;o arquivada do IDE em vez de substituir o instalador.</i></p>
    </blockquote>

  <p>Embora seja poss&iacute;vel importar configura&ccedil;&otilde;es do NetBeans Mobility Pack para CDC 5.0 para o NetBeans 5.5.1, n&atilde;o &eacute; poss&iacute;vel importar as configura&ccedil;&otilde;es do NetBeans Mobility Pack para CDC 5.0.1 para uma vers&atilde;o anterior do IDE. </p>
        <p align="center"><a href="#top">in&iacute;cio</a></p>
        <a name="known_issues"></a>
        <h2>Problemas conhecidos</h2>
        <div class="indent">

  <p>Os problemas n&atilde;o solucionados desta vers&atilde;o s&atilde;o os seguintes: </p>

<blockquote>
  <ul>
    <!--
                    <li><a href="ADD ISSUE LINK HERE">Issue #ADD ISSUE NUMBER HERE:
                    ADD ISSUE TITLE HERE.</a>
                    <blockquote>
                        <p><b>Description:</b> ADD DESCRIPTION HERE.</p>
                        <p><b>Workaround:</b> ADD WORKAROUND HERE.</p>
                    </blockquote></li>-->
    <li> Problema <a href="https://netbeans.org/bugzilla/show_bug.cgi?id=77083">#77083:</a> icon.small/icon.focused tem caminho absoluto ap&oacute;s a implanta&ccedil;&atilde;o
      <blockquote>
        <p><b>Descri&ccedil;&atilde;o: </b>O <code>bundle.jnlp</code> cont&eacute;m um caminho absoluto para icon.small e icon.focused. Isto se d&aacute; porque os &iacute;cones est&atilde;o localizados no dispositivo. No campo de texto, voc&ecirc; deve inserir o caminho do &iacute;cone como ele est&aacute; definido no dispositivo. O local (caminho) correto deve estar listado na documenta&ccedil;&atilde;o do dispositivo. </p>
      </blockquote>
    </li>
    <li>Problema <a href="https://netbeans.org/bugzilla/show_bug.cgi?id=86566">#86566:</a> Erro ao salvar as configura&ccedil;&otilde;es da paleta.
      <blockquote>
        <p><b>Descri&ccedil;&atilde;o: </b>As configura&ccedil;&otilde;es da paleta do GUI Designer n&atilde;o ser&atilde;o salvas, se voc&ecirc; alterar a plataforma do emulador do projeto.</p>
      </blockquote>
    </li>
    <li>Problema <a href="https://netbeans.org/bugzilla/show_bug.cgi?id=88709">#88709:</a> A compila&ccedil;&atilde;o falha ao alternar entre plataformas de emulador.
      <blockquote>
        <p><b>Descri&ccedil;&atilde;o: </b>Se voc&ecirc; alterar a plataforma de Nokia para Sony Ericsson, a compila&ccedil;&atilde;o ir&aacute; falhar. </p>
        <p><b>Solu&ccedil;&atilde;o: </b>Altere o UID clicando com o bot&atilde;o direito do mouse no projeto e escolhendo Propriedades do projeto &gt; Geral &gt; Sony Ericsson. </p>
      </blockquote>
    <li><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=77083">Problema #77083:</a> O link do caminho absoluto para &iacute;cones em um arquivo bundle.jnlp
      <blockquote>
        <p><b>Descri&ccedil;&atilde;o:</b> icon.small e icon.focused t&ecirc;m caminho absoluto ap&oacute;s a implanta&ccedil;&atilde;o.</p>
        <p><b>Solu&ccedil;&atilde;o:</b> O caminho pode ser especificado para dispositivos de acordo com a documenta&ccedil;&atilde;o do dispositivo.</p>
      </blockquote>


    <li><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=88913">Problema #88913:</a> N&atilde;o &eacute; poss&iacute;vel encontrar o erro nbproject/build-impl.xml
      <blockquote>
        <p><b>Descri&ccedil;&atilde;o:</b> A vers&atilde;o internacionalizada do IDE ir&aacute; receber uma mensagem de erro se voc&ecirc; construir, executar e renomear um projeto. </p>
      </blockquote>
    </li>
    <li><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=90047">Problema #90047:</a> Problemas ao depurar projetos do CDC
      <blockquote>
        <p><b>Descri&ccedil;&atilde;o:</b> java.lang.NoClassDefFoundError &eacute; lan&ccedil;ado ao se tentar depurar um projeto do CDC</p>
        <p><b>Solu&ccedil;&atilde;o:</b> A depura&ccedil;&atilde;o n&atilde;o ir&aacute; funcionar se voc&ecirc; carregar um projeto do CDC Toolkit no Mobility Pack para CDC. &Eacute; necess&aacute;rio atualizar o projeto para Mobility Pack para CDC indo a Propriedades do projeto, clicando em OK e seguindo as etapas fornecidas pelo IDE. </p>
      </blockquote>
    </li>
    <li><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=90647">Problema #90647:</a> N&atilde;o &eacute; poss&iacute;vel alterar o dispositivo da plataforma Sony Ericsson UIQ dentro do IDE
      <blockquote>
        <p><b>Descri&ccedil;&atilde;o:</b> O dispositivo de destino da plataforma n&atilde;o pode ser alterado no IDE </p>
        <p><b>Solu&ccedil;&atilde;o:</b> Execute o utilit&aacute;rio SDKConfig.exe, localizado em <span class="style1">&lt;install_dir&gt;</span>\UIQ3SDK\epoc32\tools\distrib\, onde <span class="style1">&lt;install_dir&gt;</span> &eacute; o diret&oacute;rio em que o emulador Sony Ericsson UIQ3 foi instalado no computador. </p>
      </blockquote>
    </li>
    <li><a href="https://netbeans.org/bugzilla/show_bug.cgi?id=90654">Problema #90654:</a> Projetos constru&iacute;dos com o Mobility Pack para CDC 5.5.1, atualiza&ccedil;&atilde;o 1, falham ap&oacute;s a atualiza&ccedil;&atilde;o para a vers&atilde;o FCS
      <blockquote>
        <p><b>Descri&ccedil;&atilde;o:</b> O problema &eacute; causado pelo fato de o m&eacute;todo de execu&ccedil;&atilde;o ser incorreto para a vers&atilde;o FCS do pacote CDC</p>
        <p><b>Solu&ccedil;&atilde;o:</b> Altere as Propriedades do projeto para o m&eacute;todo de execu&ccedil;&atilde;o Xlet ao atualizar projetos que usam AGUI criado com o Mobility Pack para CDC 5.5.1, atualiza&ccedil;&atilde;o1. </p>
      </blockquote>
    </li>
  </ul>
	</div>
       <p align="center"><a href="#top">in&iacute;cio</a></p>
        <a name="documentation"></a>
        <h2>Documenta&ccedil;&atilde;o</h2>

  <p>Al&eacute;m do sistema de ajuda incorporado, o NetBeans Mobility Pack para CDC &eacute; documentado em uma s&eacute;rie de tutoriais e artigos. Para obter informa&ccedil;&otilde;es sobre Java ME, recursos de desenvolvimento do CDC suportados pelo Mobility Pack para CDC, consulte os seguintes documentos: </p>
  <ul>

  <li><a href="https://netbeans.org/kb/archive/index.html">Guia de in&iacute;cio r&aacute;pido do NetBeans Mobility Pack para CDC 5.5.1</a></li>
    <li><a href="https://netbeans.org/kb/trails/mobility_pt_BR.html">Guia de aprendizado do NetBeans Mobility Pack</a></li>

  <li><a href="https://netbeans.org/kb/archive/index.html">Documentos e p&aacute;gina de suporte do NetBeans Mobility Pack para CDC</a></li>
  </ul>
  <blockquote>
  <div class='greybox'></div>
</blockquote>
        <p align="center"><a href="#top">in&iacute;cio</a></p>

        <a name="more_info"></a>
        <h2>Mais informa&ccedil;&otilde;es</h2>
        <blockquote>

  <p>&Eacute; poss&iacute;vel encontrar not&iacute;cias, artigos, m&oacute;dulos adicionais e outras informa&ccedil;&otilde;es &uacute;teis no site do projeto NetBeans na Web. Visto que o NetBeans e o NetBeans Mobility Pack s&atilde;o um projeto de c&oacute;digo aberto, o site tamb&eacute;m oferece acesso ao c&oacute;digo-fonte, a um banco de dados de erros, a informa&ccedil;&otilde;es sobre a cria&ccedil;&atilde;o de m&oacute;dulos do NetBeans e muito mais. </p>

  <p>Para obter mais informa&ccedil;&otilde;es, visite <a href="http://mobility.netbeans.org/">http://mobility.netbeans.org/</a>.
  </p>

  <p>Se quiser se manter atualizado sobre o NetBeans IDE e em contato com a comunidade NetBeans, assine a lista de usu&aacute;rios do projeto NetBeans Mobility Pack em <a href="https://netbeans.org/community/lists/index_pt_BR.html">https://netbeans.org/community/lists/</a>.
</blockquote>
        <p align="center"><a href="#top">in&iacute;cio</a></p>

    </body>
</html>


