<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>

  <meta http-equiv="content-type" content="text/html; charset=UTF-8">



  <title>Processo de Elei&ccedil;&atilde;o para o Conselho de Administra&ccedil;&atilde;o do NetBeans</title>

  <meta name="description" content="A description of the formal process for the nomination and election of members on the NetBeans Board">

  <meta name="NAV_LINK" content="Board Elections">

  <meta name="NAV_PRIORITY" content="4">

  <link rel="stylesheet" type="text/css" href="../../netbeans.css">

</head><body>
<h1>Processo de Elei&ccedil;&atilde;o para o Conselho de Administra&ccedil;&atilde;o do NetBeans</h1>


<p>Este documento descreve o processo formal de nomina&ccedil;&atilde;o e elei&ccedil;&atilde;o dos membros do Conselho de Administra&ccedil;&atilde;o do NetBeans. Para obter mais informa&ccedil;&otilde;es sobre o Conselho de Administra&ccedil;&atilde;o, consulte a descri&ccedil;&atilde;o de <a href="governance.html">Conselho de Administra&ccedil;&atilde;o do netbean.org</a>

</p>
<p>Observe que esse processo &eacute; totalmente determinado pela comunidade. As etapas abaixo descritas s&atilde;o o resultado de debates abertos no passado e a discuss&atilde;o na <a href="../../community/lists/top.html">lista de correiros nbdiscuss</a>. Caso considere que algo aqui deveria ser modificado ou adicionado, d&ecirc; sua opini&atilde;o no nbdisciss.

</p>
<h2>Comit&ecirc; de Elei&ccedil;&atilde;o</h2>

<ul>

<li>Um comit&ecirc; de elei&ccedil;&atilde;o ir&aacute; &quot;conduzir&quot; as elei&ccedil;&otilde;es: definir as datas, postar avisos, coletar nomina&ccedil;&otilde;es, definir e administrar o lado t&eacute;cnico da pr&oacute;pria elei&ccedil;&atilde;o e formalmente anunciar os resultados. O comit&ecirc; de elei&ccedil;&atilde;o no passado consistira de membros do <a href="../../community/teams/evangelism/index.html">Evangelismo</a> do NetBens e de equipes da <a href="../../community/teams/web/index.html">Web</a>.
</li>
</ul>


<h2>Nomina&ccedil;&otilde;es</h2>


<ul>

<li>O per&iacute;odo de nomina&ccedil;&atilde;o dever&aacute; durar 2 semanas;

</li><li>Uma <a href="../../community/articles/nbelections.html">chamada para nomina&ccedil;&atilde;o</a> ser&aacute; enviada para listas de e-mail de alto n&iacute;vel, nbannounce, nbdiscuss, nbdev e nbusers. Esta chamada ser&aacute; enviada duas vezes - uma na abertura do per&iacute;odo de nomina&ccedil;&atilde;o e, uma segunda &quot;chamada final&quot; para a nomina&ccedil;&atilde;o no dia anterior ao fechamento do per&iacute;odo;
</li><li>Qualquer membro da comunidade NetBeans &eacute; eleg&iacute;vel para a nomina&ccedil;&atilde;o;

</li><li>Qualquer membro da comunidade NetBeans pode nominar qualquer membro da comunidade de membros.

</li><li>Como mencionado na <a href="governance.html">p&aacute;gina de reg&ecirc;ncia</a>, o Conselho de Administra&ccedil;&atilde;o consiste em dois membros &quot;do mundo&quot;, nominados pela comunidade e um mebro apontado pela Oracle. Em teoria, um funcion&aacute;rio da Oracle pode ser nominado para uma das posi&ccedil;&otilde;es &quot;do mundo&quot; (embora no passado, sob a Sun Microsystems, tais nominados declinaram sua nomina&ccedil;&atilde;o para evitar a maioria da Sun no Conselho de Administra&ccedil;&atilde;o). &Eacute; de decis&atilde;o da comunidade decidir se desejam isso.
</li><li>As nomina&ccedil;&otilde;es deveriam acontecer na <a href="../../community/lists/top.html">lista de correio nbdiscuss</a> (requerida a assinatura para postar), ou <a href="../contact.html">postadas atrav&eacute;s do formul&aacute;rio de contato</a> (nenhuma assinatura necess&aacute;ria). A lista nbdiscuss &eacute; o canal preferido, j&aacute; que &eacute; mais aberto.

</li><li><a href="../../community/articles/nbelections.html">A p&aacute;gina de nomina&ccedil;&otilde;es e elei&ccedil;&otilde;es</a> ir&aacute; listar com clareza os nominados atuais e sua aceita&ccedil;&atilde;o ou de outra forma a nomina&ccedil;&atilde;o durante o per&iacute;do de nomina&ccedil;&atilde;o. Um breve perfil de cada candidato tamb&eacute;m ser coletado e tornado dispon&iacute;vel nesta p&aacute;gina. Esta p&aacute;gina ser&aacute; atualizada com frequ&ecirc;ncia atrav&eacute;s do per&iacute;odo.

</li>
</ul>


<h2>Vota&ccedil;&atilde;o</h2>


<ul>

<li>O per&iacute;odo de vota&ccedil;&atilde;o dever&aacute; durar 2 semanas;

</li><li>A vota&ccedil;&atilde;o ser&aacute; feita <a href="../../community/articles/nbelections.html">atav&eacute;s de uma urna com base na Web</a>;

</li><li>Qualquer pessoa com um login do netbeans.org &eacute; eleg&iacute;vel para depositar seu voto;

</li><li>Cada pessoa tem permiss&atilde;o para uim voto;

</li><li>A vota&ccedil;&atilde;o e o encorajamento para votar ser&aacute; anunciada para a lista de correio de alto n&iacute;vel, nbannounce, nbdiscuss, nbdev e nbusers. Esse aviso ser&aacute; enviado tr&ecirc;s vezes - um na abertura do per&iacute;odo de vota&ccedil;&atilde;o, um no meio do per&iacute;odo, e uma &quot;chamada final&quot; no dia anterior ao fechamento do per&iacute;odo de vota&ccedil;&atilde;o;

</li><li>A vota&ccedil;&atilde;o ser&aacute; &quot;anunciada&quot; no site da Web. Os links para as responsabilidades do Conselho de Administra&ccedil;&atilde;o deveriam tamb&eacute;m estar claramente vis&iacute;veis;

</li><li>Os dados da vota&ccedil;&atilde;o nunca ser&atilde;o tornados p&uacute;blicos, embora sejam coletados e mantidos sob guarda em caso da necessidade de uma auditoria.

</li>
</ul>


<h2>Resultados</h2>


<ul>

<li>Os resultados ser&atilde;o anunciados na lista de correio de alto n&iacute;vel, nbannounce, nbdiscuss, nbdev e nbusers, no dia seguinte ao fechamento da vota&ccedil;&atilde;o.

</li><li><a href="who-board.html">A p&aacute;gina Conselho de Administra&ccedil;&atilde;o</a> ser&aacute; atualizada para listar os novos membros do Conselho de Administra&ccedil;&atilde;o rec&eacute;m eleitos ap&oacute;s o anuncio dos resultados.

</li>
</ul>


</body></html>