<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>
  <meta http-equiv="content-type" content="text/html; charset=UTF-8">



  
  <title>NetBeans </title>

  
  <meta name="description" content="An overview of roles and governance in the NetBeans Open Source Project">

  
  <meta name="NAV_LINK" content="Roles &amp; Governance">

  
  <meta name="NAV_PRIORITY" content="1">

  
  <link rel="stylesheet" type="text/css" href="../../netbeans.css">

</head><body>
<h1>NetBeans <br>
</h1>

O projeto NetBeans tem uma estrutura de reg&ecirc;ncia plana e leve. As decis&otilde;es s&atilde;o tomadas em discuss&otilde;es p&uacute;blicas em listas de correiro p&uacute;blicas. N&atilde;o h&aacute; fun&ccedil;&otilde;es formais - a palavra de um indiv&iacute;duo tem peso de acordo com sua contribui&ccedil;&atilde;o ao projeto. As decis&otilde;es s&atilde;o tomadas por consenso, ao inv&eacute;s de votar - a maioria das decis&otilde;es s&atilde;o de interese somente para os membros da comunidade que ser&atilde;o afetados pelas mesmas. A combina&ccedil;&atilde;o de listas de correio p&uacute;blicas e o consenso, assegura que qualquer pessoa que poderia ser afetada por uma decis&atilde;o, venha a conehcer a mesma e tenha voz na decis&atilde;o.<br>

<br>

<p> No caso de uma disputa n&atilde;o resolvida, h&aacute; um <a href="who-board.html">Conselho de Administra&ccedil;&atilde;o</a>. O corpo consite em tr&ecirc;s pessoas, que s&atilde;o nomeadas para termos de seis meses. Dois dos membros s&atilde;o indicados pela comunidade, por consenso ou voto nas listas de correio p&uacute;blicas O terceiro &eacute; indicado pela Oracle, que prov&ecirc; os fundos para o site da Web e, pelos desenvolvedors que trabalham em per&iacute;odo integral no NetBeans. O corpo &eacute; uma entidade votante, mas na pr&aacute;tica, uma disputa que n&atilde;o pode ser resolvida e que precisa de interven&ccedil;&atilde;o &eacute; extremamente rara.
</p>

<p>Os procedimentos de indica&ccedil;&atilde;o e vota&ccedil;&atilde;o para as elei&ccedil;&otilde;es para o Conselho de Administra&ccedil;&atilde;o do NetBeans s&atilde;o descritos em detalhe na p&aacute;gina <a href="election-process.html">Processo de Elei&ccedil;&atilde;o do Conselho de Administra&ccedil;&atilde;o</a>.
</p>


<h2>Fun&ccedil;&otilde;es e Responsabilidades</h2>

<br>

H&aacute; bastante formas de participar no projeto e comunidade do NetBeans, e nem todas envolvem a contribui&ccedil;&atilde;o de c&oacute;digo-fonte para o projeto! O uso do IDE ou Plataforma, a participa&ccedil;&atilde;o em listas de correios ou preencher relat&oacute;rios de bug ou solicita&ccedil;&otilde;es de aprimoramento, s&atilde;o um de um incr&iacute;vel valor de participa&ccedil;&atilde;o.<br>

<br>


<p>Caso se fosse dividir as formas de participa&ccedil;&atilde;o do projeto NetBeans em um conjunto de fun&ccedil;&otilde;es, o resultado seria algo como: Usu&aacute;rios - Contribuidores -Desenvolvedores - Mantenedores -- e finalmente, &quot;O Conselho de Administra&ccedil;&atilde;o&quot;.
</p>

<p><b>Usu&aacute;rios</b>
</p>

<ul>

  <li>Usu&aacute;rios s&atilde;o pessoas que utilizam a Plataforma ou IDE. Eles usam o software, reportam bugs, e fazem solicita&ccedil;&otilde;es de recursos e sugest&otilde;es. Essa &eacute; de longe a cateagoria mais importante de pessoas. Sem os usu&aacute;rios, n&atilde;o h&aacute; raz&atilde;o para o projeto.</li>
  <li>
    <p><b><i>Como se tornar um usu&aacute;rior:</i></b> <a href="https://netbeans.org/downloads/index.html">Fa&ccedil;a o download do IDE</a> e use-o para gerar c&oacute;digo ou <a href="https://netbeans.org/features/platform/download.html">fa&ccedil;a o download da Plataforma</a> e use-a para desenvolver um aplicativo. </p>
  </li>

</ul>

<p><b>Contribuidores</b>
</p>

<ul>

  <li>Os contribuidores s&atilde;o indiv&iacute;duos que contribuem com o netbeans.org, mas que n&atilde;o t&ecirc;m <span style="font-style: italic;">acesso de grava&ccedil;&atilde;o</span> na &aacute;rvore de c&oacute;digo-fonte. As contribui&ccedil;&otilde;es podem ser na forma de corre&ccedil;&otilde;es do c&oacute;digo-fonte, novo c&oacute;digo ou relat&oacute;rios de bugs, mas tamb&eacute;m podem incluir conte&uacute;do como Arrtigos, FAQs ou capturas de tela.</li>
  <li>
    
    <p>Um contribuidor que tenha envido corre&ccedil;&otilde;es (c&oacute;digo-fonte) s&oacute;lidas e &uacute;teis, pode ser elevado para o status de desenvolvedor pelo mantenedor. A integra&ccedil;&atilde;o das contribui&ccedil;&otilde;es do contribuidor o &eacute; a crit&eacute;rio do mantenedor do projeto, mas &eacute; um processo interativo e comunicativo. Observe que para o c&oacute;digo ser integrado, um CC completado &eacute; necess&aacute;rio de cada contribuidor. Consulte a<a href="../legal/ca.html">p&aacute;gina Pol&iacute;tica de CC</a> para obter informa&ccedil;&otilde;es.</p></li>
  <li>
    <p><b><i>Como se tornar um contribuidor:</i></b> Contribua em quaisquer das formas descritas na <a href="../../community/contribute/index.html">p&aacute;gina Contribui&ccedil;&atilde;o</a>. Caso tenha interesse em se tornar um desenvolvedor da base de c&oacute;digo-fonte, obtenha os <a href="../../community/sources/index.html">c&oacute;digos-fonte</a> para o IDE, fa&ccedil;a um aprimoramento ou conserte um bug, e envie aquele c&oacute;digo para a <a href="../../community/lists/index.html">lista de correio</a> de desenvolvedores ou anexe-o ao relat&oacute;rio de bugs no IssueZilla.
    </p>
  </li>

</ul>

<p><b>Desenvolvedores</b>
</p>

<ul>

  <li>Os desenvolvedores t&ecirc;m <span style="font-style: italic;">acesso de grava&ccedil;&atilde;o</span> &agrave; &aacute;rvore de c&oacute;digo-fonte - para os m&oacute;dulos individuais em que estejam trabalhando ou, em alguns casos, permiss&otilde;es de grava&ccedil;&atilde;o global em todos os lugares. Um desenvolvedor precisa completar e enviar um formul&aacute;rio de Contarto de Contrbuidor para comprometer c&oacute;digo - consulte a <a href="../legal/ca.html">p&aacute;gina Contrato de Contribuidor</a> para obter informa&ccedil;&otilde;es.
    </li>
  <li>
    <p><b><i>Como participar como um desenvolvedor:</i></b> envie uma corre&ccedil;&atilde;o (ou corre&ccedil;&otilde;es) via -e-mail e solicite ao mantenedor do c&oacute;digo o acesso para comprometer sua corre&ccedil;&atilde;o. Consulte a p&aacute;gina <a href="../../community/contribute/index.html">Contribuindo</a> para obter mais detalhes.
    </p>
    
  </li>

</ul>

<p><b>Mantenedores</b>
</p>

<ul>

  <li>Cada m&oacute;dulo tem um mantenedor, que tem persmiss&otilde;es de entrada (para o m&oacute;dulo ou globalmente) e &quot;gerencia&quot; um grupo de desenvolvedores. Os mantenedores s&atilde;o respons&aacute;veis por mesclar corre&ccedil;&otilde;es dos contribuidores, corre&ccedil;&otilde;es de bugs e novo c&oacute;digo do ramo dos desenvolvedores &agrave; arvore de c&oacute;digo-fonte para o ramo est&aacute;vel e, por assegurar que estas contribui&ccedil;&otilde;es n&atilde;o quebrem o build. O mantenedor tamb&eacute;m &eacute; respons&aacute;vel por verificar que cada pessoas que contribuiu c&oacute;digo tenha enviado um CC. Consulte a<a href="../legal/ca.html">p&aacute;gina Pol&iacute;tica de CC</a> para obter informa&ccedil;&otilde;es.</li>
  <li>
    
    
    <p>Um mantenedor &eacute; respons&aacute;vel pelo espa&ccedil;o da Web para aquele m&oacute;dulo, em <span style="font-style: italic;">http://&lt;module&gt;.netbeans.org/</span>, e por conceder privil&eacute;gios de entrada para os contribuidores. Para projetos do m&oacute;dulo, a pessoa que come&ccedil;ou aquele projeto ou o mant&eacute;m no momento &eacute; o mantenedor.
    </p>
    </li>
  <li>
    <p><b><i>Como se tornar um mantenedor:</i></b>
    </p>

    <ul>
      <li>Inicie um projeto de m&oacute;dulo (&eacute; preciso ter escrito algum c&oacute;digo de trabalho em seu projeto para fazer isso), ou </li>
      <li>Ter a responsabilidade por um m&oacute;dulo que lhe foi entregue pelo mantenedor atual, ou </li>
      <li>Assumir um projeto anadonado. Algumas vezes um indiv&iacute;duo inicia um projeto, mas por alguma raz&atilde;o ou outra n&atilde;o pode continuar a trabalhar no mesmo. Se o projeto for de seu interesse, seja volunt&aacute;rio!</li>
    </ul>
    <p>Consulte a p&aacute;gina <a href="../../community/contribute/index.html">Contribuindo</a> para obter mais detalhes.
    </p>
    
  </li>

</ul>

<p><b>O Conselho de Administra&ccedil;&atilde;o</b>
</p>

<ul>

  <li>Como acima mencionado, o Conselho de Administra&ccedil;&atilde;o consiste em tr&ecirc;s membros, composto de um representante indicado pela Oracle e dois representantes indicados pela comunidade. O Conselho de Administra&ccedil;&atilde;o tem a obriga&ccedil;&atilde;o de alto n&iacute;vel para assegurar que o projeto netbeans.org seja executado de uma forma justa e aberta. O Conselho de Administra&ccedil;&atilde;o existe como um &uacute;ltimo recurso para resolver disputas e descontentamentos. Todo esfor&ccedil;o deveria ser feito para resolver as disputas no n&iacute;vel da comunidade antes de pass&aacute;-las ao Conselho de Administra&ccedil;&atilde;o. Os membros do Conselho de Administra&ccedil;&atilde;o, passados e pesentes est&atilde;o listados na <a href="who-board.html">p&aacute;gina Conselho de Administra&ccedil;&atilde;o</a>.</li>
  <li>
    
    <p>Caso seja necess&aacute;rio contatar o Conselho de Administra&ccedil;&atilde;o, envie um e-mail para: <a href="mailto:nbboard@netbeans.org">nbboard@netbeans.org</a>. Esta lista inclui os membros atuais do Conselho de Administra&ccedil;&atilde;om e tamb&eacute;m pode incluir membros passados do Conselho de Administra&ccedil;&atilde;o, que t&ecirc;m o direito de optar por permanecer inscritos na lista ap&oacute;s a conclus&atilde;o de seus termos. Os membros passados do Conselho de Administra&ccedil;&atilde;o na lista podem participar e opinar em quaisquer discuss&otilde;es, mas n&atilde;o t&ecirc;m nenhum voto ou poder sobre os eventos atuais. <i>Lembre-se que o Conselho de Administra&ccedil;&atilde;o &eacute; o &uacute;ltimo recurso para decidir sobre as disputas--<b>por favor</b> tente resolver os problemas nas listas normais de correio p&uacute;blico antes de contatar o Conselho de Administra&ccedil;&atilde;o!</i></p></li>
  <li>
    <p>N&oacute;s procuramos manter os procedimentos de reg&ecirc;ncia o mais leve poss&iacute;vel. Acima de tudo, n&oacute;s convidamos todos os desenvolvedores interessados a tomar parte no aprimoramento deste projeto - n&oacute;s procuramos por opini&otilde;es de todos. Os procedimentos de reg&ecirc;ncia nunca deveriam se tornar um obst&aacute;culo para o momento de qualquer grupo ou indiv&iacute;duo dentro mesmo, que procura criar software como parte do projeto NetBeans.</p></li>
  <li>
    
    <p><b><i>Como se tornar membro do Conselho de Administra&ccedil;&atilde;o:</i></b> os membros do Conselho de Administra&ccedil;&atilde;o precisam ser indicados por membros da comunidade em listas de correio p&uacute;blicas durante o ciclo de elei&ccedil;&otilde;es para o Conselho de Administra&ccedil;&atilde;o. Qualquer participante na comunidade &eacute; eleg&iacute;vel para ser membro do Conselho de Administra&ccedil;&atilde;o do NetBeans. A responsabilidade dos membros tem sido historicamente bem leve, mas qualquer pessoas procurando ser indicado, deveria estar ciente de que existe a possibilidade de que tenha que tomar decis&otilde;es que podem afetar o futuro do projeto. Os procedimentos de indica&ccedil;&atilde;o e vota&ccedil;&atilde;o est&atilde;o descritos em detalhe na p&aacute;gina <a href="election-process.html">Processo de Elei&ccedil;&atilde;o do Conselho de Administra&ccedil;&atilde;o</a>.
    </p>
    
  </li>

</ul>


<h2>Aspectos Legais</h2>

<br>

Consulte na <a href="http://www.oracle.com/html/privacy.html">Pol&iacute;tica de Privacidade</a> da Oracle, os <a href="../legal/terms-of-use.html">Termos de Uso</a>.
</body></html>