<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>C&oacute;digo-fonte aberto</title>
  <meta name="description"
 content="About the NetBeans Open Source Project">
  <meta name="NAV_LINK" content="Open Source">
  <meta name="NAV_PRIORITY" content="0">
</head>
<body>
<h1>O NetBeans &eacute; um c&oacute;digo-fonte aberto</h1>
<br>
O projeto NetBeans &eacute; <i>um porjeto de c&oacute;digo-fonte aberto</i> O que isso significa:
<p></p>
<ul>
  <li>A Plataforma e IDE NetBeans s&atilde;o gr&aacute;tis para uso comercial e n&atilde;o comercial.</li>
  <li>O c&oacute;digo-fonte para ambos est&aacute; dispon&iacute;vel para que qualquer pessoa o reutilize como considerarem adequado sob os termos da <a href="../legal/license.html">licen&ccedil;a</a>.<br>
  </li>
  <li>O desenvolvimento da Plataforma e IDE acontecem em p&uacute;blico. As decis&otilde;es s&atilde;o feitas em listas de correio p&uacute;blicas, por consenso.</li>
  <li>Indiv&iacute;duos ou empresas pode contribuir com c&oacute;digo para este projeto; a participa&ccedil;&atilde;o est&aacute; aberta a todos.</li>
</ul>
<p>Com exce&ccedil;&atilde;o do conte&uacute;do que explicitamente especifique a licen&ccedil;a sob a qual &eacute; tornado dispon&iacute;vel, o software e outro conte&uacute;do neste site &eacute; licenciado sob a Licen&ccedil;a de Distribui&ccedil;&atilde;o e Desenvolvimento Comum, que &eacute; compilada com a <a
 href="http://opensource.org/docs/osd">Defini&ccedil;&atilde;o de c&oacute;digo-fonte aberto</a>. Qualquer bin&aacute;rio de terceiros inclu&iacute;dos em diret&oacute;rios externos na &aacute;rvore de c&oacute;digo-fontem s&atilde;o licenciados sob seus pr&oacute;prios termos e condi&ccedil;&otilde;es.
</p>
<p></p>
<h2>Por qu&ecirc; c&oacute;digo-fonte aberto?</h2>
<br>
H&aacute; muitos motivos para escolher a abordagem de c&oacute;digo-fonte aberto para criar software. Essa abordagem pode ser descrita variavelmente como:
<ul>
  <li>Um conjunto de melhores pr&aacute;ticas para o desenvolvimento de software distribu&iacute;do geograficamente.</li>
  <li>Uma forma de assegurar que o software atenda as necessidades de seus usu&aacute;rios ao assegurar que esses usu&aacute;rios possam participar em sua cria&ccedil;&atilde;o.</li>
  <li>Uma forma de assegurar que os usu&aacute;rios do software sejam capazes de modific&aacute;-lo para atender suas necessidades e, que nenhuma entidade &uacute;nica possa agir contra o interesse do projeto ou da comunidade.</li>
  <li>Uma forma de criar software que ajuda a assegurar a alta qualidade pela revis&atilde;o dos pares e pela din&acirc;mica social (o conceito de &quot;muitos pares de olhos&quot;).</li>
  <li>Uma forma de criar software que evite as pol&iacute;ticas hierarquicas e organizacionais que possa tornar menos eficientes os esfor&ccedil;os de desenvolvimento comercial.</li>
</ul>
<p>H&aacute; muitas outras descri&ccedil;&otilde;es poss&iacute;veis, variando de pr&aacute;ticas a religiosas. A pergunta mais importante &eacute;, funciona? Desde 1998, com a participa&ccedil;&atilde;o de milhares de indiv&iacute;duos e centenas de empresas (algumas das quais desenvolveram seus neg&oacute;cios sobre o software aqui criado), podemos acreditar que a reposta &eacute; um &quot;sim&quot; sem qualifica&ccedil;&atilde;o. Mas a melhor forma de testar esta reposta &eacute; <a href="/community/contribute/">envolver-se</a> ina comunidade NetBeans e descobrir por si pr&oacute;prio os benef&iacute;cios.
</p>
</body>
</html>
