<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<link rel="stylesheet" type="text/css" href="../../netbeans.css">
<title>Mailing Lists and Forums</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta http-equiv="Content-Style-Type" content="text/css">
<meta name="CHANGEDBY" content="Paulo Cristo">
<meta name="DESCRIPTION" content="NetBeans mailing lists and forums, how to subscribe, unsubscribe, browse archives">
<meta name="keywords" content="java IDE, java editor, java Platform, free, open source, java development, j2ee support, development enviroment, web development, NetBeans, IDE, java">
</head>

<body>

<h1>Listas de Discuss&atilde;o NetBeans</h1>

<p>Quer voc&ecirc; seja um utilizador &agrave; procura de
ajuda sobre
o IDE ou um programador discutindo aspectos da nova vers&atilde;o,
estas listas de discuss&atilde;o s&atilde;o o local onde tudo
isso
acontece. Para subscrever, anular a subscri&ccedil;&atilde;o,
explorar arquivos, ou para mais informa&ccedil;&atilde;o sobre
determinada lista em particular, por favor siga os links apropriados
em baixo. </p>

<h3>Novos utilizadores come&ccedil;am aqui!</h3>

<ul>

  <li>

    <p>Se voc&ecirc; estiver interessado em utilizar o
NetBeans IDE e precisar de suporte, no m&iacute;nimo
dever&aacute; subscrever a lista <b>nbannounce</b> e a
    <b>nbusers</b>, as principais <a href="top.html#top">listas
de interesse para utilizadores</a>. </p>


  </li>


</ul>


<h3>Que outras listas deverei eu subscrever tamb&eacute;m?!</h3>


<ul>


  <li>
Se estiver interessado
em desenvolver o NetBeans, subscreva a <b>nbdev</b> e a <b>dev@openide</b>,
e talvez algumas outras <a href="top.html#dev">listas de
desenvolvimento</a>. Se estiver profundamente envolvido no
desenvolvimento, talvez esteja interessado tamb&eacute;m nas <a href="other.html">listas sobre o processo de
cria&ccedil;&atilde;o/compila&ccedil;&atilde;o</a>.
  </li>


  <li>
Se estiver a
desenvolver algo com uma interface gr&aacute;fica ou estiver
interessado em assuntos de usabilidade, subscreva a <b>nbui</b>,
a <a href="top.html#dev">lista de usabilidade</a>.
  </li>


  <li>
Existem algumas listas <b>m&oacute;dulo-espec&iacute;ficas</b>,
isto &eacute;, listas alojadas num e sobre um projecto ou
m&oacute;dulo Netbeans espec&iacute;fico. Estas tendem a ser
listas mais pequenas, e obviamente muito mais especializadas. O melhor
&eacute; perguntar sobre elas na <a href="top.html#dev">nbdev</a>
se estiver interessado em &ldquo;mergulhar de
cabe&ccedil;a&rdquo; num determinado m&oacute;dulo em
particular.
  </li>


  <li>
Tamb&eacute;m
disponibilizamos listas para os membros da comunidade interessados em
ofertas de empregos relacionadas com o NetBeans, o site netbeans.org e
o envangelismo NetBeans &ndash; veja as <a href="top.html#community">listas relacionadas com a
comunidade.</a>
  </li>


  <li>
Pode tamb&eacute;m
falar com programadores de Java em Franc&ecirc;s, Russo,
Portugu&ecirc;s, Japon&ecirc;s ou Chin&ecirc;s, veja <a href="top.html#localised">listas na sua l&iacute;ngua</a>.
  </li>


  <li>

    <p>Veja a <a href="../../about/legal/license.html">p&aacute;gina
da licen&ccedil;a</a> para apontadores de onde discutir a
licen&ccedil;a. </p>


  </li>


</ul>


<h2>F&oacute;rums e Newsgroups</h2>


<ul>


  <li>

    <p><b>Acesso aos Forums</b></p>



    <p>Se voc&ecirc; preferir f&oacute;rums de
discuss&atilde;o em vez de listas de discuss&atilde;o, todas as
mensagens enviadas para a lista de discuss&atilde;o NetBeans
s&atilde;o arquivadas num f&oacute;rum totalmente funcional.
Explore e pesquise e-mails arquivados, mensagens colocadas nas listas
de discuss&atilde;o s&atilde;o propagadas para o
f&oacute;rum, e vice versa. Aqui pode ter uma <a href="http://www.nabble.com/Netbeans.org-f2602.html">vis&atilde;o
geral de todos os f&oacute;rums NetBeans</a> alojados no
Nabble.com. </p>



    <p>Voc&ecirc; precisa de <a href="http://www.nabble.com/user/Register.jtp">registar-se
no Nabble</a> para usar este servi&ccedil;o. Adicionalmente,
as mensagens colocadas via f&oacute;rum ser&atilde;o moderadas
a menos que voc&ecirc; subscreva a lista de
n&atilde;o-subscritores, aos quais &eacute; permitido colocar
mensagens. Para evitar que as suas sejam moderadas, e para poupar
trabalho aos moderadores, por favor contacte o respons&aacute;vel
pela lista e pe&ccedil;a isso mesmo. </p>



    <p style="margin-bottom: 0cm;"><b>Nota :</b>
SourceCast (a aplica&ccedil;&atilde;o que aloja o netbeans.org)
ainda n&atilde;o inclu&iacute; suporte para f&oacute;rum,
pelo que este servi&ccedil;o &eacute; fornecido pelo
servi&ccedil;o Free Hosted Public Forums disponibilizado pelo <a href="http://www.nabble.com/">Nabble</a>. </p>


  </li>


  <li>

    <p><b>Usenet /Acesso NNTP</b></p>



    <p>Alternativamente, se preferir o servi&ccedil;o de
not&iacute;cias USENET em vez das listas de discuss&atilde;o,
todas as &ldquo;listas de topo&rdquo; s&atilde;o
disponibilizadas como not&iacute;cias &ndash; mensagens para as
listas s&atilde;o propagadas para os newsgroups, e vice versa.
Aponte o seu cliente de news para news.gmane.org. Note que o nome dos
grupos n&atilde;o s&atilde;o exactamente os mesmos das listas
de discuss&atilde;o (para respeitar as
conven&ccedil;&otilde;es Gmane), embora a ma&iacute;oria
seja bastante &oacute;bvio. Use a sua
aplica&ccedil;&atilde;o cliente para procurar por grupos
"netbeans" &ndash; por ex: <code>gmane.comp.java.ide.netbeans.users</code>.
    </p>



    <p>Para colocar mensagens nas listas via NNTP, voc&ecirc;
necessitar&aacute; de responder ao pedido de
autoriza&ccedil;&atilde;o que o GMane enviar&aacute;.
Adicionalmente, as mensagens colocadas via NNTP ser&atilde;o
moderadas a menos que voc&ecirc; subscreva a lista de
n&atilde;o-subscritores, aos quais &eacute; permitido colocar
mensagens. Para evitar que as suas sejam moderadas, e para poupar
trabalho aos moderadores, por favor contacte o respons&aacute;vel
pela lista e pe&ccedil;a isso mesmo. </p>



    <p><b>Nota :</b> SourceCast (a
aplica&ccedil;&atilde;o que aloja o netbeans.org)
n&atilde;o inclu&iacute; suporte para NNTP, pelo que este
servi&ccedil;o &eacute; fornecido pela lista de
discuss&atilde;o livre, do gateway NNTP <a href="http://www.gmane.org/">Gmane</a>. </p>


  </li>


</ul>


<h2>Suspender a Subscri&ccedil;&atilde;o de uma Lista de
Discuss&atilde;o</h2>


<p>Links para anular subscri&ccedil;&otilde;es
s&atilde;o inclu&iacute;dos
em cada uma das p&aacute;ginas de listas abaixo, logo ao lado dos
links para subscri&ccedil;&atilde;o. Se tiver problemas : </p>


<ul>


  <li>
    <b>N&atilde;o
env&iacute;e um e-mail com o assunto"unsubscribe me" (elimine a
minha subscri&ccedil;&atilde;o) or "help" (ajuda) para a lista
da qual pretende anular a subscri&ccedil;&atilde;o!</b>
  </li>


  <li>
Verifique o <a href="http://wiki.netbeans.org/wiki/view/NetBeansUserFAQ#section-NetBeansUserFAQ-MailingLists">FAQ
da Lista de Discuss&atilde;o</a> e a p&aacute;gina <a href="unsubscribe.html">Como Anular a
Subscri&ccedil;&atilde;o</a> para obter ajuda.
  </li>


  <li>

    <p>Se mesmo assim n&atilde;o conseguir anular a sua
subscri&ccedil;&atilde;o, contacte o respons&aacute;vel
pela lista &ndash; detalhes no <a href="http://wiki.netbeans.org/wiki/view/NetBeansUserFAQ#section-NetBeansUserFAQ-MailingLists">FAQ</a>.
    </p>


  </li>


</ul>


<h2>&ldquo;Etiqueta&rdquo; na Lista</h2>


<p>Embora a contribui&ccedil;&atilde;o de todos seja
sempre
bem-vinda, as listas de topo s&atilde;o bastante
&ldquo;volumosas&rdquo;,
e colocar um pequeno esfor&ccedil;o nas mensagens que enviar,
poder&aacute;
significar a diferen&ccedil;a entre obter uma resposta ou ser
ignorado. <i>Por favor</i> tente seguir alguma
&ldquo;etiqueta&rdquo;
da lista e senso comum ao colocar mensagens! Umas quantas dicas : </p>


<ol>


  <li>
N&atilde;o coloque
a mesma mensagem em mais do que uma lista &ndash; escolha uma e
coloque-a apenas a&iacute;. Se estiver no s&iacute;tio errado
algu&eacute;m ir&aacute; inform&aacute;-lo sobre isso e
sugerir uma alternativa. </li>


  <li>
N&atilde;o responda
a uma mensagem mudando o assunto por completo, j&aacute; que os
leitores de e-mail baseados em &ldquo;threads&rdquo; (assunto)
mostrar-la-&atilde;o num s&iacute;tio esqu&iacute;sito;
envie uma nova mensagem quando in&iacute;ciar um novo assunto.
  </li>


  <li>
Leia o guia <a href="http://www.catb.org/%7Eesr/faqs/smart-questions.html">Como
Fazer Perguntas da Forma Correcta</a> do Eric Raymond.
  </li>


  <li>
Por favor,
fa&ccedil;a uma triagem do texto original na sua resposta. Inclua o
m&iacute;nimo de texto original directamente relacionado com a sua
resposta. P&iacute;or, &eacute; o h&aacute;bito de criar
uma resposta de uma linha, seguida do e-mail original na sua
totalidade.
  </li>


  <li>
Da mesma forma, se
estiver a fazer uma resposta ponto a ponto, onde incluiu algum texto
original seguido da sua resposta, fazendo depois o mesmo no ponto
seguinte, por favor fa&ccedil;a com que seja f&aacute;cil de
encontrar nas suas respostas. Se voc&ecirc; incluiu 40 linhas de
texto original seguido de uma linha de resposta, ent&atilde;o,
continuar depois com outras 40 linhas de texto original, torna muito
dif&iacute;cil de encontrar a&iacute; a sua resposta. Se
precisar mesmo de incluir a totalidade das 40 linhas de texto citado,
talvez adionar uma linha em branco depois dele e antes da sua resposta,
seja uma boa id&eacute;ia. Ou talvez, adicionar duas linhas em
branco a seguir &agrave; sua resposta, antes de continuar novamente
com o texto original.
  </li>


  <li>
Por favor
n&atilde;o use texto formatado no seu e-mail. A sua escolha do tipo
de letra, tamanho da letra, cor da letra, etc. pode fazer com que o seu
e-mail se torne virtualmente imposs&iacute;vel de ler por outros!
Por favor, use apenas texto simples, a menos que tenha uma boa
raz&atilde;o em contr&aacute;rio. Se voc&ecirc;
simplesmente, n&atilde;o formatar o seu texto, todos os leitores de
e-mail das outras pessoas, ir&atilde;o format&aacute;-lo da
forma pr&eacute;-definida, em cada aplica&ccedil;&atilde;o,
garantindo assim que &eacute; leg&iacute;vel e
agrad&aacute;vel &agrave; vista em qualquer lado.
  </li>


  <li>
Da mesma forma, por favor n&atilde;o envie mensagens
HTML! A legibilidade, o tamanho das mensagens e a seguran&ccedil;a,
s&atilde;o apenas algumas das raz&otilde;es para n&atilde;o
enviar e-mails em formato HTML!. Uma boa
descri&ccedil;&atilde;o destes e de outros problemas, bem como
instru&ccedil;&otilde;es sobre como desactivar e-mail em HTML,
em muitos dos mais populares clientes de e-mail est&aacute;
dispon&iacute;vel em <a href="http://kb.mozillazine.org/Plain_text_e-mail_%28Thunderbird%29">http://kb.mozillazine.org/Plain_text_e-mail_%28Thunderbird%29</a>.

    <p><i>Anexos</i> HTML n&atilde;o representam
quaisquer problemas!</p>


  </li>


</ol>


<h2>Um nota sobre filtros de e-mail</h2>


<p>Como algumas das listas t&ecirc;m um grande volume de
mensagens,
algumas conven&ccedil;&otilde;es s&atilde;o usadas para
ajudar na
listagem e filtragem das mesmas. O software da lista de
discuss&atilde;o
coloca automaticamente um prefixo no Assunto: o nome da lista de
discuss&atilde;o NetBeans em quest&atilde;o. Assim por exemplo,
mensagens enviadas para a lista nbdev t&ecirc;m nos assuntos o
prefixo <b>[nbdev]</b>. </p>


<p>&Eacute; tamb&eacute;m pr&aacute;tica comum dos
subscritores das
listas, adicionarem algum tipo de etiqueta/t&oacute;pico no campo
assunto, tal como [Stable3.1 Release], para seguirem o rasto de
t&oacute;picos diferentes, mas relacionados entre s&iacute;.
Isto &eacute;
obviamente uma escolha de cada um. </p>


<p><br>


</body>
</html>
