<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<HTML>
<HEAD>
<TITLE>Postituslistat ja foorumit</title>
<META NAME="description" CONTENT="NetBeans mailing lists and forums, how to subscribe, unsubscribe, browse archives">
<meta http-equiv="content-language" CONTENT="fi">
<link rel="stylesheet" type="text/css" HREF="../../netbeans.css">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
</HEAD>

<BODY>

<h1>NetBeans postituslistat</h1>
Olitpa sitten k&auml;ytt&auml;j&auml;, joka etsii apua IDEen tai sitten kehitt&auml;j&auml;, joka keskustelee seuraavan julkaisun asioista, n&auml;m&auml;
postituslistat ovat paikkoja, jossa kaikki tapahtuu. Postituslistalle liittyminen ja eroaminen, arkistojen selailu tai
jostain tietyst&auml; listasta tiedon hakeminen tapahtuu alla olevia linkkej&auml; seuraamalla.

<UL>
<LI><A HREF="top.html">Ylimm&auml;n tason listat</A> &nbsp;<I>Uudet k&auml;ytt&auml;j&auml;t aloittakaa t&auml;&auml;lt&auml;!</I>

<BR>Sis&auml;lt&auml;&auml; ylemm&auml;n tason tiedotuksia, k&auml;ytt&auml;jien postituslistan (nbusers),
NetBeans kehityslistan (nbdev), k&auml;ytt&ouml;liittym&auml;listan (nbui) ja OpenAPI listan (dev@openide).
<P></LI>

<LI><A HREF="other.html">Other Lists</a> : Build-prosessilistat (automatisoitu tuloste jatkuvasta build-prosessista
ja API muutoksiin liittyvist&auml; testeist&auml); bugi ja CVS tiedoksiantolistat (useita erilaisia bugi- ja CVS-listoja.
Liikenne koostuu ainoastaan automatisoiduista CVS-tarkastusilmoituksista tai bugien tilanmuutoksista) ...<P></LI>

<LI><A HREF="../../about/legal/license.html">Lisensseihin liittyv&auml;t keskustelut</A> :
Katso lisenssisivu saadaksesi selville miss&auml; lisenssist&auml; voidaan keskustella.<P></LI>

</UL>

<P><h2>Mihin listoihin liittyisin?!</h2>
<BR>Se mihin listoihin haluat liitty&auml; riippuu siit&auml;, millainen kiinnostuksen ja osallistumisen halu sinulla on
NetBeanssi&auml; kohtaan.  T&auml;m&auml; vaihtelee k&auml;ytt&auml;j&auml;kohtaisesti ja muuttuu sen mukaan mit&auml; asioita tietyll&auml; listalla
k&auml;sitell&auml;&auml;n. Jos listalla ei ole sinulle kiinnostavaa asiaa et varmastikaan halua kuulua kyseiselle listalle.
T&auml;ss&auml; hiukan ohjeita, joilla p&auml;&auml;set alkuun

<P>
<UL><LI>Jos olet kiinnostunut NetBeanssin k&auml;yt&ouml;st&auml;, liity v&auml;hint&auml;&auml;n nbannounce- ja nbusers-listoille.</LI>
<LI>Jos olet kiinnostunut NetBeanssin kehitt&auml;misest&auml;, haluat varmaankin
liitty&auml; nbdevi- ja dev@openide -listoille.</LI>
<LI>Jos olet kehitt&auml;m&auml;ss&auml; jotain k&auml;ytt&ouml;liittym&auml;&auml;n, liity
nbui-listalle.</LI>

<LI>Jos olet <I>eritt&auml;in ahkerasti</I> mukana IDEn kehityksess&auml;, saatat olla kiinnostunut my&ouml;s j&auml;ljell&auml; olevista
postituslistoista - build-listat sek&auml; bugi- ja cvs-listat.</LI>
</UL>


<P><h2>NNTP p&auml;&auml;sy</h2>
Jos k&auml;yt&auml;t mieluummin USENETti&auml; postituslistojen sijaan, kaikki ylemm&auml;n tason listat
<BR>ovat linkitetty uutisiin - listoille postitetut viestit ohjataan uutisryhmiin ja p&auml;invastoin.
Osoita uutislukijasi osoitteeseen
<A HREF="news://news.gmane.org/">news.gmane.org</A>.
Huom! Ryhm&auml;nimet eiv&auml;t ole t&auml;ysin samoja kuin postituslistanimet
(verrataksemme Gmaneen). K&auml;yt&auml; asiakasohjelmaasi "netbeans"-ryhmien etsimiseen -
esimerkiksi gmane.comp.java.ide.netbeans.users.

<P><B>Huom :</B> SourceCast (sovellus, joka is&auml;nn&ouml;i netbeans.orgia)
ei sis&auml;ll&auml; NNTP-tukea, joten t&auml;m&auml; palvelu on toteutettu
<A HREF="http://www.gmane.org/">Gmane</A>-ohjelmalla.


<P><h2>Eroaminen postituslistalta</h2>
<BR>Postituslistalta eroamiseen tarkoitetut linkit ovat jokaisessa edell&auml; mainitussa listassa juuri
liittymiseen tarkoitettujen linkkien vieress&auml;.
Jos tulee ongelmia :

<ul>
<li><b>&auml;l&auml; l&auml;het&auml; s&auml;hk&ouml;postia, kuten "unsubscribe me" tai "help" sille listalle, josta
haluat erota!</b>
<li>Katso <a href="http://wiki.netbeans.org/wiki/view/NetBeansUserFAQ#section-NetBeansUserFAQ-MailingLists">postituslista FAQ</a>
ja <a href="unsubscribe.html">kuinka eroan postituslistalta</a> sivuilta lis&auml;&auml; apua
<li>Jos et viel&auml;k&auml;&auml;n pysty eroamaan postituslistalta, ota yhteytt&auml; listan omistajaan - yksityiskohtaiset tiedot l&ouml;ytyv&auml;t
<a href="http://wiki.netbeans.org/wiki/view/NetBeansUserFAQ#section-NetBeansUserFAQ-MailingLists">FAQ:sta</a>.
</ul>

<P><h2><a name="etiquette">Postituslista etiketti</a></h2>
<BR>Jokaisen k&auml;ytt&auml;j&auml;n viestit ovat tervetulleita, mutta ylemm&auml;n tason listoilla
on paljon liikennett&auml;, joten jos panostat hiukan aikaa viestien laatuun, joita l&auml;het&auml;t listoille,
varmistat sen ett&auml; tulet paremmin kuulluksi kuin huomiotta j&auml;&auml;neeksi.
<I>Ole yst&auml;v&auml;llinen</I> ja yrit&auml; seurata
maalaisj&auml;rke&auml;si, kun l&auml;het&auml;t viestej&auml; listoille!  Muutama ohje :

<OL>
<LI>&Auml;l&auml; postita samaa kysymyst&auml; kuin yhdelle listalle - valitse lista
ja postita vain sinne. Jos se on v&auml;&auml;r&auml; lista, joku kyll&auml; ilmoittaa sinulle
ja ehdottaa toista listaa

<LI>&Auml;l&auml; vastaa viestiin siten, ett&auml; muutat t&auml;ysin aihetta, since
threaded mailreaders show it in a weird place; send a new message when
starting a new thread

<LI>Lue Eric Raymondin opas, kuinka teet "viisaita" kysymyksi&auml; osoitteessa
<A HREF="http://www.catb.org/~esr/faqs/smart-questions.html">http://www.catb.org/~esr/faqs/smart-questions.html</A>

<LI>Ole yst&auml;v&auml;llinen ja referoi alkuper&auml;inen teksti vastauksessasi. Sis&auml;llyt&auml; niin v&auml;h&auml;n alkuper&auml;isest&auml; tekstist&auml;
kuin on tarpeen , ts. s&auml;ilytetyn tekstin tulee liitty&auml; siis suoraan sinun vastaukseesi.
Pahin tapa on vastata yhdell&auml; lauseella kysymykseen, jota seuraa alkuper&auml;inen s&auml;hk&ouml;posti
kokonaisuudessaan.

<LI>Jos vastaat kysymyksiin kohta kohdalta (eli ensin on hiukan alkuper&auml;ist&auml; teksti&auml;, jonka j&auml;lkeen
tulee vastauksesi), tee vastaustesi l&ouml;yt&auml;misest&auml; helppoa.
Jos olet esimerkiksi sis&auml;llytt&auml;nyt 40 rivi&auml; alkuper&auml;isest&auml; tekstist&auml;, jonka j&auml;lkeen tulee
sinun tekem&auml; yhden rivin vastaus, on todella vaikeaa l&ouml;yt&auml;&auml; vastaustasi.
Jos joudut v&auml;ltt&auml;m&auml;tt&auml; sis&auml;llytt&auml;m&auml;&auml;n 40 rivi&auml; lainattua teksti&auml;, on ehken hyv&auml;
j&auml;tt&auml;&auml; tyhj&auml; rivi ennen vastaustasi. Jos taas jatkat lainattuun tekstiin vastaamista, on ehken hyv&auml;
j&auml;tt&auml;&auml; muutama rivi tyhj&auml;&auml; ennen kuin jatkat alkuper&auml;isell&auml; tekstill&auml;.

<LI>Ole yst&auml;v&auml;llinen ja el&auml; k&auml;yt&auml; muotoiltua teksti&auml; s&auml;hk&ouml;postiviestiss&auml;si. Valitsemasi fontti, fontin koko,
fontin v&auml;ri jne. voi aiheuttaa sen, etteiv&auml;t muut pysty lukemaan sit&auml;!  K&auml;yt&auml; siis vain tavallista teksti&auml;
ellei ole jotain aivan pakottavaa syyt&auml; k&auml;ytt&auml;&auml; muotoiltua teksti&auml;. Jos et siis yksinkertaisesti muotoile teksti&auml;si,
k&auml;ytt&auml;jien s&auml;hk&ouml;postiohjelmat muotoilevat tekstin haluamallansa tavalla varmistaen sen, ett&auml; teksti on luettavaa.


<LI>&Auml;l&auml; my&ouml;sk&auml;&auml;n l&auml;het&auml; HTML-viestej&auml;! Luettavuus,
viestien koko ja tietoturva ovat vain muutamia syit&auml; miksi ei kannata l&auml;hett&auml;&auml;
HTML-viestej&auml;. Hyv&auml; kuvaus edell&auml; mainituista ja muista ongelmista, kuten my&ouml;s ohjeita
siihen, kuinka poistaa HTML-viestit k&auml;yt&ouml;st&auml;, l&ouml;ytyy osoitteesta
<A HREF="http://kb.mozillazine.org/Plain_text_e-mail_%28Thunderbird%29">http://kb.mozillazine.org/Plain_text_e-mail_%28Thunderbird%29</A>

<P>HTML-<I>liitteet</I> k&auml;yv&auml;t tietenkin hyvin!

</OL>

<P><h2>Hiukan postin suodattamisesta</h2>
<BR>Koska useilla listoilla on paljon k&auml;ytt&auml;ji&auml;, on muutama ennalta m&auml;&auml;ritelty sopimus voimassa, jotka
auttavat s&auml;hk&ouml;postiviestien j&auml;rjestelyss&auml; ja suodattamisessa. Postituslistaohjelma laittaa jokaisen
aiheen (Subject) eteen kyseist&auml; postituslistaa koskevan etuliitteen. Esimerkiksi viestit, jotka ovat ovat
nbdev-listalla, saavat ennen varsinaista aihetta <B>[nbdev]</B>-liitteen.

<P>Postituslistalle kuuluville k&auml;ytt&auml;jille on my&ouml;s yleist&auml; se, ett&auml;
he lis&auml;&auml;v&auml;t puheenaihetta koskevan otsikon ennen varsinaista aihetta, kuten [Stable3.1 Release].
T&auml;ll&auml; he pyrkiv&auml;t selkiytt&auml;m&auml;&auml;n sit&auml;, mihin aiheeseen viesti kuuluu. T&auml;m&auml; on tietenkin yksil&ouml;llist&auml;.


<P><BR>

</BODY>
</HTML>
