<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>10&ordm; anivers&aacute;rio do NetBeans - Reconhecimento</title>
  <link rel="stylesheet" type="text/css" href="../netbeans.css">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <meta http-equiv="Content-Style-Type" content="text/css">
</head>
<body>
<h1>Reconhecimento da Comunidade NetBeans</h1>
Um aplauso mais ao chegar mais perto a celebra&ccedil;&atilde;o do 10 anivers&aacute;rio do NetBeans! E isso vai para todos os indiv&iacute;duos que se destacaram e que t&ecirc;m estado envolvidos no projeto NetBeans, dos esfor&ccedil;os do nascedouro aos dias de hoje. Desejamos aqui reconhec&ecirc;-los e oferecer nosso muito obrigado.<br>
<br>
<h2>FKA Xelfi<br>
</h2>
<p>As brilhantes mentes jovens que lan&ccedil;aram o projeto estudantil em 1996. Eles ganham a nota dez de n&oacute;s!<br>
</p>
<ul>
  <li> <strong>Roman Blazevic</strong> </li>
  <li> <strong>Filip Dvorak</strong> </li>
  <li> <strong>Petr Hamernik</strong> </li>
  <li> <strong>Jan Jancura</strong> </li>
  <li> <strong>Jan Formanek</strong> </li>
  <li> <strong>David Simonek</strong> </li>
  <li> <strong>Jaroslav Tulach</strong> </li>
  <li> Sob a dire&ccedil;&atilde;o de <strong>Adam Dingle</strong>. </li>
</ul>
<h2>NetBeans Inc.</h2>
<p>Para ser notado no est&aacute;gio mundial, um projeto estudantil precisa de organizadores e benefici&aacute;rios. As pessoas a seguir forma fundamentais em transformar o NetBeans em um neg&oacute;cio iniciante atrativo que obteve a aten&ccedil;&atilde;o da ind&uacute;stria. Consulte tamb&eacute;m: <a
 href="http://www.developer.com/java/other/print.php/631131">The NetBeans Open-Source Story</a> (Developer.com article, 2001)</p>
<ul>
  <li> <strong>Jan Formanek</strong> </li>
  <li> <strong>Roman Stanek</strong> </li>
  <li> <strong>Helena Stolka</strong> </li>
  <li> <strong>Jaroslav Tulach</strong> </li>
  <li> <strong>Esther Dyson</strong></li>
</ul>
<div style="text-align: center;"><a
 href="../images_www/articles/birthday/netbeans-team-around-1997-12-05.jpg"><img
 src="../images_www/articles/birthday/netbeans-team-thumb.jpg"></a><br>
<span style="font-style: italic;">Linha superior: Desconhecido, Petr Hamern&iacute;k, Aleš Nov&aacute;k, Jack Catchpoole </span><br style="font-style: italic;">
<span style="font-style: italic;">Linha inferior: Roman Staněk, Jan Form&aacute;nek, Helena Stolka, Jan Jančura, Jaroslav Tulach, Desconhecido</span>
<br>
</div>
<br>
<h2>Comunidade de C&oacute;digo-fonte Aberto do NetBeans</h2>
<p>Em Outubro de 1999 a Sun Microsystems adquiriu a NetBeans com 40 funcion&aacute;rios e em Junho de 2000 criou o projeto C&oacute;digo-aberto. Desde ent&atilde;o houveram in&uacute;meras pessoas talentosas e dedicadas que ajudaram o projeto NetBeans ao longo de sua hist&oacute;ria. Alguns dos destacados membros da comunidade e suas contribui&ccedil;&otilde;es:</p>
<ul>
  <li> <strong>Vincent Brabant</strong> - Contribuidor com conte&uacute;do da Web, um dos primeiros tradutores do NetBeans e evangelista da comunidade NetBeans na Fran&ccedil;a. </li>
  <li> <strong>Wade Chandler</strong> - Fun&ccedil;&atilde;o ativa de suporte na comunidade, ajudou a definir e estabelecer o NetBeans Dream Team, foi jurado do concurso NetBeans Innovators Grant e lidera o projeto PlatformX.</li>
  <li><strong>Fabrizio Giudici</strong> - Soberbo entusiasta da Plataforma NetBeans, fun&ccedil;&atilde;o ativa de suporte na comunidade e membro do Dream Team.</li>
  <li> <strong>Anuradha Gunasekara</strong> - Esfor&ccedil;os soberbos em testes: corre&ccedil;&atilde;o de bugs e teste de retro-compatibilidade de API e coopera&ccedil;&atilde;o na integra&ccedil;&atilde;o Maven. </li>
  <li><strong>Glenn Holmer</strong> - Ajuda s&oacute;lida e alta qualidade em todos os programas NetCAT e destacado suporte para a comunidade.</li>
  <li><strong>Jacek Laskowski</strong> - Principal contribuidor do NetCAT 6.0 e evangelista da comunidade NetBeans na Pol&ocirc;nia.</li>
  <li> <strong>Maxym Mykhalchuk</strong> - O primeiro e &uacute;nico Chefe de vers&atilde;o da comunidade (NetBeans 3.4.1) e tamb&eacute;m um dos primeiros l&iacute;deres do esfor&ccedil;o de localiza&ccedil;&atilde;o para o Russo.</li>
  <li><strong>Michael Santos Nascimento</strong> - Ativa participa&ccedil;&atilde;o durante o NetCAT 5.0.</li>
  <li> <strong>Varun Nischal</strong> - Lideran&ccedil;a no programa Contribui&ccedil;&atilde;o de Documenta&ccedil;&atilde;o da Comunidade e membro ativo do Dream Team.</li>
  <li><strong>Victor Manuel Ramirez</strong>, <strong>Sean Carrick</strong>, <strong>Michael Mellinger</strong>, <strong>John Halupka</strong> e <strong>Thomas Kellerer</strong> - Avalia&ccedil;&atilde;o em tempo de plug-ins da comunidade e gerenciamento do NetBeans Plugin Portal Update Center.</li>
  <li> <strong>Daniel Sheppard</strong>, <strong>Tetsu Soh</strong> e <strong>Holger Stenzhorn</strong> - Tremenda ajuda com a modera&ccedil;&atilde;o de listas de correios p&uacute;blicos do NetBeans e participa&ccedil;&atilde;o em programas NetCAT. </li>
  <li> <strong>Lluis Turro</strong> - Contribuidor principal do NetCAT 3.6 e suporte de longo prazo ao NetBeans. </li>
  <li><strong>Tom Wheeler</strong> - Excelente suporte &agrave; comunidade e evangelista da plataforma NetBeans</li>
</ul>
&nbsp;<br>
<span style="font-weight: bold;">H&aacute; tantas pessoas mais que ajudaram com o projeto NetBeans atrav&eacute;s desta jornada. Embora n&atilde;o seja agradecer a todos citando seus nomes, eles tem nossa maior gratid&atilde;o Obrigado por seus incr&iacute;veis anos </span>
<p></p>
</body>
</html>
