<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Celebra&ccedil;&atilde;o do 10&ordm; anivers&aacute;rio do NetBeans: Documentos da comunidade</title>
  <link rel="stylesheet" type="text/css" href="../netbeans.css">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <meta http-equiv="Content-Style-Type" content="text/css">
</head>
<body>
<h1>Celebra&ccedil;&atilde;o do 10&ordm; anivers&aacute;rio do NetBeans: Documentos da comunidade</h1>

<table><tr><td valign="top">
<p>
O programa Documentos da Comunidade NetBeans &eacute; um programa no qual os membros da comunidade redigem e enviam documenta&ccedil;&atilde;o para uso pela comunidade. Desde seu in&iacute;cio em Mar&ccedil;o de 2007, o programa de Documentos da Comunidade se desenvolveu em uma fonte confi&aacute;vel de documenta&ccedil;&atilde;o de qualidade do NetBeans. 
</p><p>
A documenta&ccedil;&atilde;o enviada inclui tutoriais, screencasts, FAQs, cap&iacute;tulos de livros e Dicas e Truques. Atualmente mais de 90 membros da comunidade participam regularmente do programa, que resultou em mais de 220 documentos. O programa Documentos da Comunidade &eacute; uma outra forma na qual os membros da Comunidade NetBeans contribuem para o &ecirc;xito do NetBeans IDE. 
</p><p>
<strong>Diego E. Silva L.</strong> - Por contribuir de forma ativa com tutoriais, dicas e truques e um screencast em Espanhol.
</p><p>
<strong>Hubert A. Klein Ikkink</strong> - Por contribuir de forma ativa com tutoriais e dicas e truques.
</p><p>

<strong>Prakan Puvibunsuk</strong> - Por ser um contribuidor de longo prazo de screencasts.
</p><p>
<strong>Siegfried Bolz</strong> - Por contribuir com muitos tutoriais.
</p><p>
<strong>Tom Wheeler</strong> - Por contribuir de forma ativa com FAQS de desenvolvedor.
</p><p>
Tamb&eacute;m desejamos reconhecer <strong>Aristides Villarreal</strong> e <strong>Kristian Rink</strong> por execer uma enorme papel no programa como evangelistas. E, &eacute; claro, <strong>Varun Nischal</strong> (Coordenador de Contribui&ccedil;&atilde;o) e <strong>Amit Kumar Saha</strong> (Gerente de Conte&uacute;do). 
</p>

<h3>Links relacionados:</h3>
<ul>
<li><a href="http://wiki.netbeans.org/CommunityDocs" target="_top">P&aacute;gina principal de Documentos da Comunidade do NetBeans</a>
<li><a href="http://wiki.netbeans.org/NBCDHeroes" target="_top">Contribuidores Her&oacute;is de Documentos da Comunidade do NetBeans</a>
<li><a href="http://nb-community-docs.blogspot.com/" target="_top">Blog dos Documentos da Comunidade</a>
<li><a href="http://nb-community-docs.blogspot.com/search/label/Weekly">Newsletterdos Documentos da Comunidade do NetBeans</a> <a href="http://www.feedburner.com/fb/a/emailverifySubmit?feedId=2334234">(Assinatura)</a>
<li><a href="https://netbeans.org/community/articles/nb-communitydocs-200.html">O programa de Documentos da Comunidade do NetBeans alcan&ccedil;a um marco: 200 Contribui&ccedil;&otilde;es (e crescendo!)</a> (Agosto de 2008)
<li><a href="https://netbeans.org/community/articles/interviews/comm-docs-branam.html">Entrevista com James Branam, Gerente de Documentos da Comunidade</a> (Novembro de 2007)
</ul>

</td><td>
<div style="text-align: center;">
<p><img src="../images_www/articles/birthday/varun-small.png"><br />Varun Nischal<br />(Coordenador de Contribui&ccedil;&atilde;o)</p>
<br>
<p><img src="../images_www/articles/birthday/amit-small.jpg"><br />Amit Kumar Saha<br />(Gerente de Conte&uacute;do)</p>
<br>
<p><img src="../images_www/articles/birthday/james-small.png"><br />James Branam<br />(Gerente de Documentos da Comunidade)</p>
</div>
</td></tr></table>

</body>
</html>
