<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <link rel="stylesheet" type="text/css" href="../netbeans.css">
  <meta name="author" content="Tinuola Awopetu">
  <meta name="keywords" content="NetBeans IDE, NetBeans Platform, ">
  <title>Decatlon do 10&ordm; Anivers&aacute;rio do NetBeans</title>
</head>
<body>
<h1>Decatlon da Celebra&ccedil;&atilde;o do 10&ordm; Anivers&aacute;rio do NetBeans</h1>
<br>
<table style="text-align: left; width: 100%;" border="0" cellpadding="2"
 cellspacing="2">
  <tbody>
    <tr>
      <td style="vertical-align: top;">
      <div style="text-align: justify;">Para honrar os 10 anos do projeto e comunidade do NetBeans, n&oacute;s selecionamos dez eventos nos quais cada pessoa pode participar para fazer parte da celebra&ccedil;&atilde;o. Os 300 primeiros participantes que completarem o evento e que obtenham at&eacute; 50 pontos, ir&atilde;o receber uma edi&ccedil;&atilde;o limitada da camiseta do 10&ordm; Anivers&aacute;rio do NetBeans. Para manter o esp&iacute;rito comunit&aacute;rio, estes eventos t&ecirc;m base em torno de diversas atividades comunit&aacute;rias e sites: blogs, f&oacute;rums, Facebook e mais. Portanto, se informe, selecione seu evento favorito e entre no esp&iacute;rito da celebra&ccedil;&atilde;o!<br>
      </div>
      <br>
      <h2>Regras</h2>
      <ol>
        <li> 10 eventos, cada um valendo uma quantidade diferente de pontos. </li>
        <li>Complete qualquer n&uacute;mero de eventos e persiga os 50 pontos.</li>
        <li><span style="font-weight: bold;">IMPORTANTE</span>: mantenha o rastreamento de links para entradas de blogs, f&oacute;rums, e assim por diante. Voc&ecirc; ir&aacute; precisar enviar estes links no <a
 style="font-weight: bold;"
 href="http://services.netbeans.org/limesurvey/index.php?sid=69987&amp;lang=en">Formul&aacute;rio de Entrada no Declaton</a>.</li>
        <li>Os 300 primeiros participantes que completarem o formul&aacute;rio do Declaton, ser&atilde;o eleg&iacute;veis para receber uma edi&ccedil;&atilde;o limitada da camiseta do 10&ordm; Anivers&aacute;rio do NetBeans.</li>
        <li>N&atilde;o h&aacute; um julgamento, portanto, seja criativo, pense e se divirta!</li>
        <li>O Declaton termina na segunda-feira, 27 de outubro de 2008.<br>
        </li>
      </ol>
      </td>
      <td style="vertical-align: top;"><img
 style="width: 216px; height: 203px;"
 alt="Camiseta do 10&ordm; Anivers&aacute;rio do NetBeans!"
 src="../images_www/articles/birthday/birthday-tshirt-large.png"><br>
      </td>
    </tr>
  </tbody>
</table>
<br>
<h2>Eventos do Declaton</h2>
<h3>Evento 1: Reda&ccedil;&atilde;o do Blog do Anivers&aacute;rio</h3>
Fa&ccedil;a a reda&ccedil;&atilde;o de um artigo para o blog sobre um dos seguintes t&oacute;picos: <span
 style="font-style: italic;">(15 pontos)</span><br>
<br>
<ul>
  <li>Como voc&ecirc; usa o IDE ou Plataforma do Netbeans</li>
  <li>Um projeto desenvolvido com o IDE ou Palataforma do NetBeans<br>
  </li>
  <li>Sua melhor est&oacute;ria do NetBeans </li>
</ul>
<br>
<h3>Evento 2: Revis&atilde;o do plug-in</h3>
Visite o <a href="http://plugins.netbeans.org/">Portal do Plg-in NetBeans</a> e envie um coment&aacute;rio ou revis&atilde;o sobre seu plug-in favorito do NetBeans. Voc&ecirc; tamb&eacute;m pode deixar seu feedback <a
 href="http://forums.netbeans.org/topic3454.html">aqui</a>. <span
 style="font-style: italic;">(5 pontos)</span><br>
<br>
<h3>Evento 3: Sauda&ccedil;&atilde;o do Anivers&aacute;rio em Multim&iacute;dia</h3>
Envie um v&iacute;deo para o YouTube ou grave um podcast curto dsejeando um &quot;Feliz 10&ordm;&quot; para o projeto NetBeans. <span style="font-style: italic;">(15 pontos)</span><br>
<br>
<h3>Evento 4: Participe de uma pesquisa</h3>
Preencha uma <a
 href="http://services.netbeans.org/limesurvey/index.php?sid=23849&amp;lang=en">Pesquisa do NetBeans</a>. <span style="font-style: italic;">(10 pontos)</span><br>
<br>
<h3>Evento 5: Postar no F&oacute;rum</h3>
Participe em <a href="http://forums.netbeans.org/topic3406.html">evento de f&oacute;rum</a> dedicadado ao nosso 10&ordm; Anivers&aacute;rio. <span style="font-style: italic;">(5 pontos)</span><br>
<br>
<h3>Evento 6: Rede Social</h3>
N&oacute;s estamos no <a href="http://www.facebook.com/group.php?gid=5050136701">Facebook</a>! Junte-se ao grupo e envie uma mensagem! <span style="font-style: italic;">(5 pontos)</span><br>
<br>
<h3>Evento 7: Hora de demonstrar</h3>
Fa&ccedil;a uma demonstra&ccedil;&atilde;o do NetBeans IDE para um colega, amigo, ou melhor ainda, para uma pessoa c&eacute;tica quanto ao NetBeans! Envie um coment&aacute;rio ou v&iacute;deo ao blog sobre a experi&ecirc;ncia. <span
 style="font-style: italic;">(10 pontos)</span><br>
<br>
<h3>Evento 8: Se torne psic&oacute;tico<br>
</h3>
O que voc&ecirc; acha que o futuro reserva para o NetBeans IDE e para a comunidade? Fa&ccedil;a a reda&ccedil;&atilde;o de um artigo para o blog ou para o <a
 href="http://forums.netbeans.org/topic3416.html">F&oacute;rum do NetBeans</a>. <span style="font-style: italic;">(10 pontos)</span><br>
<br>
<h3>Evento 9: Livro de Rascunho do NetBeans</h3>
Envie uma foto relativa ao NetBeans de voc&ecirc; ou de seus amigos para nosso <a
 href="http://www.new.facebook.com/home.php#/group.php?sid=478cdcc325941c61026fd8a7c4f40ce1">&Aacute;lbum de fotos do Facebook</a>. <span style="font-style: italic;">(10 pontos)</span><br>
<br>
<h3>Evento 10: Acene para um parceiro do NetBeans </h3>
Ao longo dos anos, n&oacute;s desenvolvemos algumas grandes parcerias. Assista nossa <a href="https://netbeans.org/community/partners/index.html">cole&ccedil;&atilde;o de webinars de parceiros</a> e forne&ccedil;a seu <a
 href="http://forums.netbeans.org/topic3456.html">feedback</a>. <span
 style="font-style: italic;">(15 pontos)<br>
<br>
</span><a
 href="http://jocelyn.czech.sun.com/%7Ejp156651/deca-subscribe/"><br>
</a>
<h1><a
 href="http://services.netbeans.org/limesurvey/index.php?sid=69987&amp;lang=en">Formul&aacute;rio de Registro no Decatlon</a></h1>
<br>
</body>
</html>
