<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <link rel="stylesheet" type="text/css" href="../netbeans.css">
  <meta name="author" content="Tinuola Awopetu">
  <meta name="keywords" content="NetBeans IDE, NetBeans Platform, ">
  <title>10&ordm; Anivers&aacute;rio do NetBeans - Os Evangelistas do NetBeans Voltam a Examinar</title>
</head>
<body>
<h1>Os Evangelistas do NetBeans Voltam a Examinar </h1>
<br>
Como parte da celebra&ccedil;&atilde;o do d&eacute;cimo anivers&aacute;rio do NetBeans, n&oacute;s pedimos a alguns membros anteriores da equipe de Evagelismo do NetBeans, a voltar a examinar algumas de sua mem&oacute;rias favoritas do passado. <br>
<br>
<table style="text-align: left; width: 100%;" border="0" cellpadding="2"
 cellspacing="2">
  <tbody>
    <tr>
      <td style="vertical-align: top;">Come&ccedil;amos com Judith Lilienfeld, que era a Diretora de Evangelismo para a equipe NetBeans, e que se lembra de: &quot;A engenharia me procurou perguntando por um &quot;bom nome&quot; para seu novo IGU/Desenvolvedor de Layout. Naquela &eacute;poca Eu j&aacute; estava trabalhando a h&aacute; seis meses no NetBeans. Os engenheiros s&atilde;o como a maioria das pessoas: eles querem sua opni&atilde;o - mas somente se ela coincide com suas expectetivas. :-) Houveram centenas de e-mails trocados sobre se dever&iacute;amos nomes de artistas que provocam emo&ccedil;&otilde;es ou nomes descritivos, ou uma no&ccedil;&atilde;o mais abstrata.<br>
      <br>
&quot;Eles at&eacute; criaram uma p&aacute;gina wiki com todas as possibulidades. Eu eventualmente os convenci (ou talvez eles se cansaram de discutir comigo) que o nome deveria ser Projeto Matisse. Eu gostava de usar Matisse porque suas imagens art&iacute;sticas s&atilde;o muito flu&iacute;das e ele at&eacute; fez trabalhos de layout mais adiante em sua carreira. E antes que voc&ecirc; soubesse, todos o estavam chamado de Projeto Matisse. Ap&oacute;s issso, Eu me tornei um pouco &quot;cr&eacute;dula&quot; com a engenharia e eles me ouviam apenas oum pouco mais -- apenas um pouco! Ajuda o fato de que eles entregaram uma grande funcionalidade que fez parte do que realmente ajudou, ou seja, trazer novos &quot;usu&aacute;rios do NetBeans&quot;. <br>
      <br>
Judith &eacute; atualmente a Diretora de Evangelismo para o OpenSolaris.
      <br>
      </td>
      <td style="vertical-align: top;"><img
 src="../images_www/articles/birthday/evangelism-team.jpg"
 alt="Judith Lilienfeld e Tori Wieldt"
 style="width: 300px; height: 233px;"><br>
      <div style="text-align: center;"><span style="font-style: italic;">Judith Lilienfeld</span><span style="font-style: italic;"></span><br>
      </div>
      </td>
    </tr>
  </tbody>
</table>
&nbsp;
<table style="text-align: left; width: 100%;" border="0" cellpadding="2"
 cellspacing="2">
  <tbody>
    <tr>
      <td style="vertical-align: top;"><img
 style="width: 200px; height: 200px;" alt="Roman Strobl"
 src="../images_www/articles/birthday/roman.jpg"><br>
      <div style="text-align: center;"><span style="font-style: italic;">Roman Strobl</span><br>
      </div>
      </td>
      <td style="vertical-align: top;">O crescimento do NetBeans &eacute; sobre algo que Roman Strobl tamb&eacute;m comentou: &quot;Quando Eu come&ccedil;ei a trabalhar no NetBeans, em 2004, quase ningu&eacute;m o estava usando. Lembro-me de alguns amigos que riam de mim por usar o NetBeans, porque eles pensavam que a ferramenta era muito pior do que qualquer outro IDE no mercado. Usando o NetBeans em 2004 ou antes me fazia sentir como um desenvolvedor do submundo. <br>
      <br>
&quot;Eu at&eacute; sabia sobre diversas empresas onde os desenvolvedores usavam o NetBeans, mas eles n&atilde;o contavam aos gerentes porque estes n&atilde;o iriam aprovar o uso do NetBeans naquela &eacute;poca. Cara, as coisas mudaram ao longo destes 4 anos!
      <br>
      <br>
Hoje, as pessoas est&atilde;o excitadas em aprender sobre os novos recursos do NetBeans e a percep&ccedil;&atilde;o p&uacute;blica mudou de &quot;lento, feio e sem recursos completos&quot; para &quot;inovador, bom e r&aacute;pido&quot;. O crescimento da comunidade tem sido fant&aacute;stico - desejo um feliz anivers&aacute;rio de 10 anos ao NetBeans - o produto passou por um longo caminho, afirmou Strobl.  <br>
      <br>
Roman agora trabalha como um evangelista do OpenSolaris.</td>
    </tr>
  </tbody>
</table>
<br>
<table style="text-align: left; width: 100%;" border="0" cellpadding="2"
 cellspacing="2">
  <tbody>
    <tr>
      <td style="vertical-align: top;">A evangeliza&ccedil;&atilde;o do NetBeans com frequ&ecirc;ncia significava longas viagens a pa&iacute;ses estrangeiros. Tim Boudreau fez muitas destas viagens, e uma das mais memor&aacute;veis foi sua primeira viagem ao Brasil, que ele descreve em: &quot;Em 2005, Charlie Hunt e Eu fomos ao Brasil pela primeira vez. N&oacute;s n&atilde;o sab&iacute;amos com os eventos de &uacute;ltima hora eram l&aacute; organizados. N&oacute;s fomos informados que dar&iacute;amos uma palestra na quinta-feira e, depois dar alguma treinamento na semana seguinte. Eu me encontrei com Bruno Souza pela primeira vez antes de nossa palestra. <br>
      <br>
&quot;Eu lhe perguntei o que far&iacute;amos na semana seguinte. Ele disse: &quot;Ah, n&atilde;o o temos agendado para nada&quot;. N&oacute;s ficamos um pouco chateados, pensando, n&oacute;s voamos todo o caminho para o Brasil para dar uma palestra de meia hora?&quot; N&oacute;s consideramos voar de volta ap&oacute;s o fim de semana. Na segunda-feira de manh&atilde; fui acordado de manh&atilde; em meu quarto de hotel com o telefone tocando. Era Charlie: &quot;Voc&ecirc; n&atilde;o vai acreditar nisso. N&oacute;s estamos agendados para dar um treinamento de oito horas hoje, oito mais amanh&atilde; e oito mais na quarta-feira! N&oacute;s pecisamos estar na universisade em uma hora. <br>
      <br>
&quot;N&oacute;s n&atilde;o tinhamos nada preparado, j&aacute; que tinhamos planejado usar a sexta-feira at&eacute; domingo para nos preparar para a semana que vem, mas tinhamos suspendido ap&oacute;s descobrir que n&atilde;o est&aacute;vamos agendados para nada. Portanto, pegamos um taxi com nossos laptops para o primeiro dia de treinamento a caminho da universidade. Ent&atilde;o nos dividimos para os tr&ecirc;s pr&oacute;ximos dias - um de n&oacute;s daria aula por uma hora enquanto o outro inventava a pr&oacute;xima hora de treinamento. De fato funcionou e nos divertimos fazendo-o!&quot; Nos dias atuais, a vida de Tim &eacute; menos agitada como o L&iacute;der de Desenvolvimento para as ferramentas Java ME. <br>
      <br>
A lembran&ccedil;as de Bruno daquela viajem s&atilde;o um pouco diferentes. Ele suspeita que uma falta de comunica&ccedil;&atilde;o foi respons&aacute;vel por Tim e Charles pensarem inicialmente que nenhum evento estava agendado. Em todo caso, Bruno foi fundamental em muitos eventos, como ele lembra: &quot;Mesmo antes de me juntar &agrave; equipe do NetBeans, trabalhei junto com os Evangelistas do NetBeans em diversas viagens para visitar os Grupos de Usu&aacute;rios Java no Brasil e, sempre foi um grande sucesso com os desenvolvedores e muito divertido. <br>
      <br>
&quot;Mas, quando me juntei &agrave; equipe, n&oacute;s decidimos fazer um tour pelos pa&iacute;ses da America do Sul! N&oacute;s visitamos muitas cidades dando uma palestar de dia inteiro sobre o c&oacute;digo-fonte aberto, NetBeans e OpenSolaris, e uma vez fomos de um jogo de futebol (perdendo feio) no Uruguai e comendo toneladas de carne e depois deslizando em dunas de areia no Brasil. Durante estas duas semanas, quase n&atilde;o dormimos, e tinhamos que correr atr&aacute;s de avi&otilde;es, &ocirc;nibus e taxis, porque sempre est&aacute;vamos atrasados. <br>
      <br>
&quot;Eu tamb&eacute;m era o camera man do grupo: Eu gravei todos os detalhes de um dia particularmente ruim, o que eventualmente se tornou um v&iacute;deo engra&ccedil;ado na NetBeans.tv. Ap&oacute;s isso tudo, entrei em um avi&atilde;o e fui para a R&uacute;ssia para me encontrar com mais desenvolvedores. Foram v&aacute;rias semanas memor&aacute;veis e malucas!&quot; Bruno ainda est&aacute; ativo no mundo do c&oacute;digo-fonte aberto, trabalhando em um grupo na Sun que faz a semeadura da comunidade de c&oacute;digo-fonte aberto ao redor do mundo: &quot;ajudando as comunidades de c&oacute;digo-fonte aberto a crescer e florescer&quot;.</td>
      <td style="vertical-align: top;"><img
 style="width: 250px; height: 245px;" alt="Bruno Souza"
 src="../images_www/articles/birthday/bruno.JPG"><br>
      <div style="text-align: center;"><span style="font-style: italic;">Bruno Souza<br>
      <br>
      </span></div>
      <img style="width: 250px; height: 168px;" alt="Tim Boudreau"
 src="../images_www/articles/birthday/tim.jpg"><br>
      <div style="text-align: center;"><span style="font-style: italic;">Tim Boudreau<br>
      </span>
      <div style="text-align: left;"><span style="font-style: italic;"></span><br>
      <span style="font-style: italic;"></span></div>
      </div>
      </td>
    </tr>
  </tbody>
</table>
<br>
<table style="text-align: left; width: 100%;" border="0" cellpadding="2"
 cellspacing="2">
  <tbody>
    <tr>
      <td style="vertical-align: top;"><img
 style="width: 200px; height: 232px;" alt="David Botterill"
 src="../images_www/articles/birthday/david.jpg"><br>
      <div style="text-align: center;"><span style="font-style: italic;">David Botterill</span><br>
      </div>
      </td>
      <td style="vertical-align: top;">Todos esses esfor&ccedil;os s&atilde;o sobre uma coisa: fazer com que o mundo conhe&ccedil;a o NetBeans. Um dos projetos de destaque foi a viagem cross-country do &quot;NetBeans Mobile&quot;. Tim foi o propriet&aacute;rio, mec&acirc;nico e piloto, mas a id&eacute;ia promocional de David Bortelli, o mentalizador, que lembra: &quot;Eu me lembro quando Tim enviou uma foto de seu &quot;caminh&atilde;o&quot; que havia comprado, um velho caminh&atilde;o de venda de sorvete. Se parecia com a van que Borat dirigiu para Hollywood. Eu rapidamente abir o GIMP e coloquei um grande logotipo do NetBeans na lateral e o denominei como o 'NetBeans Mobile.' <br>
      <br>
&quot;Eu lhe disse que deveria dirigir atrav&eacute;s dos EUA e anunciar o NetBeans no caminho com uma webcam e um dispositivo GPS para rastrear sua viagem. Al&eacute;m dos logotipos nas lateriais, talvez pintar a frase &quot;Como est&aacute; meu desenvolvimento? Para coment&aacute;rios visite http://www.netbeans.org, na traseira do caminh&atilde;o. Bom, Tim abra&ccedil;ou a id&eacute;ia e Judith a aprovou. E a jornada do NetBeans Mobile acabou sendo um momento hist&oacute;rico.&quot; <br>
      <br>
David ainda est&aacute; concebendo id&eacute;ias &uacute;nicas como o Gerente T&eacute;cnico para o pograma Campus Ambassador da Sun. </td>
    </tr>
  </tbody>
</table>
&nbsp;<br>
<table style="text-align: left; width: 100%;" border="0" cellpadding="2"
 cellspacing="2">
  <tbody>
    <tr>
      <td style="vertical-align: top;"><br>
O transporte tamb&eacute;m fez parte tamb&eacute;m de uma das favoritas mem&oacute;rias de Gregg Sporar: &quot;N&oacute;s est&aacute;vamos em Praga durante a celebra&ccedil;&atilde;o do lan&ccedil;amento do NetBeans 5.5. Todos participaram de uma grande festa que se deu em uma parte da cidade com a qual n&atilde;o estava familiarizado. Eu sa&iacute; na mesma hora que Judith e outro membro de nossa equipe, Ashwin Rao. Fomos informados para peagar o bonde 26, pois o mesmo iria direto ao nosso hotel.<br>
      <br>
&quot;Fomos at&eacute; a esta&ccedil;&atilde;o de bonde e ap&oacute;s alguns minutos tivemos sorte: um n&uacute;mero 26 parou e n&oacute;s entramos. Havia uma aviso na janela do bonde que dizia algo em Tcheco, mas como nenhum de n&oacute;s podia ler o mesmo, n&atilde;o t&iacute;nhamos escolha sen&atilde;o ignor&aacute;-lo. O bonde andou por algum tempo, fazendo paradas e o n&uacute;mero de passegeiros foi se tornando menor e menor. Eventualmente, era apenas n&oacute;s tr&ecirc;s e o condutor. Ele entrou em uma parada de bonde, desligou o bonde, e se voltou para n&oacute;s e disse: &quot;Finito&quot;. <br>
      <br>
&quot;Era tarde e estava escuro e n&atilde;o sab&iacute;amos onde est&aacute;vamos. Mas estava claro que aquele bonde em particualar n&atilde;o nos i&aacute; levar de volta ao hotel. Portanto, embarcamos em um bonde indo na dire&ccedil;&atilde;o oposta. Ao passar por diferentes paradas, Eu tentava ler os nomes, e fiquei confuso pois cada parada parecia ter o mesmo nome. Ent&atilde;o descobir que estava para o aviso de &quot;N&atilde;o Fumar&quot; ao inv&eacute;s do nome da parada. N&oacute;s eventualemente descobrimos como voltar para o hotel e aprendemos a observar os avisos dos bondes que aparentemente diziam: &quot;Garagem&quot;. <br>
      <br>
Gregg ainda anda de bonde neste dias como o Evangelista de Tecnologia da equipe OpenSolaris. </td>
      <td style="vertical-align: top;"><img
 style="width: 250px; height: 244px;" alt="Gregg Sporar"
 src="../images_www/articles/birthday/gregg.png"><br>
      <div style="text-align: center;"><span style="font-style: italic;">Gregg Sporar<br>
      <br>
      </span></div>
      <img style="width: 250px; height: 188px;" alt="Ashwin Rao"
 src="../images_www/articles/birthday/ashwin.jpg"><br>
      <div style="text-align: center;"><span style="font-style: italic;">Ashwin Rao</span><br>
      </div>
      </td>
    </tr>
  </tbody>
</table>
<br>
<table style="text-align: left; width: 100%;" border="0" cellpadding="2"
 cellspacing="2">
  <tbody>
    <tr>
      <td style="vertical-align: top;"><img
 style="width: 250px; height: 167px;" alt="Brian Leonard"
 src="../images_www/articles/birthday/brian.jpg"><br>
      <div style="text-align: center;"><span style="font-style: italic;">Brian Leonard</span><br>
      </div>
      </td>
      <td style="vertical-align: top;"><br>
Todas essas est&oacute;rias tem um elemento similar: ningu&eacute;m se feriu. O mesmo n&atilde;o pode ser dito no despertar de Brian Leonard, como ele explica: <br>
      <br>
&quot;Na apresenta&ccedil;&atilde;o do NetBeans adoramos jogar camisetas para a multid&atilde;o. Tenho a tend&ecirc;ncia de enrrolar bem as camisites com el&aacute;stico para que se pare&ccedil;am com bolas de baisebol, o que me permite alcan&ccedil;ar as pessoas na parte de tr&aacute;s da sala. No entanto, elas s&atilde;o mais dif&iacute;cies de pegar, normalmente riicocheteando dos dedos antes de serem pegas. Isso &eacute; normalmente divertido (ao menos para mim) e especialmente em uma confer&ecirc;ncia na Fl&oacute;rida que tinham jarros de &aacute;gua nas mesas.
      <br>
      <br>
&quot;As pessoas estavam se molhando quando as camisetas foram em dire&ccedil;&atilde;o das jarras de &aacute;gua. Isso somente pareceu deixar a multid&atilde;o mais excitada. Tive que parar quando uma pessoa caiu da cadeira, e que aterrisou no p&eacute; da mulher atr&aacute;s dela, que estava cal&ccedil;ando sandalhas. Ap&oacute;s a apresenta&ccedil;&atilde;o, ela foi ao meu encontro para mostrar o hematoma em seu p&eacute;. Senti pena dela, mas ela parecia n&atilde;o se importar dado quanto divertimento estava tendo&quot;. <br>
      <br>
Atualmente, Brian ainda est&aacute; jogando camisetas, mas agora para o OpenSolaris.</td>
    </tr>
  </tbody>
</table>
<br>
<table
 style="text-align: left; width: 50%; margin-left: auto; margin-right: auto;"
 border="0" cellpadding="2" cellspacing="2">
  <tbody>
    <tr>
      <td style="vertical-align: top;"><img
 style="width: 600px; height: 400px;"
 alt="Evangelismo do NetBeans e a Equipe da Web"
 src="../images_www/articles/birthday/evangelism-webteam.jpg"><br>
      <span style="font-style: italic;">Evangelismo do NetBeans e a Equipe da Web circa 2006. Da esquerda: Ruth Kusterer, Jan Pirek, Jack Catchpoole, Brian Leonard, Judith Lilienfeld, Roman Strobl, Tim Boudreau, Tori Wieldt, Bruno Souza, David Botterill, Gregg Sporar e Ashwin Rao.<br>
      </span></td>
    </tr>
  </tbody>
</table>
<br>
</body>
</html>
