<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <link rel="stylesheet" type="text/css" href="../netbeans.css" media="screen">
  <meta name="author" content="Robert Demmer">
  <meta name="keywords" content="NetBeans IDE, NetBeans Platform, ">
  <title>Programa de Teste de Aceita&ccedil;&atilde;o da Comunidade NetBeans 6.5 (NetCAT)</title>
</head>
<body>
<h1>Programa de Teste de Aceita&ccedil;&atilde;o da Comunidade NetBeans 6.5 (NetCAT)</h1>

<p>O Programa de Teste de Aceita&ccedil;&atilde;o da Comunidade NetBeans (NetCAT), &eacute; uma iniciativa de testes que normalmente come&ccedil;a com a vers&atilde;o beta e dura at&eacute; a primeiro build de vers&atilde;o candidata. Isso dura 3 meses em m&eacute;dia. A id&eacute;ia b&aacute;sica &eacute; a de que um grupo de 60 volunt&aacute;rios da Comunidade NetBeans esteja usando builds de desenvolvimento di&aacute;rios e compartilhe suas descobertas com os desenvolvedores do NetBeans at&eacute; a fase de estabiliza&ccedil;&atilde;o e at&eacute; que Crit&eacute;rios de Qualidade predefinidos sejam alcan&ccedil;ados. 
</p>
<p>A avalia&ccedil;&atilde;o em tempo e o teste de novos recursos em projetos reais com dados reais tem significativo impacto na estabilidade geral do produto final. &Eacute; de fato uma solu&ccedil;&atilde;o vencedora, porque os desenvovedores do NetBeans passam a conhecer os defeitos s&eacute;rios cedo o suficiente para corrigi-los e para que os usu&aacute;rios finais obtenham um IDE maduro. Desde sua concep&ccedil;&atilde;o em 2004, o NetCAT tem ganho muito reconhecimento e se tornou bastante popular e &eacute; um projeto respeitado entre a Engenharia do NetBeans e a Comunidade do NetBeans. 
</p>
<ul>
<li><p><a href="http://qa.netbeans.org/processes/cat/65/index.html">NetCAT 6.5</a> - Em andamento.</p> 
</ul>
<p>
Voc&ecirc; gostaria de fornecer seu feedback sobre a qualidade da vers&atilde;o NetBeans IDE 6.5? Caso j&aacute; tenha testato o build da <a href="https://netbeans.org/community/releases/65/">Vers&atilde;o candidata</a> mais recente, siga o link abaixo para nos informar qual sua opini&atilde;o sobre o mesmo! A pesquisa estar&aacute; aberta at&eacute; 05 de Novembro. <a href="http://qa.netbeans.org/processes/cat/65/ca_survey.html">Participar da pesquisa de aceita&ccedil;&atilde;o da Comunidade NetBeans 6.5</a>.
</p><p>

<ul>
<li><a href="http://qa.netbeans.org/processes/cat/60/index.html">NetCAT 6.0</a> - <a href="http://qa.netbeans.org/processes/cat/60/participants.html">Todos os participantes</a> <strong>Participantes principais</strong> - Jacek Laskowski, Anuradha Gunasekara, Daniel Sheppard, Tetsu Soh
<p />

<li><a href="http://qa.netbeans.org/processes/cat/55/index.html">NetCAT 5.5</a> - N&atilde;o houve um programa formal para o NetCAT 5.5 <strong>Participantes principais</strong> - Edson Richter, Halim Salameh, Mario Perez
<p />

<li><a href="http://qa.netbeans.org/processes/cat/50/index.html">NetCAT 5.0</a> - <a href="http://qa.netbeans.org/processes/cat/50/participants.html">Todos os participantes</a> <strong>Participantes principais</strong> - Michael Nascimento Santos, Holger Stenzhorn, Byran E. Boone
<p />

<li><a href="http://qa.netbeans.org/processes/cat/41/index.html">NetCAT 4.1</a> - <a href="http://qa.netbeans.org/processes/cat/41/participants.html">Todos os participantes</a> <strong>Participantes principais</strong> - John Zoetebier, Cedric Berger, Glenn Holmer
<p />

<li><a href="http://qa.netbeans.org/processes/cat/40/index.html">NetCAT 4.0</a> - <a href="http://qa.netbeans.org/processes/cat/40/participants.html">Todos os participantes</a> <strong>Participantes principais</strong> - Jason Donmoyer, Lluis Turro, Simone Graf
<p />

<li><a href="http://qa.netbeans.org/processes/cat/36/index.html">NetCAT 3.6</a> - <a href="http://qa.netbeans.org/processes/cat/36/index.html">Todos os participantes</a> <strong>Participantes principais</strong> - Lluis Turro, Glenn Holmer, Markus Svensson
</ul>

</body>
</html>
