<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <link rel="stylesheet" type="text/css" href="../netbeans.css">
  <meta name="author" content="Tinuola Awopetu">
  <meta name="keywords" content="NetBeans IDE, NetBeans Platform, ">
  <title>Projetos Companheiros do NetBeans </title>
</head>
<body>
<h1>Projetos Companheiros do NetBeans <br>
</h1>
<br>
Ao longo dos anos, o projeto NetBeans trabalhou de perto com outros projetos e comunidades de projetos de c&oacute;digo-fonte aberto. Aprende sobre algumas destas parcerias e os benef&iacute;cios de nossa colabora&ccedil;&atilde;o para os desenvolvedores que planejam levar seus projetos para o pr&oacute;ximo n&iacute;vel.<br>
<br>
<h2><a name="glassfish">GlassFish</a></h2>
<table style="text-align: left; width: 100%;" border="0" cellpadding="2"
 cellspacing="2">
  <tbody>
    <tr>
      <td style="vertical-align: top;"><a
 href="https://glassfish.dev.java.net/"><img alt="Logotipo do Glassfish"
 src="../images_www/articles/birthday/glassfish-logo.gif"
 style="border: 0px solid ; width: 107px; height: 86px; margin-left:36;margin-right:37"></a><br>
      </td>
      <td style="vertical-align: top;">
      <p><strong></strong>O GlassFish &eacute; o servidor de aplicativo de c&oacute;digo-fonte aberto da Sun. Sua vers&atilde;o atual, GlassFish v3, foi reescrita para que seja modular, de peso leve e extens&iacute;vel. Ele foi desenvolvido sobre o OSGi e suporta o Java EE 6. N&atilde;o somente aplicativos da Web Java podem ser implementados no mesmo: O Ruby e Groovy tamb&eacute;m s&atilde;o suportados. O NetBeans IDE suporta o GlassFish. Quando voc&ecirc; cria um novo aplicativo Web Java, pode especificar que deseja que seja implementado no GlassFish. Voc&ecirc; tamb&eacute;m pode ver os aplicativos implementados no GlassFish e os implementar atrav&eacute;s do IDE.</p>
      </td>
    </tr>
  </tbody>
</table>
<br>
<h2><a name="mysql"></a>MySQL</h2>
<table style="text-align: left; width: 100%;" border="0" cellpadding="2"
 cellspacing="2">
  <tbody>
    <tr>
      <td style="vertical-align: top;"><a href="http://dev.mysql.com/"><span
 style="text-decoration: underline;"><img alt="MySQL"
 src="../images_www/articles/birthday/mysql-logo.png"
 style="border: 0px solid ; width: 180px; height: 92px;"></span></a><br>
      </td>
      <td style="vertical-align: top;">
      <p><strong></strong>O banco de dados MySQL se tornou o banco de dados de c&oacute;digo-fonte aberto mais popular do mundo, por causa de seu desempenho r&aacute;pido e consistente, alta confiabilidade e facilidade de uso. Ele &eacute; usado em cada continente por desenvolvedores individuais da Web, assim como por muitas das maiores organiza&ccedil;&otilde;es de crescimento r&aacute;pido no mundo, para economizar tempo e dinheiro, dando poder para seus sites da Web de alto volume, sistemas comerciais cr&iacute;tico e software empacotado. O NetBeans IDE simplifica a cria&ccedil;&atilde;o de aplicativos que se conectam ao banco de dados MySQL, e permite criar, visualizar e alterar bancos de dados MySQL atrav&eacute;s do IDE.<br>
      </p>
      </td>
    </tr>
  </tbody>
</table>
<h2><a name="opensolaris"></a>OpenSolaris</h2>
<table style="text-align: left; width: 100%;" border="0" cellpadding="2"
 cellspacing="2">
  <tbody>
    <tr>
      <td style="vertical-align: top;"><a
 href="http://opensolaris.org/os/"><span
 style="text-decoration: underline;"><img alt="OpenSolaris"
 src="../images_www/articles/birthday/opensolaris-logo.png"
 style="border: 0px solid ; width: 180px; height: 43px;"></span></a><br>
      </td>
      <td style="vertical-align: top;">
      <p><strong></strong>O OpenSolaris &eacute; um sistema operacional (SO), um projeto de c&oacute;digo-fonte aberto licenciado sob a CDDL, e uma comunidade. O OpenSolaris &eacute; gr&aacute;tis e bem adequado para desktops, laptops, servidores e centros de dados. O OpenSolaris tem recursos especiais que o distingue de outros sistemas operacionais. Por exemplo, ele inclui o DTrace, um utilit&aacute;rio que permite que os usu&aacute;rios e administradores examinem os aspectos internos do sistema operacional e modificar de forma din&acirc;mica seu kernel. Com o suporte para este recurso, o NetBeans IDE fornece uma interface de usu&aacute;rio gr&aacute;fica sob o DTrace, para que os usu&aacute;rios do NetBeans no OpenSolaris possam visualizar com facilidade a sa&iacute;da do DTrace.<br>
      </p>
      </td>
    </tr>
  </tbody>
</table>
<h2><a name="openjdk"></a>OpenJDK</h2>
<table style="text-align: left; width: 100%;" border="0" cellpadding="2"
 cellspacing="2">
  <tbody>
    <tr>
      <td style="vertical-align: top;"><a
 href="http://openjdk.java.net/"><span
 style="text-decoration: underline;"><img alt="OpenJDK"
 src="../images_www/articles/birthday/openjdk-logo.png"
 style="border: 0px solid ; width: 180px; height: 49px;"></span></a><br>
      </td>
      <td style="vertical-align: top;">
      <p><strong></strong>A Sun Microsystems estabeleceu a Comunidade OpenJDK para o desenvolvimento cont&iacute;nuo da implementa&ccedil;&atilde;o de c&oacute;digo-fonte aberto do Java SE da Sun. A Comunidade OpenJDK &eacute; onde os desenvolvedores se juntam para colaborar na base do c&oacute;digo-fonte aberto JDK e em projetos relacionados. Os Projetos OpenJDK 6 e 7 onde vive, a base do c&oacute;digo-fonte aberto fazem parte da comunidade. Atrav&eacute;s dos Projetos OpenJDK, os desenvolvedores podem influenciar diretamente o futuro da implementa&ccedil;&atilde;o JDK, participar com seus pares em uma comunidade aberta e a ajudar a levar a tecnologia Java para onde ainda n&atilde;o esteve antes. O OpenJDK &eacute; tornado dispon&iacute;vel como projetos NetBeans. Ap&oacute;s baix&aacute;-los, voc&ecirc; pode simplesmente abri-los em um IDE e trabalhar com eles da mesma forma que faria com outro projeto.</p>
      </td>
    </tr>
  </tbody>
</table>
<h2><a name="openoffice">OpenOffice</a><br>
</h2>
<table style="text-align: left; width: 100%;" border="0" cellpadding="2"
 cellspacing="2">
  <tbody>
    <tr>
      <td style="vertical-align: top;"><span
 style="text-decoration: underline;"><a
 href="http://www.openoffice.org/"><img alt="OpenOffice"
 src="../images_www/articles/birthday/openoffice-logo.png"
 style="border: 0px solid ; width: 180px; height: 54px;"></a></span><br>
      </td>
      <td style="vertical-align: top;"> O OpenOffice.org &eacute; o conjunto de software de c&oacute;digo fonte aberto para escrit&oacute;rio l&iacute;der para processamento de palavra, planilhas, apresenta&ccedil;&otilde;es, bancos de dados, e mais. Ele est&aacute; dispon&iacute;vel em muitos idiomas e funciona em todos os computadores comuns. Ele armazena seus dados em um formato padr&atilde;o interno e tamb&eacute;m pode ler e gravar arquivos de outros pacotes comuns de software para escrit&oacute;rio. Ele pode ser baixado e usado completamente de gra&ccedil;a para qualquer prop&oacute;sito. Mais ainda, voc&ecirc; pode usar o plug-in API do OpenOffice.org API para o NetBeans IDE para simplificar o desenvolvimento de extens&otilde;es e aplicativos cliente do OpenOffice. <br>
      </td>
    </tr>
  </tbody>
</table>
<h2><a name="virtualbox"></a>VirtualBox<br>
</h2>
<table style="text-align: left; width: 100%;" border="0" cellpadding="2"
 cellspacing="2">
  <tbody>
    <tr>
      <td style="vertical-align: top;"><a
 href="http://www.virtualbox.org/"><img alt="VirtualBox"
 src="../images_www/articles/birthday/virtual-box.png"
 style="border: 0px solid ; width: 130px; height: 134px; margin-left:25;margin-right:25"></a><br>
      </td>
      <td style="vertical-align: top;">
      <p><strong></strong>O VirtualBox &eacute; uma fam&iacute;lia de poderosos produtos de virtualiza&ccedil;&atilde;o x86 para corpora&ccedil;&otilde;es e para uso dom&eacute;stico. O VirtualBox tem recursos extremamente ricos, &eacute; um produto de alto desempenho para clientes corporativos, mas tamb&eacute;m &eacute; uma solu&ccedil;&atilde;o profissional que &eacute; livremente gr&aacute;tis como um Software de C&oacute;digo- fonte Aberto sob os termos da Licen&ccedil;a P&uacute;blica Geral GNU(GPL). O VirtualBox est&aacute; sendo ativamente desenvolvido com frequentes vers&otilde;es e tem uma crescente lista de recursos, sistemas operacionais convidados suportados e uma plataforma na qual &eacute; executado.<br>
      </p>
      </td>
    </tr>
  </tbody>
</table>
</body>
</html>
