<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta http-equiv="Content-Type"
 content="text/html; charset=UTF-8">
  <link rel="stylesheet" type="text/css" href="../../netbeans.css"
 media="screen">
  <meta name="Tinuola Awopetu"
 content="NetBeans IDE, NetBeans 6.5, NetBeans Download, NetBeans Refer-a-Friend Promotion">
  <title>Promo&ccedil;&atilde;o NetBeans Indique um Amigo</title>
</head>
<body>
<h1>Promo&ccedil;&atilde;o NetBeans Indique um Amigo</h1>
<div style="text-align: center;">
<div style="text-align: left;"><br>
</div>
<font color="#000000"><font size="3"><b>PERGUNTAS FREQUENTES</b></font></font><br>
</div>
<br>
<br>
<a href="#one">O que &eacute; a Promo&ccedil;&atilde;o NetBeans Indique um Amigo?</a><br>
<a href="#two">O que recebo por indicar amigos para que fa&ccedil;am o download do NetBeans/</a><br>
<a href="#three">Como participo da Pormo&ccedil;&atilde;o do NetBeans Indique um Amigo</a><br>
<a href="#four">Quantos amigos posso indicar?</a><br>
<a href="#five">Posso indicar meus amigos sem usar o formul&aacute;rio de registro e apenas indic&aacute;-los a p&aacute;gina de download do NetBeans?</a><br>
<a href="#six">N&atilde;o vejo o link de download &uacute;nico no modelo de e-mail. Posso apenas copiar e colar o URL regular do NetBeans?</a><br>
<a href="#seven">Inseri o endere&ccedil;o de e-mail de meu amigo no formul&aacute;rio de registro, mas este foi rejeitado.</a><br>
<a href="#elig">Quem em meu pa&iacute;s &eacute; leg&iacute;vel para participar?</a><br>
<a href="#filter">Porque meus amigos nunca receberam o convite?</a><br>
<a href="#eight">Como posso saber se meus amigos baixaram o NetBeans IDE?</a><br>
<a href="#nine">Quanto amigos precisam baixar o NetBeans IDE antes que Eu me qualifico para o presente?</a><br>
<a href="#ten">Como recebo meu presente?</a><br>
<a href="#eleven">Posso entrar na promo&ccedil;&atilde;o mais de uma vez?</a><br>
<a href="#twelve">Posso obter um presente extra se mais que tr&ecirc;s amigos baixem o NetBeans IDE?</a>
<br>
<br>
<ol>
  <li>
    <h4><a name="one">O que &eacute; a Promo&ccedil;&atilde;o NetBeans Indique um Amigo?</a></h4>
A Promo&ccedil;&atilde;o NetBeans Indique um Amigo &eacute; um programa para premiar os usu&aacute;rios do NetBeans que venham a recomendar o NetBeans ao sues amigos e encoraj&aacute;-los a baixar o IDE. </li>
  <li>
    <h4><a name="two">O que recebo por indicar amigos para que fa&ccedil;am o download do NetBeans?</a></h4>
Ao ter &ecirc;xito que esses tr&ecirc;s amigos ou mais fa&ccedil;am o download do NetBeans IDE, voc&ecirc; receber&aacute; um presente: um pendrive USB de 2GB pr&eacute;-carregado com documenta&ccedil;&atilde;o e v&iacute;deos selecionados do NetBenas, uma OpenOffice e um conjunto de produtividade gr&aacute;tis. </li>
  <li>
    <h4><a name="three">Como participo da Pormo&ccedil;&atilde;o do NetBeans Indique um Amigo</a></h4>
&Eacute; f&aacute;cil. Visite a <a href="index.html">p&aacute;gina Promo&ccedil;&atilde;o NetBeans Indique um Amigo</a> e preencha o formul&aacute;rio de registro. Este formul&aacute;rio cont&eacute;m campos para os endere&ccedil;os de e-mail de seus amigos e um e-mail de convite que voc&ecirc; pode personalizar.</li>
  <li>
    <h4><a name="four">Quantos amigos posso indicar?</a></h4>
Voc&ecirc; precisa indicar um m&iacute;nimo de tr&ecirc;s amigos que n&atilde;o tenham sido indicados por outros participantes na promo&ccedil;&atilde;o.<br>
  </li>
  <li>
    <h4><a name="five">Posso indicar meus amigos sem usar o formul&aacute;rio de registro e apenas indic&aacute;-los a p&aacute;gina de download do NetBeans?</a></h4>
N&atilde;o. &Eacute; preciso usar o formul&aacute;rio de registro da promo&ccedil;&atilde;o e o e-mail de convite. O e-mail de convite cont&eacute;m um link de download &uacute;nico para que seus amigos utilizem. O link nos permite verificar se seus amigos efetuaram o download do Netbeans IDE, portanto, para podermos dar-lhe cr&eacute;dito para receber seu presente.</li>
  <li>
    <h4><a name="six">N&atilde;o vejo o link de download &uacute;nico no modelo de e-mail. Posso apenas copiar e colar o URL regular do NetBeans?</a></h4>
N&atilde;o, n&atilde;o inclua nenhum outro link de download no e-mail de convite. O link de downaload &uacute;nico n&atilde;o lhe &eacute; vis&iacute;vel, mas &eacute; automaticamente inserido no corpo da mensagem por e-mail quando voc&ecirc; envia o formul&aacute;rio de registro e o convite for enviado.<br>
  </li>
  <li>
    <h4><a name="elig">Quem em meu pa&iacute;s &eacute; leg&iacute;vel para participar?</a></h4>
A lista dos pa&iacute;ses eleg&iacute;veis est&aacute; limitada as leis locais do pa&iacute;s que permitam tais competi&ccedil;&otilde;es.<br>
  </li>
  <li>
    <h4><a name="filter">Porque meus amigos nunca receberam o convite?</a></h4>
&Eacute; poss&iacute;vel que o endere&ccedil;o de e-mail est&aacute; incorreto ou uma ferramenta de preven&ccedil;&atilde;o de spam pegou a mensagem. Pe&ccedil;a que verifiquem suas pastas de spam. Caso tenham um sisteme de desafio-resposta ativado que espera por uma resposta por voz, n&atilde;o ser&atilde;o capazes de receber o convite. <br>
  </li>
  <li>
    <h4><a name="seven">Inseri o endere&ccedil;o de e-mail de meu amigo no formul&aacute;rio de registro, mas este foi rejeitado.</a></h4>
H&aacute; duas raz&otilde;es poss&iacute;veis para que isso tenha acontecido: 1) O endere&ccedil;o de e-mail de seu amigo est&aacute; em nossa lista de <span style="font-style: italic;">N&atilde;o contatar</span>, ou seja ele/ela em algum momento decidiu optar por n&atilde;o receber notifica&ccedil;&otilde;es por e-mail do NetBeans. 2) O endere&ccedil;o de e-mail de seu amigo j&aacute; foi usado por outro participante na promo&ccedil;&atilde;o.<br>
  </li>
  <li>
    <h4><a name="eight">Como posso saber se meus amigos baixaram o NetBeans IDE?</a></h4>
N&oacute;s iremos lhe enviar um alerta por e-mail sempre que seus amigos indicados baixem o NetBeans IDE. Lembre-se: o e-mail de convite que voc&ecirc; envia ao se registrar para a promo&ccedil;&atilde;o cont&eacute;m um link de download &uacute;nico que seus amigos PRECISAM usar para baixar o NetBeans IDE. Essa &eacute; a &uacute;nica forma pela qual podemos lhe dar cr&eacute;dito para receber seu presente.<br>
  </li>
  <li>
    <h4><a name="nine">Quanto amigos precisam baixar o NetBeans IDE antes que Eu me qualifico para o presente?</a> </h4>
Ao menos tr&ecirc;s de seus amigos precisam baixar o NetBeans IDE para que voc&ecirc; se qualifique para o presente. <br>
  </li>
  <li>
    <h4><a name="ten">Como recebo meu presente?</a></h4>
N&oacute;s iremos entrar em contato consigo e verificaremos suas informa&ccedil;&otilde;es de postagem ap&oacute;s que tr&ecirc;s de seus amigos tenham baixado o NetBeans IDE. Ap&oacute;s o processo de verifica&ccedil;&atilde;o, levar&aacute; outras 4 a 6 semanas para que voc&ecirc; receba seu presente. Seja paciente.<br>
  </li>
  <li>
    <h4><a name="eleven">Posso entrar na promo&ccedil;&atilde;o mais de uma vez?</a></h4>
N&atilde;o. Voc&ecirc; somente pode participar da promo&ccedil;&atilde;o uma vez.<br>
  </li>
  <li>
    <h4><a name="twelve">Posso obter um presente extra se mais que tr&ecirc;s amigos baixem o NetBeans IDE?</a></h4>
N&atilde;o. Voc&ecirc; somente pode receber um presente por tr&ecirc;s ou mais indica&ccedil;&otilde;es com &ecirc;xito para baixar o NetBeans IDE.</li>
</ol>
<br>
<a href="index.html">P&aacute;gina Promo&ccedil;&atilde;o NetBeans Indique um Amigo</a><br>
<a href="legal.html">Regras da Promo&ccedil;&atilde;o NetBeans Indique um Amigo</a><br>
<br>
</body>
</html>
