<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta http-equiv="Content-Type"
 content="text/html; charset=UTF-8">
  <link rel="stylesheet" type="text/css"
 href="https://netbeans.org/netbeans.css" media="screen">
  <meta name="screen" content="Why GPL v2 Frequently Asked Questions">
  <title>Perguntas Frequentes sobre o Porque do GPL v2</title>
</head>
<body>
<h1>Perguntas Frequentes sobre o Porque do GPL v2</h1>
<br>
<p style="font-weight: bold;">1. Qual altera&ccedil;&atilde;o da licen&ccedil;a est&aacute; sendo proposta?</p>
<blockquote>
  <p>A Sun prop&otilde;e lan&ccedil;ar o GPLv2 com exce&ccedil;&atilde;o Classpath para o software NetBeans como uma segunda op&ccedil;&atilde;o de licen&ccedil;a junto com o CDDL. O GPL v2 &eacute; uma licen&ccedil;a de c&oacute;digo-fonte aberto. Consulte <a
 href="http://opensource.org/licenses/gpl-license.php">http://opensource.org/licenses/gpl-license.php</a> para obter o texto da licen&ccedil;a.</p>
</blockquote>
<p style="font-weight: bold;">2. Porque a Sun deja uma licen&ccedil;a dupla para o software NetBeans sob o CDDL e o GPLv2 com exce&ccedil;&atilde;o Classpath?</p>
<blockquote>
  <p>A licen&ccedil;a GPL v2 ir&aacute; fornecer uma op&ccedil;&atilde;o adicional para fornecedores que n&atilde;o s&atilde;o capazes de trabalhar com o software NetBeans sob a licen&ccedil;a CDDL.</p>
  <p>A adi&ccedil;&atilde;o da GPLv2 como uma op&ccedil;&atilde;o de licen&ccedil;a ir&aacute; tornar o software NetBeans ainda mais amig&aacute;vel ao Linux.</p>
  <p>A adi&ccedil;&atilde;o da GPLv2 com exce&ccedil;&atilde;o Classpath para o software NetBeans ir&aacute; manter os portf&oacute;lios e conjuntos de produtos mais consistentes. A Sun abriu o c&oacute;digo-fonte aberto de usa implementa&ccedil;&atilde;o JDK sob a GPLv2 e o projeto GlassFish tem licen&ccedil;a dupla sob o CDDL e a GPLv2 com exce&ccedil;&atilde;o Classpath.</p>
</blockquote>
<p style="font-weight: bold;">3. O que &eacute; a exce&ccedil;&atilde;o Classpath?</p>
<blockquote>
  <p>A exce&ccedil;&atilde;o Classpath foi desenvolvida pela Free Software Foundation's GNU/Classpath Project (consulte <a href="http://www.gnu.org/software/classpath/license.html">http://www.gnu.org/software/classpath/license.html</a>). Ela permite vincular um aplicativo dispon&iacute;vel sob qualquer licen&ccedil;a com uma biblioteca que fa&ccedil;a parte do software licencidado sob a GPL v2, sem que aquele aplicativo esteja sujeito ao resquistos da GPL, para que ele possa ser oferecido ao p&uacute;blico sob a GPL.</p>
</blockquote>
<p style="font-weight: bold;">4. Porque a exce&ccedil;&atilde;o Classpath &eacute; necess&aacute;ria?</p>
<blockquote>
  <p>Se um aplicativo precisa ser distribu&iacute;do com partes do software NetBeans sob a GPL v2, aquele aplicativo poderia estar sujeito aos requisitos da GPL de que todo o c&oacute;digo fornecido como parte de uma &quot;trabalho com base no programa [GPL]&quot;, tamb&eacute;m tem de ser icenciado sob a GPL. De acordo, uma exce&ccedil;&atilde;o da licen&ccedil;a GPL &eacute; nececess&aacute;ria para especificamente excluir deste requisito de licen&ccedil;a qualquer aplicativo que o vincule com a implementa&ccedil;&atilde;o GPL. Uma exce&ccedil;&atilde;o Classpath realiza isso. Isso seria, por exemplo, importante para desenvolvedores de m&oacute;dulos, que sempre est&atilde;o vinculando com APIs do NetBeans, mas tamb&eacute;m para os que desenvolvem aplicativos no topo da Plataforma NetBeans.</p>
</blockquote>
<p style="font-weight: bold;">5. Como a adi&ccedil;&atilde;o daGPL v2 afeta distribui&ccedil;&otilde;es atuais?</p>
<blockquote>
  <p>Ela n&atilde;o ir&aacute; afetar as distribui&ccedil;&otilde;es atuais. Distribui&ccedil;&otilde;es atuais e futuras ainda estar&atilde;o dispon&iacute;veis sob a CDDL. Novas distribui&ccedil;&otilde;es, come&ccedil;ando da vers&atilde;o NetBeans 6.0, estar&atilde;o dispon&iacute;veis sob a CDDL e a GPLv2 com exce&ccedil;&atilde;o Classpath.</p>
</blockquote>
<p style="font-weight: bold;">6. Como posso fazer algo ser liberado sob duas licen&ccedil;as?</p>
<blockquote>
  <p>A licen&ccedil;a dupla &eacute; a pr&aacute;tica de distribuir software id&ecirc;ntico sob dois (ou mais) conjuntos difrerentes de termos e condi&ccedil;&otilde;es. Quando o software tem licen&ccedil;a dupla, os destinat&aacute;rios podem escolher quais termos sob os quais desejam obter o software. As duas motiva&ccedil;&otilde;es usuais para o licenciamento duplo s&atilde;o os modelos administrativos e a compatibilidade de licen&ccedil;a.</p>
  <p>No caso do software NetBeans, n&oacute;s estamos distribuindo o c&oacute;digo sob duas licen&ccedil;as, CDDL e GPL v2 com exce&ccedil;&atilde;o Classpath, para compatibilidade de licen&ccedil;a. Isso permitir&aacute; que o c&oacute;digo de diferentes de projetos de software gr&aacute;tis licenciado sejam combinados com o software NetBeans, e dar&aacute; aos nossos usu&aacute;rios a escolha de uma licen&ccedil;a com a qual se sintam mais confort&aacute;veis. A Sun est&aacute; adicionando a GPLv2 como a op&ccedil;&atilde;o, j&aacute; que por uma quest&atilde;o de pol&iacute;tica, a Sun nunca retira direitos, portanto, o c&oacute;digo NetBeans continuar&aacute; a estar dispon&iacute;vel sob a licen&ccedil;a CDDL.</p>
</blockquote>
<br>
<br>
</body>
</html>
