<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
           
 
<head>
<link rel="stylesheet" type="text/css" href="https://netbeans.org/netbeans.css">
 
<title>Mir&euml; se vini n&euml; NetBeans dhe www.netbeans.org, Sht&euml;pia e Java IDE-s me Kod t&euml; hapur</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" >
<meta http-equiv="Content-Style-Type" content="text/css" >
<meta NAME="description" CONTENT="Mir&euml; se vini, nj&euml; hyrje n&euml; NetBeans, n&euml; Anglisht/Frengjisht/Shqip/gjuha-juaj-k&euml;tu!">
<meta http-equiv="content-language" CONTENT="sq">
<meta name="keywords" content="java IDE, java redaktor, java Platforma, falas, kod t&euml; hapur, java zhvillimi , j2ee p&euml;rkrahja, hap&euml;sir&euml; zhvillimi, ueb zhvillimi, NetBeans, IDE, java" >
</head>
 
 
<body>
     
<h1>Mir&euml; se vini n&euml; NetBeans dhe www.netbeans.org</h1>

P&euml;rsh&euml;ndetje dhe mir&euml; se vini n&euml; sht&euml;pin&euml; NetBeans-it, Java IDE me kod t&euml; hapur.

<h3>&Ccedil;far&euml; &euml;sht&euml; NetBeans?</h3>
NetBeans &euml;sht&euml; nj&euml; projekt i suksessh&euml;m me nj&euml; baz&euml; t&euml; shfryt&euml;zuesve shum&euml; t&euml; madhe,
nj&euml; komunitet n&euml; rritje, dhe gati 100 (dhe vazhdon!) partner&euml; n&euml; t&euml;r&euml; bot&euml;n. 
Sun Microsystems krijoi projektin me kod t&euml; hapur NetBean n&euml; Qershor 2000 dhe vazhdon t&euml; jet&euml; 
sponzor kryesor i projektit.

<p>Sot ekzistojn&euml; dy produkte: NetBeans IDE dhe NetBeans Platforma.

<p><a href="https://netbeans.org/features/ide/index.html">NetBeans IDE</a>
&euml;sht&euml; nj&euml; hap&euml;sir&euml; e zhvillimit - nj&euml; mjet p&euml;r programer&euml;t q&euml; t&euml; shkruajnl,
kompilojn&euml;, zhgabimojn&euml; dhe t&euml; plasojn&euml; programe.  &Euml;sht&euml; shkruar n&euml; Java - por mund t&euml;
p&euml;rkrah &ccedil;do gjuh&euml; programuese.  Ekziston nj&euml; num&euml;r i madh i moduleve q&euml; e zgjerojn&euml; NetBeans IDE-n.  
NetBeans IDE &euml;sht&euml; produkt falas
pa ndonj&euml; ndales&euml; n&euml; se si t&euml; p&euml;rdoret ai.

<p>
Gjithashtu &euml;sht&euml; e gatshme 
 <a href="https://netbeans.org/features/platform/index.html">NetBeans Platforma</a>;
nj&euml; bazament modular dhe i zgjeruesh&euml;m q&euml; p&euml;rdoret si nj&euml; plan prapavije i softuerit p&euml;r t&euml; krijuar
aplikacione t&euml; m&euml;dha.  ISV partner&euml;t ofrojn&euml; shtojca me vlera t&euml; shtuara q&euml; leht&euml; integrohen n&euml; Plat&euml;form&euml; dhe
mund t&euml; zhvillojn&euml; mjete dhe solucione t&euml; tyre.</p>

<P>
T&euml; dy produkte jan&euml; me kod t&euml; hapur dhe falas p&euml;r p&euml;rdorim komercial ose jo-komercial.
Kodi burimor &euml;sht&euml; i gatshme p&euml;r rip&euml;rdorim n&euml;n 
<a href="https://netbeans.org/cddl.html">
Licenca e Shp&euml;rndarjes dhe Zhvillimit t&euml; P&euml;rbashkt&euml;</a> (CDDL).</p>

<h3>&Ccedil;far&euml; &euml;sht&euml; netbeans.org?</h3>
netbeans.org &euml;sht&euml; sht&euml;pia e NetBeans komunitetit me kod t&euml; hapur jan&euml; t&euml;
dedikuar t&euml; nd&euml;rtojn&euml; nj&euml; IDE t&euml; klas&euml;s bot&euml;rore. netbeans.org ju lejon 
shfryt&euml;zuesve nga mbi 160 vende rreth e p&euml;rqark bot&euml;s q&euml; t&euml; jen&euml; n&euml;
 kontakt me resurset the njer&euml;zit p&euml;rreth NetBeans-it. K&euml;tu ju mund t&euml; shkarkoni
 versionet e fundit t&euml; NetBeans-it, t&euml; ndjekni lajme, t&euml; bashk&euml;ngjiteni listave t&euml;
 postimeve, kontribuoni kod, m&euml;soni p&euml;r njer&euml;zit t&euml; ky&ccedil;ur n&euml; k&euml;t&euml; projekt,
 b&euml;ni kontakte, si dhe m&euml; tep&euml;r.

<h3>Bashk&euml;ngjitja n&euml; Komunitetin e NetBeans-it</h3>
B&euml;huni pjes&euml; e ekipit t&euml; NetBeans-it dhe ndihmo q&euml; NetBeans t&euml; b&euml;het edhe m&euml; i mir&euml;.
P&euml;rmes regjistrimin ju do t&euml; kontribuoni drejtp&euml;rs&euml;drejti n&euml; suksesin e NetBeans-it dhe si p&euml;r 
kthim ju do t&euml; jeni t&euml; informuar p&euml;r lajmet e fundit q&euml; kan&euml; t&euml; b&euml;jn&euml; me projektin e NetBeans-it.
P&euml;rdor kutin&euml; e regjistrimin n&euml; t&euml; djatht&euml;n e lart&euml; t&euml; k&euml;saj faqe - p&euml;rzgjedh nj&euml; nofk&euml; dhe bashk&euml;ngjitu!

<h3>T&euml; q&euml;ndruarit t&euml; informuar</h3>

<p>NetBeans ofron nj&euml; varietet n&euml; listat e postimeve p&euml;r t&euml; akomoduar nivelin e intersit tuaj
dhe t&euml; leht&euml;soj komunikim nd&euml;rmjet NetBeans shfryt&euml;zuesve.
Shiko faqen e NetBeans listave t&euml; postimeve n&euml; 
<a href="https://netbeans.org/community/lists/index.html">https://netbeans.org/community/lists/index.html</a>
p&euml;r t&euml; gjatur m&euml; tep&euml;r p&euml;r NetBeans listat e postimeve.

<p>Vjeg&euml;zat e shpejta :

<UL>
<LI>NetBeans lajmletrat javore dhe mujore:
<A HREF="mailto:nbannounce-subscribe@netbeans.org">Abonohu</A> n&euml; nbannounce
(<A HREF="https://netbeans.org/community/lists/top.html">m&euml; tep&euml;r info</A>)

<P><LI>T&euml; flasim me NB shfryt&euml;zuesit tjer&euml;, shk&euml;mbe k&euml;shillat dhe truqet:
<A HREF="mailto:nbusers-subscribe@netbeans.org">Abonohu</A> n&euml; nbusers
(<A HREF="https://netbeans.org/community/lists/top.html">m&euml; tep&euml;r info</A>)
</UL>

<P><HR SIZE="1" NOSHADE>

<h3>Shkarko NetBeans-in!</h3>
Shkarko versionin e fundit t&euml;<A HREF="/downloads/">NetBeans IDE-s</A>.

</body>
</html>
