<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<HTML>
<HEAD>
<title>Tervetuloa NetBeans-sivustoon www.netbeans.org, avoimeen l&auml;hdekoodiin perustuvan Java-sovelluskehittimen kotisivuille</title>
<meta NAME="description" CONTENT="Welcome, and Introduction to NetBeans, in Finnish!">
<META HTTP-EQUIV="content-type" CONTENT="text/html; charset=utf-8">
<meta http-equiv="content-language" CONTENT="fi">
<link REL="STYLESHEET" HREF="netbeans.css" TYPE="text/css">
</HEAD>

<BODY>

<h1>Tervetuloa NetBeans-sivustoon www.netbeans.org</h1>

Hei ja tervetuloa avoimeen l&auml;hdekoodiin perustuvan NetBeans-sovelluskehittimen kotisivuille.

<h3>Mik&auml; on NetBeans?</h3>
NetBeans on menestyv&auml; ja avoimeen l&auml;hdekoodiin perustuva projekti, jolla
on eritt&auml;in laaja k&auml;ytt&auml;j&auml;kunta, kasvava yhteis&ouml; sek&auml; l&auml;hemm&auml;ksi 100 partneria (lis&auml;&auml; tulee koko ajan)
ymp&auml;ri maailman. Sun Microsystems perusti NetBeans-projektin kes&auml;kuussa 2000 ja toimii
edelleen projektin p&auml;&auml;sponsorina.

<p>T&auml;ll&auml; hetkell&auml; on kaksi eri tuotetta:  NetBeans IDE ja NetBeans alusta.

<p><a href="features/ide/index.html">NetBeans IDE</a>
on kehitysymp&auml;rist&ouml; - ohjelmointity&ouml;kalu, jolla voidaan kirjoittaa, k&auml;&auml;nt&auml;&auml;, debugata ja ottaa k&auml;ytt&ouml;&ouml;n
sovelluksia. Ohjelma on kirjoitettu Javalla, mutta se pystyy tukemaan mit&auml; tahansa ohjelmointikielt&auml;.
NetBeans kehitysymp&auml;rist&ouml;&auml; voidaan laajentaa siihen saatavilla useilla eri moduuleilla.
NetBeans IDE on ilmainen ty&ouml;kalu ja sen k&auml;ytt&ouml;&auml; eiv㲠koske mitk&auml;&auml;n rajoitukset.


<p>Saatavilla on my&ouml;s <a href="features/platform/index.html">NetBeans alusta</a>
,joka on modulaarinen ja laajennettavissa oleva ohjelmistoalusta, jota muut ohjelmistot voivat k&auml;ytt&auml;&auml; perustana
teht&auml;ess&auml; laajoja ty&ouml;p&ouml;yt&auml;sovelluksia. ISV partnerit tarjoavat plugineja, jotka tuovat lis&auml;arvoa, integroituvat helposti
alustaan ja joita voidaan k&auml;ytt&auml;&auml; omien ty&ouml;kalujen ja ratkaisujen kehitt&auml;miseen.</p>

<P>Molemmat tuotteet perustuvat avoimeen l&auml;hdekoodiin ja ne ovat ilmaisia kaupalliseen ja ei-kaupalliseen k&auml;ytt&ouml;&ouml;n.
L&auml;hdekoodi on saatavilla uudelleenk&auml;ytt&ouml;&ouml;n seuraavin ehdoin
<a href="cddl.html">Common Development and Distribution License</a>
(SPL).</p>

<h3>Mik&auml; on netbeans.org?</h3>
netbeans.org on NetBeans-yhteis&ouml;n koti. T&auml;m&auml; avoimen l&auml;hdekoodin yhteis&ouml; on omistautunut huippuluokan kehitysymp&auml;rist&ouml;n
rakentamiseen. netbeans.org sallii yli 160 eri maasta olevien k&auml;ytt&auml;jien olla kytk&ouml;ksiss&auml; resursseihin ja muihin
k&auml;ytt&auml;jiin ymp&auml;ri maailman. T&auml;&auml;lt&auml; voit ladata uusimman version NetBeans-kehittimest&auml;, katsella dokumentteja, kehitt&auml;&auml;
tiet&auml;myst&auml;si Javasta, seurata uutisia, liitty&auml; postituslistalle, vaikuttaa koodiin, saada tietoa projekteihin
liittyvist&auml; ihmisist&auml;, saada uusia kontakteja ja paljon muuta.


<h3>NetBeans yhteis&ouml;&ouml;n liittyminen</h3>
Liity osaksi NetBeans-tiimi&auml; ja auta tekem&auml;&auml;n NetBeanssista viel&auml;kin parempi.
Rekister&ouml;itym&auml;ll&auml; osallistut NetBeans-kehitykseen ja me pid&auml;mme sinut ajan tasalla
uutisista, jotka liittyv&auml;t NetBeans-projektiin. Sivun oikeassa yl&auml;reunassa on rekister&ouml;intilaatikko -
 valitse k&auml;ytt&auml;j&auml;nimi ja liity mukaan!


<h3>Pysyminen ajantasalla</h3>
<p>NetBeans tarjoaa useita eri postituslistoja monelle eri kiinnostuksen tasolle. T&auml;m&auml;n lis&auml;ksi postituslistat
helpottavat NetBeans k&auml;ytt&auml;jien v&auml;list&auml; kommunikointia. Tutustu NetBeans postituslistoihin osoitteessa
<a href="community/lists/index_fi.html">https://netbeans.org/community/lists/index_fi.html</a>
saadaksesi lis&auml;&auml; tietoa NetBeans-postituslistoista.

<p>Linkkej&auml; :

<UL>
<LI>Viikottaiset ja kuukausittaiset uutiskirjeet :
<A HREF="mailto:nbannounce-subscribe@netbeans.org">Tilaa</A> nbannounce
(<A HREF="community/lists/top.html">lis&auml;tietoja</A>)

<P><LI>Juttele muiden NB-k&auml;ytt&auml;jien kanssa, vaihda vinkkej&auml; ja tietoa :
<A HREF="mailto:nbusers-subscribe@netbeans.org">Tilaa</A> nbusers
(<A HREF="community/lists/top.html">lis&auml;tietoja</A>)
</UL>

<h3>Lataa NetBeans!</h3>
Lataa uusin versio <A HREF="/downloads/">NetBeans IDEst&auml;</A>.

</BODY>
</HTML>
