<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<link rel="stylesheet" type="text/css" href="netbeans.css">
<title>Bienvenido a NetBeans y www.netbeans.org, Portal del IDE Java de C&oacute;digo Abierto.</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" >
<meta NAME="description" CONTENT="Welcome, and Introduction to NetBeans, in Spanish!">
<meta http-equiv="content-language" CONTENT="es">
<meta name="keywords" content="java, IDE, editor,Platform, free, open source,development, j2ee, support,enviroment, web, NetBeans" >
</head>

<body>
<h1>Bienvenido a NetBeans y www.netbeans.org</h1>

<p>Hola y bienvenido a la p&aacute;gina principal de
NetBeans, el IDE (Entorno de Desarrollo Integrado) Java de
C&oacute;digo Abierto.</p>

<h3>&iquest;Qu&eacute; es NetBeans?</h3>
<p>NetBeans es un proyecto exitoso de c&oacute;digo abierto 
 con una gran base de usuarios, una comunidad en
constante crecimiento, y con cerca de 100 socios (&iexcl;y
creciendo!) en todo el mundo. Sun MicroSystems fund&oacute; el
proyecto de c&oacute;digo abierto NetBeans en junio 2000 y
contin&uacute;a siendo el patrocinador principal de los proyectos. </p>

<p>Al d&iacute;a de hoy hay disponibles dos productos: el
NetBeans&nbsp;IDE y NetBeans Platform. </p>

<p><a href="/features/ide/index.html">NetBeans
IDE</a>
es un entorno de desarrollo - una herramienta para que los programadores
puedan escribir, compilar, depurar y ejecutar programas.
Est&aacute; escrito en Java - pero puede servir para cualquier otro
lenguaje de programaci&oacute;n. Existe adem&aacute;s un
n&uacute;mero importante de m&oacute;dulos para extender el NetBeans&nbsp;IDE.
 NetBeans&nbsp;IDE es un producto libre y gratuito sin
restricciones de uso. </p>

<p>Tambi&eacute;n est&aacute; disponible <a href="/features/platform/index.html">NetBeans Platform</a>;
una base modular y extensible usada como estructura de
integraci&oacute;n para crear grandes aplicaciones de escritorio.
Empresas independientes asociadas, especializadas en desarrollo de
software, proporcionan extensiones adicionales que se integran
f&aacute;cilmente en la plataforma y que pueden tambi&eacute;n
utilizarse para desarrollar sus propias herramientas y soluciones. </p>

<p>Ambos productos son de c&oacute;digo abierto y gratuitos
para  uso tanto comercial como no comercial. El c&oacute;digo
fuente est&aacute; disponible para su reutilizaci&oacute;n de
acuerdo con la <a href="/cddl-gplv2.html">Common Development and Distribution License ( CDDL) v1.0 and the GNU General Public License (GPL) v2</a>.</p>

<h3>&iquest;Qu&eacute; es netbeans.org?</h3>
<p>netbeans.org es el portal de la comunidad de c&oacute;digo
abierto&nbsp;de NetBeans dedicado a construir un IDE de primera
clase. netbeans.org permite a usuarios de m&aacute;s de 160
pa&iacute;ses de todo el mundo&nbsp;estar en contacto con los
recursos y los personas alrededor de NetBeans. Es posible descargar
desde aqu&iacute;&nbsp;las &uacute;ltimas versiones de
NetBeans,
acceder a la documentaci&oacute;n de ayuda en l&iacute;nea,
profundizar su conocimiento personal de Java, estar al corriente de las
&uacute;ltimas noticias, unirse a una lista de
distribuci&oacute;n, contribuir c&oacute;digo, conocer las
personas implicadas en el proyecto, conocer gente, y mucho
m&aacute;s. </p>

<h3>Participar en la Comunidad NetBeans</h3>
<p>T&uacute; puedes formar parte&nbsp;parte del equipo de
NetBeans y ayudar a
mejorar&nbsp;a&uacute;n m&aacute;s.
Registr&aacute;ndote,&nbsp;contribuir&aacute;s directamente
al
&eacute;xito de NetBeans y nosotros te mantendremos informado de
las &uacute;ltimas novedades del proyecto NetBeans.
&iexcl;Rellena la informaci&oacute;n de registro situada en la
esquina superior derecha de esta p&aacute;gina - elige un nombre de
usuario y &uacute;nete a la comunidad!</p>

<h3>Mant&eacute;ngase informado</h3>

<p>NetBeans le ofrece una gran variedad de listas de
distribuci&oacute;n electr&oacute;nicas en funci&oacute;n
de su nivel de inter&eacute;s y que&nbsp;facilitan la
comunicaci&oacute;n entre los usuarios de NetBeans. Vea la
p&aacute;gina de las listas de NetBeans en <a href="/community/lists/index_es.html">https://netbeans.org/community/lists/index_es.html</a>
para descubrir m&aacute;s sobre las listas de distribuci&oacute;n de NetBeans.
</p>

<p>Enlaces R&aacute;pidos:</p>
<UL>
<LI>Los boletines semanales y mensuales de NetBeans:
<A HREF="mailto:nbannounce-subscribe@netbeans.org">Suscr&iacute;base</A> a nbannounce
(<A HREF="/community/lists/top.html">m&aacute;s
informaci&oacute;n</A>)

<P><LI>Habla con otros usuarios de NB, intercambie consejos y trucos:
<A HREF="mailto:nbusers-subscribe@netbeans.org">Suscr&iacute;base</A> a nbusers
(<A HREF="/community/lists/top.html">m&aacute;s
informaci&oacute;n</A>)
</UL>

<!-- Translators : OPTIONAL, if list in your language exists START -->
<h3>Listas en tu lenguaje</h3>
La lista nbdiscuss_es@netbeans.org es una lista de discusi&oacute;n general de 
problemas, consejos y trucos relacionados con NetBeans - in Espa&ntilde;ol!
<A HREF="mailto:nbdiscuss_es-subscribe@netbeans.org">Subscribe to nbdiscuss_es@netbeans.org</A>.</I>
<!-- Translators : OPTIONAL, if list in your language exists STOP -->

<h3>&iexcl;Descarga NetBeans!</h3>
Descarga la &uacute;ltima
versi&oacute;n del&nbsp;<a href="downloads/index.html">NetBeans
IDE</a>.

<P>Si est&aacute interesado en escribir aplicaciones sobre NetBeans
Platform, <A HREF="http://platform.netbeans.org/platform-get.html">descarge la &uacute;ltima versi&oacute;n de NetBeans Platform</A>

</body>
</html>
