<html>
<head>
<title>Bem-vindo ao NetBeans!</title>
<meta name="description" content="First time here? How to get started with NetBeans">
<link href="netbeans.css" type="text/css" rel="stylesheet">
</head>

<body>

<h1>Bem-vindo ao Projeto NetBeans!</h1>

<h2>1. O que &eacute; o Projeto NetBeans?</h2>
<p>O <strong>NetBeans IDE</strong> &eacute; um Ambiente de Desenvolvimento Integrado de c&oacute;digo-fonte aberto, uma ferramenta de software que voc&ecirc; pode baixar e usar de gra&ccedil;a para desenvolver aplicativos. <a href="features/index.html">Mais...</a></p>
<p>A <strong>Plataforma NetBeans</strong> &eacute; uma estrutura extens&iacute;vel que pode ser usada para desenvolver aplicativos desktop profissionais independentes do SO. <a href="http://platform.netbeans.org">Mais...</a></p>
<p>Finalmente, o <strong>NetBeans.org</strong> &eacute; uma comunidade crescente de c&oacute;digo-fonte aberto com centenas de desenvolvedores experientes localizados ao redor do mundo. <a href="community/index.html">Mais...</a></p> 

<p>
      <a href="images_www/v6/8/screenshots/java-editor.png"><img alt="Editor do NetBeans" src="images_www/v6/8/screenshots/java-editor-cut.png" border="none" /></a><br />
      <a href="images_www/v6/8/screenshots/java-editor.png"><span class="font-11">Clique na imagem para obter uma visualiza&ccedil;&atilde;o em tela cheia</span></a>
</p>

<h2>2. Como posso iniciar?</h2>
<p><a href="https://netbeans.org/downloads/">Fa&ccedil;a o download</a> do NetBeans IDE. Ele tem todo o necess&aacute;rio para desenvolver aplicativos de classe mundial. O software NetBeans &eacute; 100% baseado no IDE e plataforma Java portanto, funciona em cada SO onde o JDK estiver dispon&iacute;vel. O NetBeans suporta uma ampla gama de tecnologias Java, mas n&atilde;o est&aacute; limitado ao Java -outras linguagens tamb&eacute;m s&atilde;o suportadas. A ferramentas do NetBeans tem tanta funcionalidade, que voc&ecirc; pode baixar aquelas que forem melhor para voc&ecirc;. Aprenda mais sobre as tecnologias suportadas e sobre os recursos na <a href="features/index.html">p&aacute;gina Recursos</a>. Voc&ecirc; pode adicionar mais funcionalidades com m&oacute;dulos plug-in (no IDE, escolha Ferramentas &gt; Plug-ins).<br>


<h2>3. Como posso me envolver? </h2>
<p>H&aacute; uma crescente comunidade de usu&aacute;rios do NetBeans no mundo, variando de novos usu&aacute;rios aos gurus. Junte-se a eles para discutir dicas e truques, recursos do NetBeans, solu&ccedil;&atilde;o de problemas, e muito mais. <a href="community/lists/index.html">Registre-se agora!</a>

<h2>4. Como aprendo mais? </h2>
<p>H&aacute; uma gama de conhecimentos aqui no netbeans.org para que voc&ecirc; fa&ccedil;a a imers&atilde;o, com novo conte&uacute;do postado semanalmente. Tutoriais, artigos, guias, demonstra&ccedil;&otilde;es e screencasts -- <a href="kb/index.html">est&aacute; tudo l&aacute;</a>. </p>

<p>Bem-vindo! Esperamos que tenha tido prazer em nos visitar.</p> 
<br>

</body>
</html>
