<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<!--
 Copyright 2010 Oracle, Inc. 
 All Rights Reserved.
-->
<html>
  <head>
    <title>Informaci&oacute;n da versi&oacute;n 6.9.1 do IDE de NetBeans</title>
    <meta name="DESCRIPTION" content="Features of the NetBeans IDE 6.9.1 Release">
    <link rel="stylesheet" type="text/css" href="../../../netbeans.css">
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  </head>
  <body>
    <a name="top"></a>
    <h1>Informaci&oacute;n da versi&oacute;n 6.9.1 do IDE de NetBeans</h1>

<p> 
    O IDE de NetBeans &eacute; un contorno de desenvolvemento integrado ga&ntilde;ador de moitos premiso dispo&ntilde;&iacute;bel para Windows, Mac, GNU/Linux e Solaris. O proxecto NetBeans est&aacute; composto por un <a href="../../../../features/index.html">IDE de c&oacute;digo aberto</a> e unha <a href="../../../../features/platform/index.html">plataforma de aplicativos</a> na que os desenvolvedores activos poden crear aplicativos web, empresariais, de escritorio e m&oacute;biles usando a linguaxe Java.
</p><p>
    O proxecto NetBeans est&aacute; composto por unha <a href="../../../../community/index.html">comunidade de desenvolvedores</a> moi activos e ofrece amplos recursos de <a href="../../../../kb/index.html">documentaci&oacute;n e formaci&oacute;n</a> as&iacute; como unha selecci&oacute;n variada de <a href="http://plugins.netbeans.org">engadidos</a> de terceiros.
</p>

<h2>Vista previa da versi&oacute;n</h2>

<p>
    O IDE NetBeans 6.9.1 introduce JavaFX Composer, unha ferramenta de dese&ntilde;o para a creaci&oacute;n de aplicativos gr&aacute;ficos JavaFX, parecido ao construtor de aplicativos gr&aacute;ficos Swing para aplicativos Java SE. Outras notoriedades incl&uacute;en a interoperabilidade OSGi para aplicativos da plataforma NetBeans, e a compatibilidade para desenvolver paquetes OSGi con Maven; compatibilidade para o SDK de JavaFX 1.3.1, marco de traballo PHP Zend, e Ruby on Rails 3.0; as&iacute; como melloras no editor Java, no depurador Java, no seguimento de incidencias e moitas m&aacute;is.
</p>

<h2>Obter o NetBeans IDE 6.9.1</h2>

<p>
    <a href="/downloads/index.html"><img alt="Descargar NetBeans IDE 6.9.1" style="border: 0px solid ;"
         src="../../../../images_www/v6/dl-nb-ide.gif"></a>
</p>

<h2>Documentaci&oacute;n</h2>

<p>Use os seguintes documentos para iniciarse co IDE NetBeans 6.9.1:</p>
<ul>
  <li><a href="relnotes_gl.html">Notas da versi&oacute;n</a></li>
  <li><a href="install_gl.html">Instruci&oacute;ns de instalaci&oacute;n</a></li>
  <li><a href="../../../kb/kb.html">Titoriais recentes</a></li>
</ul>
<p></p>

<h2>Caracter&iacute;sticas destac&aacute;beis</h2>

<table width="100%">

    <tr>
      <td style="vertical-align: top;">
      <p><b>OSGI</b></p>
 
       <ul>
       <li>Desenvolver paquetes OSGI con Maven
       </li><li>Contedor de Felix empaquetado
       </li><li>Usar paquetes OSGI nun aplicativo NetBeans RCP
       </li></ul>

     <br>
     <p><b>Plataforma NetBeans</b></p>
 
       <ul>
       <li>Interoperabilidade OSGI (desenvolver e consumir paquetes OSGI nos aplicativos baseados na plataforma)
       </li><li>Compatibilidade Felix 2.0.3 OSGI, compatibilidade experimental para Equinox
       </li><li>Converter m&oacute;dulos NetBeans en paquetes OSGI e exec&uacute;talos  non contedor OSGI sen modificar
       </li><li>Editor de marcas (branding) para os proxectos baseados nas plataformas Maven e Ant
       </li><li>Os aplicativos baseados na plataforma NetBeans xeran instaladores para os sistemas operativos m&aacute;is com&uacute;ns
       </li><li>Asistencia mellorada para consumir servizos web e conectarse &aacute;s bases de datos
       </li></ul>
      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <p><img style="border: 1px solid ; width: 200px; height: 104px;" 
           src="../../../images_www/screenshots/6.9/osgi-equinox-netbeans.png" alt=""></p>
      <p>&nbsp;</p>
      <p><img style="border: 1px solid ; width: 200px; height: 124px;" 
           src="../../../images_www/screenshots/6.9/maven-osgi.png" alt=""></p>
      </td>
    </tr>

    <tr>
      <td style="vertical-align: middle;">
      <p><b>JavaFX</b></p>
      <ul>
        <li>JavaFX Composer para superficies de usuario parecidas a formularios, con control e acceso a diversas fontes de datos
        </li>
        <li>Engadidos e mellorados consellos no editor, na depuraci&oacute;n e na refactorizaci&oacute;n
        </li><li>Paletas melloradas para as gr&aacute;ficas, efectos, cores e formas JavaFX
        </li><li>Formato de c&oacute;digo mellorado
      </ul>
      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <a href="http://wiki.netbeans.org/wiki/images/6/6c/Javafx-composer-screenshot-wizard.png"><img
         style="border: 1px solid ; width: 200px; height: 77px;" 
         src="../../../images_www/screenshots/6.9/javafx-composer.png" alt=""></a>
      </td>
    </tr>
    
    <tr>
      <td style="vertical-align: middle;">
      <p><b>Java EE</b></p>
      <ul>
        <li>Compatibilidade coa inxecci&oacute;n de dependencias e contextos (CDI) (JSR-299)
        </li><li>Compatibilidade co marco de traballo Spring 3.0
        </li><li>Edici&oacute;n Open Source do servidor Glassfish 3.0.1 empaquetado
        </li><li>Facilidades na rexeneraci&oacute;n de entidades JPA despois de cambiar a base de datos
        </li><li>Compatibilidade dos servizos web REST cos aplicativos RCP
      </ul>
      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <img style="border: 1px solid ; width: 200px; height: 126px;"
           src="../../../images_www/screenshots/6.9/enterprise-cdi.png" alt="">
      </td>
    </tr>

    <tr>
      <td style="vertical-align: middle;">
      <p><b>Java</b></p>
      <ul><li>Agrupaci&oacute;n de puntos de interrupci&oacute;n no depurador de Java, hist&oacute;rico de par&aacute;metros anexados ao depurador
      </li><li>Compatibilidade para procesadores de anotaci&oacute;ns para o editor, configur&aacute;bel nas propiedades do proxecto
      </li><li>Novo applet e compatibilidade Web Start (JNLP)
      </li><li>Navegaci&oacute;n mellorada no analizador de trazas do stack e os URL, Ir &aacute; acci&oacute;n do m&eacute;todo Overridden/Implemented
      </li></ul>

      <br>
      <p><b>Linguaxes web: HTML, CSS, JavaScript</b></p>
      <ul><li>Refactorizaci&oacute;n e busca de usos para CSS e linguaxes parecidas a HTML
      </li><li>Completado de c&oacute;digo e hiperligado para os atributos de selector de id e clase
      </li><li>Refactorizaci&oacute;n de estilos CSS en li&ntilde;a
      </li></ul>
      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <p><img style="border: 1px solid ; width: 200px; height: 68px;"
           src="../../../images_www/screenshots/6.9/annotation-processor.png" alt=""></p>
      <p>&nbsp;</p>
      <p><img style="border: 1px solid ; width: 200px; height: 105px;"
           src="../../../images_www/screenshots/6.9/css-refactoring.png" alt=""></p>
      </td>
    </tr>

    <tr>
      <td style="vertical-align: middle;">
      <p><b>Java Card</b></p>
      <ul>
        <li>Compatibilidade para a creaci&oacute;n de servlets Java Card Connected 3, applets cl&aacute;sicos e estendidos
        </li><li>Compatibilidade con versi&oacute;ns anteriores de Java Card 2.2.x e Java Card Classic
        </li><li>Depuraci&oacute;n e creaci&oacute;n de m&uacute;ltiples  Java Card Platform/Device
        </li><li>Ali&ntilde;amento coa implementaci&oacute;n de Java Card Reference Implementation
      </ul>
      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <img style="border: 1px solid ; width: 200px; height: 126px;"
           src="../../../images_www/v6/9/features/java-card.png" alt="">
      </td>
    </tr>

   <tr>
      <td style="vertical-align: middle;">
      <p><b>PHP</b></p>
      <ul>
        <li>Compatibilidade co marco de traballo PHP Zend
        </li><li>Anotaci&oacute;ns &quot;Overrides/Implements&quot; e &quot;Is Overridden/Implemented&quot;
        </li><li>Novo formateador con m&aacute;is regras de formato</li>
      </ul>
      <br>
      <p><b>Ruby</b></p>
      <ul>
        <li>Compatibilidade con Ruby on Rails 3.0
        </li>
      </ul>

      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <img style="border: 1px solid ; width: 200px; height: 114px;"
           src="../../../images_www/screenshots/6.9/zend-php.png" alt="">
      </td>
    </tr>

    <tr>
      <td style="vertical-align: middle;">
      <p><b>C/C++</b></p>
      <ul><li>Probas unitarias de integraci&oacute;n con proxectos C/C++
      </li><li>Desenvolvemento remoto mellorado que incl&uacute;e descarga de ficheiros remotos e navegaci&oacute;n
      </li><li>Compatibilidade mellorada para obxectivos makefile e Fortran
      </li><li>Navegaci&oacute;n mediante hiperligaz&oacute;ns entre m&eacute;todos overridden e clases
      </li></ul>
      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <img style="border: 1px solid ; width: 200px; height: 122px;"
           src="../../../images_www/screenshots/6.9/c-remote-download.png" alt="">
      </td>
    </tr>

    <tr>
      <td style="vertical-align: middle;">
      <p><b>Xeral</b></p>
      <ul><li>Moitas m&aacute;is suxesti&oacute;ns de edici&oacute;n para Java e Ruby
      </li><li>Admite corrector ortogr&aacute;fico no Editor
      </li><li>Elemento do men&uacute; Axuda para informar de erros e lentitude do IDE NetBeans    
      </li><li>Compatibilidade para m&uacute;ltiples servidores de equipo baseados en Kenai (p. ex. kenai.com e netbeans.org).
      </li></ul>
      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <img style="border: 1px solid ; width: 200px; height: 75px;"
           src="../../../images_www/screenshots/6.9/team-server.png" alt="">
      </td>
    </tr>

</table>

    <p><br /></p>
    <p>Saber m&aacute;is sobre as caracter&iacute;sticas desta versi&oacute;n na p&aacute;xina de <a href="http://wiki.netbeans.org/NewAndNoteworthy69">Novas e notoriedades do IDE NetBeans</a>!</p>
    <p>Visite a <a href="../roadmap.html">folla de ruta da versi&oacute;n de NetBeans</a>.</p> 

  </body>
</html>
