<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<!--
 Copyright 2010 Oracle, Inc. 
 All Rights Reserved.
-->
<html>
  <head>
    <title>Informaci&oacute;n del lanzamiento del IDE NetBeans 6.9.1</title>
    <meta name="DESCRIPTION" content="Features of the NetBeans IDE 6.9.1 Release">
    <link rel="stylesheet" type="text/css" href="../../../netbeans.css">
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  </head>
  <body>
    <a name="top"></a>
    <h1>Informaci&oacute;n del lanzamiento del IDE NetBeans 6.9.1</h1>

<p> 
    El IDE NetBeans es un reconocido entorno de desarrollo integrado disponible para Windows, Mac, Linux y Solaris. El proyecto NetBeans est&aacute; formado por un <a href="../../../features/index.html">IDE de c&oacute;digo abierto</a> y una <a href="../../../features/platform/index.html">plataforma de aplicaci&oacute;n</a> que permite a los desarrolladores crear con rapidez aplicaciones web, empresariales, de escritorio y m&oacute;viles utilizando la plataforma Java, as&iacute; como JavaFX, PHP, JavaScript y Ajax, Ruby y Ruby on Rails, Groovy and Grails y C/C++.
</p><p>
    El proyecto de NetBeans est&aacute; apoyado por una <a href="../../../community/index.html">comunidad de desarrolladores</a> din&aacute;mica y ofrece <a href="../../../kb/index.html">documentaci&oacute;n y recursos de formaci&oacute;n</a> exhaustivos, as&iacute; como una amplia selecci&oacute;n de <a href="http://plugins.netbeans.org">complementos</a> de terceros.
</p>

<h2>Informaci&oacute;n general sobre la versi&oacute;n </h2>

<p>
    El IDE NetBeans 6.9.1 introduce JavaFX Composer, una herramienta de dise&ntilde;o para la creaci&oacute;n de aplicaciones gr&aacute;ficas JavaFX, parecido al constructor de aplicaciones gr&aacute;ficas Swing para aplicaciones Java SE. Otras notoriedades incluyen la interoperatividad OSGi para aplicaciones de plataforma NetBeans, y la compatibilidad para desarrollar paquetes OSGi con Maven; compatibilidad para el SDK de JavaFX 1.3.1, Famework Zend PHP, y RoR (Ruby on Rails) 3.0; as&iacute; como mejoras en el editor Java, Depurador Java, seguimiento de incidencias, y muchas m&aacute;s.
</p>

<h2>Obtenga el IDE NetBeans 6.9.1</h2>

<p>
    <a href="/downloads/index.html"> <img alt="Descargar el IDE NetBeans 6.9.1" style="border: 0px solid ;"
         src="../../../../images_www/v6/dl-nb-ide.gif"></a>
</p>

<h2>Documentaci&oacute;n</h2>

<p>Utilice los siguientes documentos para iniciarse con el IDE NetBeans 6.9.1:</p>
<ul>
  <li><a href="relnotes_es.html">Notas de la versi&oacute;n</a></li>
  <li><a href="install_es.html">Instrucciones de instalaci&oacute;n</a></li>
  <li><a href="../../../kb/kb.html">&Uacute;ltimos tutoriales</a></li>
</ul>
<p></p>

<h2>Funciones m&aacute;s importantes</h2>

<table width="100%">

    <tr>
      <td style="vertical-align: top;">
      <p><b>OSGi</b></p>
 
       <ul>
       <li>Desarrollo de paquetes OSGi con Maven
       </li><li>Contenedor de Felix incluido
       </li><li>Utilizaci&oacute;n de paquetes OSGi en una aplicaci&oacute;n RCP de NetBeans
       </li></ul>

     <br>
     <p><b>NetBeans Platform</b></p>
 
       <ul>
       <li>Interoperatividad OSGi (desarrollo y utilizaci&oacute;n de paquetes OSGi en aplicaciones basadas en plataformas)
       </li><li>Compatibilidad OSGi para Felix 2.0.3, compatibilidad experimental para Equinox
       </li><li>Conversi&oacute;n de m&oacute;dulos NetBeans a paquetes OSGi, y ejecutarlos en un contenedor OSGi sin modificaci&oacute;n
       </li><li>Edici&oacute;n con marcas, para proyectos basados con las plataformas de Ant y de Maven
       </li><li>Aplicaciones basadas con la plataforma NetBeans capaces de generar instaladores para los sistemas operativos m&aacute;s comunes
       </li><li>Compatibilidad mejorada para la utilizaci&oacute;n de aplicaciones y la conexi&oacute;n a bases de  datos
       </li></ul>
      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <p><img style="border: 1px solid ; width: 200px; height: 104px;" 
           src="../../../images_www/screenshots/6.9/osgi-equinox-netbeans.png" alt=""></p>
      <p>&nbsp;</p>
      <p><img style="border: 1px solid ; width: 200px; height: 124px;" 
           src="../../../images_www/screenshots/6.9/maven-osgi.png" alt=""></p>
      </td>
    </tr>

    <tr>
      <td style="vertical-align: middle;">
      <p><b>JavaFX</b></p>
      <ul>
        <li>JavaFX Composer para superficies de usuario parecidas a formularios, con control y acceso a diversas fuentes de datos
        </li>
        <li>A&ntilde;adidos y mejorados consejos en el editor y en la reestructuraci&oacute;n
        </li><li>Paletas mejoradas de JavaFX: formas, colores, efectos y gr&aacute;ficas
        </li><li>Formateo de c&oacute;digo mejorado
      </ul>
      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <a href="http://wiki.netbeans.org/wiki/images/6/6c/Javafx-composer-screenshot-wizard.png"><img
         style="border: 1px solid ; width: 200px; height: 77px;" 
         src="../../../images_www/screenshots/6.9/javafx-composer.png" alt=""></a>
      </td>
    </tr>
    
    <tr>
      <td style="vertical-align: middle;">
      <p><b>Java EE</b></p>
      <ul>
        <li>Compatibilidad para CDI (Contexts and Dependency Injection) (JSR-299)
        </li><li>Compatibilidad con Spring Framework 3.0 
        </li><li>Inclusi&oacute;n del Servidor GlassFish OSE (Open Source Edition) 3.0.1
        </li><li>Regeneraci&oacute;n de entidades JPA tras un cambio en la base de datos
        </li><li>Compatibilidad para servicios web REST para aplicaciones RCP
      </ul>
      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <img style="border: 1px solid ; width: 200px; height: 126px;"
           src="../../../images_www/screenshots/6.9/enterprise-cdi.png" alt="">
      </td>
    </tr>

    <tr>
      <td style="vertical-align: middle;">
      <p><b>Java</b></p>
      <ul><li>Agrupaci&oacute;n de puntos de interrupci&oacute;n en el Depurador de Java, hist&oacute;rico de par&aacute;metros adjuntados al depurador
      </li><li>Compatibilidad para procesadores de anotaciones para el editor, configurable en la propiedades del proyecto
      </li><li>Compatibilidad para nuevos Applets y Web Starts (JNLP)
      </li><li>Navegaci&oacute;n mejorada en el analizador de trazas de pila y URLs, Ir a la acci&oacute;n del m&eacute;todo Overridden/Implemented
      </li></ul>

      <br>
      <p><b>Lenguajes Web: HTML, CSS, JavaScript</b></p>
      <ul><li>Reestructuraci&oacute;n y b&uacute;squeda de usos para CSS y lenguajes parecidos a HTML
      </li><li>Autocompletado y enlace para para atributos id y class
      </li><li>Reetructuraci&oacute;n de estilos en l&iacute;nia de CSS
      </li></ul>
      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <p><img style="border: 1px solid ; width: 200px; height: 68px;"
           src="../../../images_www/screenshots/6.9/annotation-processor.png" alt=""></p>
      <p>&nbsp;</p>
      <p><img style="border: 1px solid ; width: 200px; height: 105px;"
           src="../../../images_www/screenshots/6.9/css-refactoring.png" alt=""></p>
      </td>
    </tr>

    <tr>
      <td style="vertical-align: middle;">
      <p><b>Java Card</b></p>
      <ul>
        <li>Creaci&oacute;n de servlets Java Card Connected 3, applets extendidos y applets cl&aacute;sicos
        </li><li>Compatibilidad retrospectiva con Java Card 2.2.x y Java Card Classic
        </li><li>Depuraci&oacute;n y creaci&oacute;n de m&uacute;ltiples Plataformas/Dispositivos Java Card
        </li><li>Est&aacute; a corde con la Implementaci&oacute;n de Referencia de Java Card. 
      </ul>
      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <img style="border: 1px solid ; width: 200px; height: 126px;"
           src="../../../images_www/v6/9/features/java-card.png" alt="">
      </td>
    </tr>

   <tr>
      <td style="vertical-align: middle;">
      <p><b>PHP</b></p>
      <ul>
        <li>Compatibilidad con PHP Zend Framework 
        </li><li>Anotaciones &quot;Overrides/Implements&quot; y &quot;Is Overridden/Implemented&quot;
        </li><li>Nuevo formateador con m&aacute;s reglas de formateo</li>
      </ul>
      <br>
      <p><b>Ruby</b></p>
      <ul>
        <li>Compatibilidad Ruby on Rails 3.0
        </li>
      </ul>

      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <img style="border: 1px solid ; width: 200px; height: 114px;"
           src="../../../images_www/screenshots/6.9/zend-php.png" alt="">
      </td>
    </tr>

    <tr>
      <td style="vertical-align: middle;">
      <p><b>C/C++</b></p>
      <ul><li>Integraci&oacute;n de pruebas unitarias con proyectos C/C++
      </li><li>Desarrollo remoto mejorado, incluyendo la descarga y navegaci&oacute;n en ficheros remotos
      </li><li>Compatibilidad mejorada para objetivos makefile y Fortran
      </li><li>Navegaci&oacute;n mediante hiperenlaces entre m&eacute;todos overridden y clases
      </li></ul>
      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <img style="border: 1px solid ; width: 200px; height: 122px;"
           src="../../../images_www/screenshots/6.9/c-remote-download.png" alt="">
      </td>
    </tr>

    <tr>
      <td style="vertical-align: middle;">
      <p><b>General</b></p>
      <ul><li>Muchas m&aacute;s sugerencias de edici&oacute;n para Java y Ruby
      </li><li>Corrector ortogr&aacute;fico en el Editor
      </li><li>Opci&oacute;n del men&uacute; de ayuda para reportar fallos y de lentitud que afecta al IDE NetBeans    
      </li><li>Compatibilidad para diversos servidores de trabajo en equipo basados en Kenai (por ejemplo: kenai.com y netbeans.org).
      </li></ul>
      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <img style="border: 1px solid ; width: 200px; height: 75px;"
           src="../../../images_www/screenshots/6.9/team-server.png" alt="">
      </td>
    </tr>

</table>

    <p><br /></p>
    <p>&iexcl;Conozca m&aacute;s acerca de las caracter&iacute;stica de esta versi&oacute;n en la p&aacute;gina <a href="http://wiki.netbeans.org/NewAndNoteworthy69">Novedades y notoriedades en el IDE NetBeans</a>!</p>
    <p>Visite la <a href="../roadmap.html">hoja de ruta de lanzamientos de NetBeans</a>.</p> 

  </body>
</html>
