<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<!--
 Copyright 2010 Oracle, Inc. 
 All Rights Reserved.
-->
<html>
  <head>
    <title>Informaci&oacute; del llan&ccedil;ament de l'IDE NetBeans 6.9.1</title>
    <meta name="DESCRIPTION" content="Features of the NetBeans IDE 6.9.1 Release">
    <link rel="stylesheet" type="text/css" href="../../../netbeans.css">
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  </head>
  <body>
    <a name="top"></a>
    <h1>Informaci&oacute; del llan&ccedil;ament de l'IDE NetBeans 6.9.1</h1>

<p> 
    El IDE NetBeans ha estat guardonat amb un premi com a entorn de desenvolupament integrat per a Windows, Mac, Linux i Solaris. El projecte NetBeans consta d'un <a href="../../../features/index.html">IDE de codi obert</a> i una <a href="../../../features/platform/index.html">plataforma d'aplicaci&oacute;</a> que permeten als desenvolupadors crear aplicacions web, empresarials, d'escriptori i de m&ograve;bil, d'una forma r&agrave;pida utilitzant la plataforma Java, aix&iacute; com JavaFX, PHP, JavaScript i Ajax, Ruby i Ruby on Rails, Groovy i Grails, i C/C++.
</p><p>
    El projecte NetBeans est&agrave; suportat per una <a href="../../../community/index.html">comunitat de desenvolupadors</a> vibrant, i ofereix uns recursos extensos de <a href="../../../kb/index.html">documentaci&oacute; i d'aprenentatge</a> aix&iacute; com una selecci&oacute; &agrave;mplia de <a href="http://plugins.netbeans.org">complements</a> de tercers.
</p>

<h2>Descripci&oacute; general del llan&ccedil;ament</h2>

<p>
    L'IDE NetBeans 6.9.1 introdueix l'eina de composici&oacute; de JavaFX, una eina visual de disseny per a la construcci&oacute; d'aplicacions gr&agrave;fiques JavaFX, semblant al constructor gr&agrave;fic Swing per a aplicacions de Java SE. Altres notorietats inclouen la interoperabilitat d'OSGi per a aplicacions de plataforma NetBeans, i el suport per al desenvolupament de paquets OSGi amb Maven; suport per a l'SDK de JavaFX 1.3.1, el framework Zend PHP, i RoR (Ruby on Rails) 3.0; aix&iacute; com millores a l'editor Java, depurador Java, seguiment d'incid&egrave;ncies, i m&eacute;s coses.
</p>

<h2>Obtenir l'IDE NetBeans 6.9</h2>

<p>
    <a href="/downloads/index.html"> <img alt="Descarregar l'IDE NetBeans 6.9" style="border: 0px solid ;"
         src="../../../../images_www/v6/dl-nb-ide.gif"></a>
</p>

<h2>Documentaci&oacute;</h2>

<p>Utilitzeu aquests documents per a iniciar-vos amb l'IDE NetBeans 6.9.1</p>
<ul>
  <li><a href="relnotes_ca.html">Notes del llan&ccedil;ament</a></li>
  <li><a href="install_ca.html">Instruccions d'instal&middot;laci&oacute;</a></li>
  <li><a href="../../../kb/kb.html">Guies d'aprenentatge recents</a></li>
</ul>
<p></p>

<h2>Caracter&iacute;stiques destacades</h2>

<table width="100%">

    <tr>
      <td style="vertical-align: top;">
      <p><b>OSGi</b></p>
 
       <ul>
       <li>Desenvolupament de paquets OSGi amb Maven
       </li><li>Contenidor de Felix incl&ograve;s
       </li><li>Paquets OSGi en una aplicaci&oacute; RCP de NetBeans
       </li></ul>

     <br>
     <p><b>Plataforma NetBeans</b></p>
 
       <ul>
       <li>Interoperabilitat OSGi (desenvolupament i utilitzaci&oacute; de paquets OSGi en aplicacions basades amb plataformes)
       </li><li>Suport OSGi Felix 2.0.3, suport experimental per a Equinox
       </li><li>Conversi&oacute; de m&ograve;duls NetBeans a paquets OSGi, i l'execuci&oacute; en un recipient OSGi sense cap modific-i&oacute;
       </li><li>Edici&oacute; amb marcatges, tant per Ant i Maven per a projectes basats amb la plataforma
       </li><li>Aplicacions basades amb la plataforma NetBeans capaces de generar instal.ladors per als sistemes operatius m&eacute;s comuns
       </li><li>Suport millorat per a l'&uacute;s d'aplicacions web i connexions a bases de dades
       </li></ul>
      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <p><img style="border: 1px solid ; width: 200px; height: 104px;" 
           src="../../../images_www/screenshots/6.9/osgi-equinox-netbeans.png" alt=""></p>
      <p>&nbsp;</p>
      <p><img style="border: 1px solid ; width: 200px; height: 124px;" 
           src="../../../images_www/screenshots/6.9/maven-osgi.png" alt=""></p>
      </td>
    </tr>

    <tr>
      <td style="vertical-align: middle;">
      <p><b>JavaFX</b></p>
      <ul>
        <li>Eina de composici&oacute; de JavaFX per als components d'interf&iacute;cie d'usuari semblant als formularis, amb estats i acc&eacute;s a diverses fonts de dades
        </li>
        <li>S'han afegit i millorat els consells en l'editor, en el depurador i en la reestructuraci&oacute;
        </li><li>S'ha millorat les paletes de JavaFX: formes, colors, efectes i gr&agrave;fics
        </li><li>S'ha millorat la formataci&oacute; del codi
      </ul>
      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <a href="http://wiki.netbeans.org/wiki/images/6/6c/Javafx-composer-screenshot-wizard.png"><img
         style="border: 1px solid ; width: 200px; height: 77px;" 
         src="../../../images_www/screenshots/6.9/javafx-composer.png" alt=""></a>
      </td>
    </tr>
    
    <tr>
      <td style="vertical-align: middle;">
      <p><b>Java EE</b></p>
      <ul>
        <li>Suport per a CDI (Contexts and Dependency Injection) (JSR-299)
        </li><li>Suport per al Framework Spring 3.0
        </li><li>Servidor GlassFish OSE (Open Source Edition) 3.0.1 incl&ograve;s
        </li><li>Regeneraci&oacute; f&agrave;cil de les entitats JPA despr&eacute;s d'un canvi a la base de dades
        </li><li>Suport per a serveis web REST per a aplicacions RCP
      </ul>
      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <img style="border: 1px solid ; width: 200px; height: 126px;"
           src="../../../images_www/screenshots/6.9/enterprise-cdi.png" alt="">
      </td>
    </tr>

    <tr>
      <td style="vertical-align: middle;">
      <p><b>Java</b></p>
      <ul><li>Agrupaci&oacute; de punts d'interrupci&oacute; al depurador de Java, hist&ograve;ric d'adjuncions al depurador
      </li><li>Suport per a processadors d'anotacions en l'editor, configurable a trav&eacute;s de les propietats del projecte
      </li><li>Suport per a la nova mini-aplicaci&oacute; i Web Start (JNLP)
      </li><li>Navegaci&oacute; millorada en l'analitzador de traces de la pila i URLs, Anar a l'acci&oacute; Overridden/Implemented del m&egrave;tode
      </li></ul>

      <br>
      <p><b>Llenguatges Web: HTML, CSS, JavaScript</b></p>
      <ul><li>Reestructuraci&oacute; i trobar usos CSS i per a llenguatges semblants a HTML
      </li><li>Autocompletat de codi i hipervincles per el selector d'atributs id i class
      </li><li>Reestructuraci&oacute; en l&iacute;nia d'estils CSS
      </li></ul>
      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <p><img style="border: 1px solid ; width: 200px; height: 68px;"
           src="../../../images_www/screenshots/6.9/annotation-processor.png" alt=""></p>
      <p>&nbsp;</p>
      <p><img style="border: 1px solid ; width: 200px; height: 105px;"
           src="../../../images_www/screenshots/6.9/css-refactoring.png" alt=""></p>
      </td>
    </tr>

    <tr>
      <td style="vertical-align: middle;">
      <p><b>Java Card</b></p>
      <ul>
        <li>Suport per a servlets de Java Card Connected 3, mini-aplicacions tan ampliades com cl&agrave;ssiques
        </li><li>Compatible retrospectivament amb Java Card 2.2.x i Java Card Cl&agrave;ssic
        </li><li>Depuraci&oacute; i creaci&oacute; de m&uacute;ltiple de plataformes i dispositius de Java Card
        </li><li>Conforme a la refer&egrave;ncia d'implementaci&oacute; de Java Card
      </ul>
      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <img style="border: 1px solid ; width: 200px; height: 126px;"
           src="../../../images_www/v6/9/features/java-card.png" alt="">
      </td>
    </tr>

   <tr>
      <td style="vertical-align: middle;">
      <p><b>PHP</b></p>
      <ul>
        <li>Suport Framework Zend PHP
        </li><li>Anotacions &quot;Overrides/Implements&quot; i &quot;Is Overridden/Implemented&quot;
        </li><li>Nou formatejador amb moltes regles de format</li>
      </ul>
      <br>
      <p><b>Ruby</b></p>
      <ul>
        <li>Suport RoR (Ruby on Rails) 3.0
        </li>
      </ul>

      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <img style="border: 1px solid ; width: 200px; height: 114px;"
           src="../../../images_www/screenshots/6.9/zend-php.png" alt="">
      </td>
    </tr>

    <tr>
      <td style="vertical-align: middle;">
      <p><b>C/C++</b></p>
      <ul><li>Integraci&oacute; de proves un&agrave;ries amb projectes C/C++
      </li><li>Desenvolupament remot millorat, incloent la desc&agrave;rrega i navegaci&oacute;,  de fitxers remots
      </li><li>Suport millorat per a objectius makefile i Fortran
      </li><li>Navegaci&oacute; d'hipervincles millorada entre m&egrave;todes overridden i classes
      </li></ul>
      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <img style="border: 1px solid ; width: 200px; height: 122px;"
           src="../../../images_www/screenshots/6.9/c-remote-download.png" alt="">
      </td>
    </tr>

    <tr>
      <td style="vertical-align: middle;">
      <p><b>Altres millores</b></p>
      <ul><li>Molts m&eacute;s conselles per a Java i Ruby
      </li><li>Suport per a la revisi&oacute; ortogr&agrave;fica en l'editor
      </li><li>Elements de men&uacute; d'ajuda per a informar d'errors i alentiments en contra de l'IDE NetBeans    
      </li><li>Suport per a diversos servidors de cooperaci&oacute; basats en Kenai (pex. kenai.com i netbeans.org).
      </li></ul>
      </td>
      <td style="vertical-align: middle; text-align: center; padding:10px 0 10px 0;">
      <img style="border: 1px solid ; width: 200px; height: 75px;"
           src="../../../images_www/screenshots/6.9/team-server.png" alt="">
      </td>
    </tr>

</table>

    <p><br /></p>
    <p>Conegueu m&eacute;s caracter&iacute;stiques d'aquest llan&ccedil;ament a la p&agrave;gina de <a href="http://wiki.netbeans.org/NewAndNoteworthy69">Novetats i notabilitats de l'IDE NetBeans</a>!</p>
    <p>Visiteu el <a href="../roadmap.html">Full de ruta de llan&ccedil;aments de NetBeans</a>.</p> 

  </body>
</html>
