<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<!--
  Copyright 2010, Oracle Inc. 
  All Rights Reserved.
-->

<html>
<head>
<link rel="stylesheet" type="text/css" href="../../../netbeans.css">
<link rel="stylesheet" type="text/css" media="print" href="../../../print.css">
<link rel="shortcut icon" href="https://netbeans.org/favicon.ico" type="image/x-icon" >
<title>Instruccions d'instal&middot;laci&oacute; de l'IDE NetBeans 6.9.1</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" >
<meta name="description" content="Installation Instructions for NetBeans IDE 6.9.1">
<meta name="keywords" content="NetBeans, IDE, free, open source, install notes, developer, installer, NetBeans, NetBeans IDE, NetBeans installer, NetBeans development environment" >
<style type="text/css">
<!--
.style2 {color: #000000}
-->
</style>
</head>
<body>
<a name="top"></a>
<h1>Instruccions d'instal&middot;laci&oacute; de l'IDE NetBeans 6.9.1</h1>
<div class="articledate" style="margin-left: 0px;">&Uacute;ltima actualitzaci&oacute;: <!-- #BeginDate format:Am1 -->1 de juliol de 2010<!-- #EndDate --> </div>
<p>Aquest document descriu com instal&middot;lar l'IDE NetBeans 6.9.1 al vostre ordinador. Vegeu les notes del llan&ccedil;ament de l'IDE NetBeans 6.9.1 per a m&eacute;s informaci&oacute; quant als <a href="relnotes_ca.html#system_requirements">sistemes operatius suportats i les configuracions de maquinari</a> per l'IDE. Per a con&egrave;ixer les noves funcionalitats incloses en el llan&ccedil;ament d'aquest IDE vegeu la p&agrave;gina d'<a href="index_ca.html">Informaci&oacute; del llan&ccedil;ament de l'IDE NetBeans 6.9.1</a>.</p>

<h2>Continguts</h2>
<ul>
<li><a href="#requiredsoftware" title="Programari necessari">Programari necessari</a></li>
<li><a href="#downloadoptions" title="Opcions de desc&agrave;rrega de l'instal&middot;lador">Opcions de desc&agrave;rrega de l'instal&middot;lador</a></li>
<li><a href="#customizeinstall" title="Personalitzaci&oacute; de la vostra instal&middot;laci&oacute;">Personalitzaci&oacute; de la vostra instal&middot;laci&oacute;</a></li>
<li><a href="#startdownload" title="Inici de la desc&agrave;rrega">Inici de la desc&agrave;rrega</a></li>
<li><a href="#installation" title="Instal&middot;laci&oacute; del programari">Instal&middot;laci&oacute; del programari</a><div>
<ul>
<li><a href="#install_windows">Microsoft Windows, Solaris OS i Linux</a></li>
<li><a href="#install_mac">Mac OS X</a> </li>
<li><a href="#install_zip">Paquet independent de plataforma</a> </li>
</ul>
</div></li>
<li><a href="#uninstallation" title="Des-intal&middot;laci&oacute; del programari">Des-intal&middot;laci&oacute; del programari</a></li>
<li><a href="#upgrading">Suport per actualitzaci&oacute; i instal&middot;laci&oacute; m&uacute;ltiple</a></li>
<li><a href="#troubleshooting" title="Resoluci&oacute; de problemes">Problema</a><a href="#troubleshooting" title="Resoluci&oacute; de problemes">Resoluci&oacute;</a></li>
<li><a href="#moreinformation" title="M&eacute; informaci&oacute;">M&eacute;s inf</a><a href="#moreinformation" title="M&eacute;s informaci&oacute;">formaci&oacute;</a></li>
</ul>
<h2><a name="requiredsoftware" id="requiredsoftware"></a>Programari necessari</h2>
<p>Per a instal&middot;lar l'IDE Netbeans es necessita el JDK (Java SE Development Kit) 6.0, 13&ordf; actualitzaci&oacute; o posterior. La versi&oacute; 6.9.1 de l'IDE no pot instal&middot;lar-se amb el JDK 5.0. Podeu descarregar l'&uacute;ltima actualitzaci&oacute; del JDK 6.0 a <a href="http://java.sun.com/javase/downloads/index.jsp" target="_blank">http://java.sun.com/javase/downloads</a>.
<p> Els paquets de NetBeans de PHP, Ruby i C/C++ NetBeans &uacute;nicament necessiten tenir instal&middot;lat el JRE (Java Runtime Environment) 6 per a instal&middot;lar-se i executar-se. Tanmateix, si teniu planejat utilitzar qualsevol de les caracter&iacute;stiques de Java, necessiteu el JDK 6.0. </p>
<p align="center"><a href="#top">principi</a></p>
<h2><a name="downloadoptions" id="downloadoptions"></a>Opcions de desc&agrave;rrega de l'instal&middot;lador</h2>
<p>En la <a href="https://netbeans.org/downloads/" target="_blank">p&agrave;gina de desc&agrave;rrega</a> de l'IDE NetBeans, podeu obtenir un o m&eacute;s instal&middot;ladors, cadascun cont&eacute; l'IDE base i eines addicionals.  </p>
<p>Estan disponibles els seg&uuml;ents instal&middot;ladors: </p>
<ul>
   <li><b>Java SE</b>. Suporta totes les caracter&iacute;stiques est&agrave;ndards pel desenvolupament de Java SE, aix&iacute; com suport per a la plataforma de desenvolupament RCP de NetBeans. </li>
   <li><b>JavaFX</b>. Inclou l'SDK de JavaFX 1.3.1 i l'eina de composici&oacute; de JavaFX per al desenvolupament d'aplicacions multi-plataforma de qualitats superiors.</li>
   <li><b>Java</b>. Proporciona eines per al desenvolupament d'aplicacions Java SE, Java EE i Java ME, aix&iacute; com suport per a la plataforma de desenvolupament RCP de NetBeans. Aquesta opci&oacute; de desc&agrave;rrega tamb&eacute; inclou el Servidor GlassFish OSE (Open Source Edition) 3.0.1, i Apache Tomcat 6.0.26. </li>
   <li><b>Ruby</b>. Proporciona eines pel desenvolupament Ruby i suporta Rails i JRuby. Tamb&eacute; cont&eacute; el servidor GlassFish OSE (Open Source Edition) 3.0.1.</li>
   <li><b>C/C++</b>. Suporta el desenvolupament en llenguatges C, C++, Qt, Fortran i Assemblador. </li>
   <li><b>PHP</b>. Proporciona eines pel desenvolupament de PHP 5.x, i els Frameworks Zend i Symfony.</li>
   <li><b>Tot. </b> Aquesta &eacute;s l'opci&oacute; de desc&agrave;rrega completa, la qual cont&eacute; tots els entorns d'execuci&oacute; i tecnologies que estan disponibles per a l'IDE NetBeans.  </li>
</ul>
<p align="center"><a href="#top">principi</a></p>
<h2><a name="customizeinstall"></a>Personalitzaci&oacute; de la vostra instal&middot;laci&oacute;</h2>
<p>Si descarregueu les opcions de desc&agrave;rrega Java o &quot;Tot&quot;, podeu seleccionar exactament quines eines i entorns d'execuci&oacute; a instal&middot;lar. Cliqueu a Personalitzar a la p&agrave;gina de benvinguda de l'instal&middot;lador i seleccioneu les caracter&iacute;stiques que voleu utilitzar. Per a m&eacute;s informaci&oacute;, vegeu <a href="#installation" title="Instal&middot;laci&oacute; del programari">Instal&middot;laci&oacute; del programari</a>.</p>
<p>Si voleu afegir funcionalitats al vostre IDE NetBeans, utilitzeu el gestor de complements de NetBeans. Per exemple, assumint que heu iniciat la desc&agrave;rrega i instal&middot;laci&oacute; del Pack de Ruby. Despr&eacute;s decidiu que voleu provar la funcionalitat C/C++. Per a fer-ho, dirigiu-vos al gestor de complements de NetBeans des de l'IDE (seleccioneu Eines &gt; Complements) i afegiu el pack C/C++ a la vostra instal&middot;laci&oacute; existent.</p>
<p>Hi han diverses notes importants quant a la instal&middot;laci&oacute; i configuraci&oacute; per a algunes de les caracter&iacute;stiques de l'IDE NetBeans. </p>
<ol>
  <li>Apache Tomcat 6.0.26 est&agrave; incl&oacute;s a les opcions de desc&agrave;rrega &quot;Java&quot; i &quot;Tot&quot;, no obstant aquest no s'instal&middot;la per defecte. Per a instal&middot;lar Apache Tomcat des de les desc&agrave;rregues de Java o &quot;Tot&quot;, executeu l'instal&middot;lador i seleccioneu Apache Tomcat 6.0.26 en el quadre de di&agrave;leg de personalitzar la instal&middot;laci&oacute;.</li>

  <li>Pel desenvolupament C/C++ (aplicable a les desc&agrave;rregues C/C++ i &quot;Tot&quot;), addicionalment necessiteu instal&middot;lar els compiladors i les eines. Per a m&eacute;s informaci&oacute;, referiu-vos a <a
  href="cpp-setup-instructions.html">Configuraci&oacute; de l'IDE NetBeans per a C/C++/Fortran</a>. </li>
  <li>Per a Mac OS X, podeu personalitzar la instal&middot;laci&oacute; de l'IDE NetBeans des de les desc&agrave;rregues Java, Ruby, i ''Tot''. La instal&middot;laci&oacute; de l'IDE des de les desc&agrave;rregues JavaSE, PHP, i C/C++ no pot ser personalitzada. </li>
  <li>Tamb&eacute; podeu descarregar <a href="#install_zip">un fitxer ZIP independent de plataformes</a> i llan&ccedil;ar l'IDE NetBeans des del fitxer executable. Tingueu en compte que el servidor GlassFish OSE (Open Source Edition), i Apache Tomcat &uacute;nicament estan disponibles amb els instal&middot;ladors espec&iacute;fics per a plataformes. </li>
</ol>
<p align="center"><a href="#top">principi</a></p>
<h2><a name="startdownload" id="startdownload"></a>Iniciant la desc&agrave;rrega</h2>

<ol>
<li>Aneu a <a href="https://netbeans.org/downloads/" target="_blank"> <strong>https://netbeans.org/downloads/</strong></a></li>
<li>En la part superior dreta de la p&agrave;gina, seleccioneu l'idioma i plataforma del llistat desplegable. Tamb&eacute; podeu triar de descarregar i utilitzar un fitxer zip independent de plataforma. </li>
<li>Cliqueu al bot&oacute; Descarregar per tal de descarregar l'opci&oacute; que voleu instal&middot;lar.</li>
<li>Deseu el fitxer de l'instal&middot;lador al vostre sistema.</li>
</ol>
<p align="center"><a href="#top">principi</a></p>
<h2><a name="installation"></a>Instal&middot;laci&oacute; del programari</h2>

<p>Seguiu les instruccions en aquesta secci&oacute; per instal&middot;lar l'IDE al vostre sistema. Aquestes instruccions d'instal&middot;laci&oacute; s'apliquen a totes les plataformes suportades. Per al llistat de plataformes suportades, vegeu les <a href="relnotes_ca.html">notes de la versi&oacute;</a>. </p>
<h3><a name="install_windows" id="install_windows">Microsoft Windows, Solaris OS i Linux</a></h3>
<p><b>Instal&middot;lar el programari</b></p>
  <ol>
    <li>Despr&eacute;s que es finalitzi la desc&agrave;rrega, executeu l'instal&middot;lador. 
   <ul>
    <li>Per a Windows, el fitxer executable de l'instal&middot;lador t&eacute; l'extensi&oacute; <tt>.exe</tt> Clique dos cops al fitxer de l'instal&middot;lador per a executa'l. </li>
    <li>Per a plataformes Solaris i Linux, el fitxer de l'instal&middot;lador t&eacute; l'extensi&oacute; <tt>.sh</tt> Per a aquestes plataformes, necessiteu que el fitxer de l'insta&middot;lador sigui executable mitjan&ccedil;ant la seg&uuml;ent comanda: <tt> chmod +x &lt;<i>nom-fitxer-intal&middot;lador</i>&gt;</tt></li>
   </ul>
  </li>
    <li>Per triar les eines i els entorns d'execuci&oacute; a instal&middot;lar, realitzeu els seg&uuml;ents passos en la p&agrave;gina de benvinguda de l'assistent d'instal&middot;laci&oacute;:
      <ol type="a">
         <li>Cliqueu a Personalitzar.</li>
         <li>En el quadre de di&agrave;leg de personalitzaci&oacute; de la instal&middot;laci&oacute;, feu les seg&uuml;ents seleccions.</li>
         <li>Cliqueu a Acceptar.</li>
       </ol>
    </li>
     <li>A la p&agrave;gina de benvinguda de l'assistent d'instal&middot;laci&oacute;, Cliqueu a Seg&uuml;ent.</li>
     <li>En la p&agrave;gina d'acceptaci&oacute; dels acords de llic&egrave;ncia, reviseu els acords de llic&egrave;ncia, cliqueu a la casella d'acceptaci&oacute;, i cliqueu a Seg&uuml;ent.</li>
     <li>A la p&agrave;gina d'instal&middot;laci&oacute; de NetBeans, feu el seg&uuml;ent:
       <ol type="a">
      <li>Accepteu el directori predeterminat d'instal&middot;laci&oacute; pel IDE NetBeans o b&eacute; especifiqueu un altre directori.
         <p><b>Nota:</b> El directori d'instal&middot;laci&oacute; ha d'estar buit i el perfil d'usuari amb el qual esteu executant l'instal&middot;lador ha de tenir permisos de lectura/escriptura per a aquest directori.</p></li>
      <li>Accepteu la instal&middot;laci&oacute; del JDK predeterminat per a utilitzar amb NetBeans, o b&eacute; seleccioneu una instal&middot;laci&oacute; diferent des del llistat desplegable. Si l'assistent d'instal&middot;laci&oacute; no va trobar cap instal&middot;laci&oacute; de JDK compatible per a utilitzar amb l'IDE NetBeans, el vostre JDK no est&agrave; instal&middot;lat a la localitzaci&oacute; predeterminada. En aquest cas, especifiqueu la ruta a un JDK instal&middot;lat i cliqueu a Seg&uuml;ent, o b&eacute; cancel&middot;leu la instal&middot;laci&oacute; actual. Despr&eacute;s d'haver instal&middot;lat la versi&oacute; del JDK necess&agrave;ria, podeu reiniciar la instal&middot;laci&oacute;.</li>
        </ol>
   <li>Si s'obre la p&agrave;gina d'instal&middot;laci&oacute; del servidor GlassFish OSE (Open Source Edition) 3.0.1, accepteu el directori d'instal&middot;laci&oacute; predeterminat o b&eacute; especifiqueu-ne un altre.</li>
   <li>Si esteu instal&middot;lant Tomcat d'Apache, en la seva p&agrave;gina d'instal&middot;laci&oacute;, accepteu el directori predeterminat d'instal&middot;laci&oacute; o b&eacute; especifiqueu una altra localitzaci&oacute; d'instal&middot;laci&oacute;. </li>
   <li>En la p&agrave;gina del resum, verifiqueu que el llistat de components a ser instal&middot;lats siguin correctes i que tingueu l'espai adequat en el vostre sistema per a la instal&middot;laci&oacute;.</li>
   <li>Cliqueu a Instal&middot;lar per a comen&ccedil;ar la instal&middot;laci&oacute;.</li>
  </ol>
<p class="notes"><b>Nota:</b> Si us trobeu amb problemes durant la completaci&oacute; de la instal&middot;laci&oacute;, vegeu la <a href="#troubleshooting">Resoluci&oacute; de problemes</a> per a descripcions i solucions suggerides per a incid&egrave;ncies sense resoldre que poden afectar al proc&eacute;s d'instal&middot;laci&oacute;. </p>
<h3><a name="install_mac" id="install_mac">Mac OS X</a></h3>
<p><b>Instal&middot;lar programari</b></p>
<ol>
  <li>Despr&eacute;s que es finalitzi la desc&agrave;rrega, executeu l'instal&middot;lador. El fitxer d'instal&middot;laci&oacute; t&eacute; l'extensi&oacute; <tt>.dmg</tt>. </li>
  <li>Al panell que s'obre cliqueu a la icona del paquet. El paquet t&eacute; l'extensi&oacute; <tt>.mpkg</tt>. L'assistent d'instal&middot;laci&oacute; s'inicia.</li>
  <li>A la p&agrave;gina de benvinguda de l'assistent d'instal&middot;laci&oacute;, cliqueu a Continuar.</li>
  <li>Reviseu els acords de llic&egrave;ncia i cliqueu a Continuar. Cliqueu Acceptar a la finestra emergent per a acceptar la llic&egrave;ncia.</li>
  <li>A la p&agrave;gina de Selecci&oacute; d'una destinaci&oacute;, seleccioneu la unitat i cliqueu a Continuar. </li>
  <li>Si heu descarregat el paquet Tot, Java o Ruby, podeu personalitzar la instal&middot;laci&oacute;. En l'&uacute;ltim panell de l'assistent d'instal&middot;laci&oacute;, premeu al bot&oacute; Personalitzar de la part inferior esquerra del panell. Es mostra l'arbre de productes.  </li>
  <li>Seleccioneu el producte que voleu instal&middot;lar.</li>
  <li>Introdu&iuml;u el nom i la contrasenya de l'administrador pel vostre sistema i cliqueu a Acceptar per a comen&ccedil;ar la instal&middot;laci&oacute;.</li>
</ol>

<h3><a name="install_zip" id="install_zip">Paquet independent de plataforma</a></h3>
<p><b>Executar el programari</b></p>
<ol>
  <li>Despr&eacute;s que es finalitzi la desc&agrave;rrega del fitxer zip independent de plataforma, extraieu-ho a a qualsevol carpeta del vostre sistema. </li>
  <li>Executeu el fitxer executable localitzat al directori <tt>netbeans/bin</tt>. </li>
  <li>Accepteu l'acord de llic&egrave;ncia. El IDE NetBeans s'inicia. </li>
</ol>
<p><span class="notes"><b>Nota</b>: Si no es pot trobar una instal&middot;laci&oacute; compatible del JDK, potser haureu d'especificar manualment la ruta al directori d'instal&middot;laci&oacute; del JDK tot fent el seg&uuml;ent:</span></p>
<ol>
  <li>Obriu el fitxer <tt>netbeans.conf</tt> situat al directori <tt>netbeans/etc</tt> amb un editor de text.</li>
  <li>Introdu&iuml;u una localitzaci&oacute; d'instal&middot;laci&oacute; del JDK compatible per a l'opci&oacute; <tt>netbeans_jdkhome</tt>. La localitzaci&oacute; predeterminada a Windows &eacute;s <tt>C:\Program Files\Java\jdk1.6.0</tt>.</li>
  <li>Deseu el fitxer <tt>netbeans.conf</tt> i executeu el fitxer executable del directori <tt>netbeans/bin</tt>.</li>
</ol>
<p><span class="notes"><b>Nota</b>: El servidor GlassFish OSE (Open Source Edition), i Apache Tomcat, &uacute;nicament estan disponibles amb els instal&middot;ladors espec&iacute;fics per a plataformes.</span></p>

<p align="center"><a href="#top">principi</a></p>
<h2><a name="uninstallation">Desinstal&middot;laci&oacute; del programari</a></h2>
<p>Seguiu les seg&uuml;ents instruccions, incloses en aquesta secci&oacute;, per a desinstal&middot;lar l'IDE del vostre ordinador. Aquestes instruccions de desinstal&middot;laci&oacute; s'apliquen a totes les plataformes suportades. Per al llistat de plataformes suportades, vegeu les <a href="relnotes_ca.html">notes de la versi&oacute;</a>.</p>
<div>
<h3><a name="uninstall_windows">Microsoft Windows</a></h3>
<p>Si fos necessari, podeu desinstal&middot;lar l'IDE NetBeans, el servidor GlassFish OSE (Open Source Edition) 3.0.1, i Apache Tomcat, utilitzant els seg&uuml;ent procediments.</p>
<p><b>Desinstal&middot;lar l'IDE</b>:</p>
<ol>
  <li>Atureu l'IDE.
  </li>
  <li>Des del Taulell de control, seleccioneu Afegir i treure programes, despr&eacute;s seleccioneu l'IDE NetBeans 6.9.1 i cliqueu a treure.</li>
</ol>
<p><b>Per a desinstal&middot;lar el Servidor GlassFish OSE (Open Source Edition) 3.0.1: </b></p>
<ol>
  <li>Atureu l'IDE.</li>
  <li>Des del Taulell de control, seleccioneu Afegir i treure programes, despr&eacute;s seleccioneu el Servidor GlassFish OSE (Open Source Edition) 3.0.1 i cliqueu a treure.</li>
</ol>
<p><b>Desinstal&middot;lat Tomcat d'Apache: </b></p>

<ol>
  <li>Atureu l'IDE.</li>
  <li>Des del Taulell de control, seleccioneu Afegir i treure programes, despr&eacute;s seleccioneu Apache Tomcat 6.0.26 i cliqueu a treure.</li>
</ol>
</div>
<div>
<h3><a name="uninstall_sollinux">Sistema Operatiu Solaris, Linux</a></h3>
<p>Si fos necessari, podeu desinstal&middot;lar l'IDE NetBeans, el servidor GlassFish OSE (Open Source Edition) 3.0.1, i Apache Tomcat, utilitzant els seg&uuml;ent procediments.</p>
<p><b>Desinstal&middot;lar l'IDE</b>:</p>

<ol>
  <li>Atureu l'IDE.</li>
  <li>En el directori d'instal&middot;laci&oacute; de l'IDE, executeu el fitxer <tt>uninstall.sh</tt>. </li>
  <li>Per a desinstal&middot;lar GlassFish and Tomcat, juntament amb l'IDE, assegure-vos que en la p&agrave;gina del resum, les versions mostrades siguin les correctes, i que estiguin marcades les caselles adequades. </li>
  <li>A la p&agrave;gina de resum, cliqueu a desinstal&middot;lar. 
  </li>
  <li>Despr&eacute;s que es finalitzi la desinstal&middot;laci&oacute;, cliqueu a Finalitzar.</li>
</ol>
<p><b>Per a desinstal&middot;lar el Servidor GlassFish OSE (Open Source Edition) 3.0.1</b>:</p>
<ol>
  <li>Atureu l'IDE.</li>
  <li>Localitzeu el directori d'instal&middot;laci&oacute; del servidor d'aplicacions.
  <p><b>Nota</b>: La localitzaci&oacute; d'instal&middot;laci&oacute; predeterminada pot variar, dep&egrave;n del tipus d'instal&middot;laci&oacute; i de la plataforma. La seg&uuml;ent taula mostra el directori predeterminat d'instal&middot;laci&oacute; del servidor d'aplicacions en diverses plataformes.</p>

  <table>
    <tbody>
        <tr class="tblheader">
            <th width="70">Plataforma</th>
            <th width="101">Instal&middot;lat com...</th>
			<th width="264">Instal&middot;laci&oacute; de GlassFish 3.0.1</th>
        </tr>
        <tr class="tbltd0">
          <td>Windows</td>
          <td>usuari amb permisos d'administraci&oacute;</td>
          <td><tt>%ProgramFiles%\glassfish-3.0.1</tt></td>
        </tr>
        <tr class="tbltd0">
          <td>Windows</td>
          <td>usuari</td>
          <td><tt>%USERPROFILE%\glassfish-3.0.1</tt></td>
        </tr>
        <tr class="tbltd0">
            <td>Sistema Operatiu Solaris</td>
            <td>root</td>
			 <td><tt>/opt/glassfish-3.0.1</tt></td>
        </tr>
        <tr class="tbltd1">

            <td>Sistema Operatiu Solaris, Linux</td>
            <td valign="top">usuari</td>
			<td valign="top"><tt>~/glassfish-3.0.1</tt></td>
        </tr>
        <tr class="tbltd0">
            <td>Linux</td>
            <td>root</td>
			<td><tt>/usr/local/glassfish-3.0.1</tt></td>
        </tr>
    </tbody>
</table>
  </li>
  <li>En el directori d'instal&middot;laci&oacute; del servidor d'aplicacions, executeu el fitxer <tt>uninstall.sh</tt>.</li>

  <li>A la p&agrave;gina de resum, cliqueu a desinstal&middot;lar.
  </li>
  <li>Despr&eacute;s que finalitzi la desinstal&middot;laci&oacute;, cliqueu a Finalitzar.</li>
</ol>
<p><b>Desinstal&middot;lar Tomcat d'Apache: </b></p>
<ol>
  <li>Atureu l'IDE.</li>

  <li>Localitzeu el directori d'instal&middot;laci&oacute; de Tomcat d'Apache i executeu el fitxer <tt>uninstall.sh</tt>. 
  </li>
  <li>A la p&agrave;gina de resum, cliqueu a desinstal&middot;lar. </li>
  <li>Despr&eacute;s que finalitzi la desinstal&middot;laci&oacute;, cliqueu a Finalitzar.</li>
</ol>
</div>

<div>
<h3><a name="uninstall_mac" id="uninstall_mac">Mac OS X</a></h3>
<p><b>Per a desinstal&middot;lar l'IDE i el servidor d'aplicacions</b>:</p>
<ol>
  <li>Atureu el programari.</li>
  <li>Arrossegueu les carpetes o fitxers del programa cap a la paperera. Denoteu que la localitzaci&oacute; predeterminada de l'IDE i el servidor d'aplicacions &eacute;s <tt>/Applications/NetBeans/</tt>.  </li>
</ol>
</div>

<div>
<h3><a name="uninstall_zip" id="uninstall_zip">Paquet independent de plataforma</a></h3>
<p>Per a desinstal&middot;lar els fitxers de l'IDE, seguiu els passos descrits en la secci&oacute; <a href="#clean">Neteja despr&eacute;s d'una instal&middot;laci&oacute; incompleta</a> d'aquest document. </p>
</div>

<p align="center"><a href="#top">principi</a></p>

<h2><a name="upgrading"></a>Suport d'actualitzaci&oacute; i instal&middot;laci&oacute; m&uacute;ltiple</h2>
<p>En el mateix sistema poden coexistir m&uacute;ltiples instal&middot;lacions de l'IDE NetBeans 5.x i 6.x amb l'IDE NetBeans 6.9.1. No teniu que desinstal&middot;lar les versions anteriors per a poder instal&middot;lar o executar l'IDE NetBeans 6.9.1. </p>
<p>Si ja disposeu d'una versi&oacute; instal&middot;lada de l'IDE NetBeans, quant executeu l'IDE NetBeans 6.9.1 per primer cop, podeu triar importar o no les prefer&egrave;ncies d'usuari existent del directori d'usuari existent.</p>
<p><span class="notes"><b>Nota</b>: En aquest moment no es poden realitzar les actualitzacions de versions incrementals de l'IDE. Per actualitzar a la versi&oacute; m&eacute;s recent heu de descarregar l'&uacute;ltim instal&middot;lador.</span></p>
<p align="center"><a href="#top">principi</a></p>
<h2><a name="troubleshooting" id="troubleshooting"></a>Resoluci&oacute; de problemes</h2>
<div>
<h3>Quant al directori de treball de l'instal&middot;lador</h3>
<p>L'instal&middot;lador emmagatzema dades quant a les sessions d'instal&middot;laci&oacute; en el directori de treball de l'instal&middot;lador. Exemples d'aquestes dades s&oacute;n el llistat de components instal&middot;lats al vostre sistema, missatges de registre d'instal&middot;laci&oacute;, i dades de registre. </p>

<p>La localitzaci&oacute; predeterminada pel directori de treball de l'instal&middot;lador &eacute;s <tt>%USERPROFILE%\.nbi</tt> en Windows i <tt>~/.nbi</tt> en altres plataformes. El sub-directori de registre cont&eacute; els fitxers de registre de la instal&middot;laci&oacute;. </p>
</div>
<div>
<h3><a name="clean"></a>Neteja despr&eacute;s d'una instal&middot;laci&oacute; incompleta</h3>
<p>Despr&eacute;s d'una instal&middot;laci&oacute; incompleta o insatisfact&ograve;ria, potser haureu de netejar el vostre sistema d'instal&middot;lacions pr&egrave;vies. </p>
<p><b>Per a Microsoft Windows, Solaris, i Linux:</b></p>
<ol>

  <li>Elimineu el directori de treball de l'instal&middot;lador.</li>
  <li>Elimineu els directoris d'instal&middot;laci&oacute; de l'IDE i del servidor d'aplicacions de GlassFish.</li>
  <li>En la plataforma Windows, elimineu totes les entrades al registre <tt>nbi*</tt> des de les seg&uuml;ents claus de registre: <tt>HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall</tt> <tt>HKEY_CURRENT_USER\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall</tt> </li>

</ol>
<p><b>Per Mac OS X:</b></p>
<ul>
  <li>Arrossegueu les carpetes o fitxers de programa a la paperera. </li>
</ul>
</div>
<div>
<h3>Deshabilitar alguns programes abans de la instal&middot;laci&oacute;</h3>
<p>&Eacute;s millor deshabilitar el talla focs, l'antivirus i les aplicacions de monitoritzaci&oacute; abans que inicieu la instal&middot;laci&oacute;. Algunes d'aquestes aplicacions poden impedir que els components de l'IDE siguin configurats correctament durant el proc&eacute;s d'instal&middot;laci&oacute;. </p>
<p>Per exemple, Si teniu l'aplicaci&oacute; de monitoritzaci&oacute; de processos de Logitech (<tt>LVPrcSrv.exe</tt>) executant-se al vostre sistema, atureu-la abans de la instal&middot;laci&oacute;. </p>

</div>
<p align="center"><a href="#top">principi</a></p>
<h2><a name="moreinformation"></a>M&eacute;s informaci&oacute;</h2>

<ul>
<li><a href="index_ca.html">Informaci&oacute; del llan&ccedil;ament de l'IDE NetBeans 6.9.1</a></li>
<li><a href="relnotes_ca.html">Notes del llan&ccedil;ament de l'IDE NetBeans 6.9.1</a></li>
<li><a href="http://wiki.netbeans.org/NetBeansUserFAQ#Installation" target="_blank">Preguntes m&eacute;s freq&uuml;ents en la instal&middot;laci&oacute; de l'IDE NetBeans</a></li>
</ul>
<div class="feedback-box"><a href="https://netbeans.org/about/contact_form.html?to=3&subject=Feedback: NetBeans IDE 6.9.1 Installation Instructions">Envia'ns la vostra opini&oacute;</a>
</div>
<br style="clear:both;">
<p align="center"><a href="#top">principi</a></p>
</body>
</html>
