<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<!--
  Copyright 2010, Oracle Inc. 
  All Rights Reserved.
-->

<html>
<head>
<link rel="stylesheet" type="text/css" href="../../../netbeans.css">
<link rel="stylesheet" type="text/css" media="print" href="../../../print.css">
<link rel="shortcut icon" href="https://netbeans.org/favicon.ico" type="image/x-icon" >
<title>Instructions d'installation de NetBeans IDE 6.9</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" >
<meta name="description" content="Installation Instructions for NetBeans IDE 6.9">
<meta name="keywords" content="NetBeans, IDE, free, open source, install notes, developer, installer, NetBeans, NetBeans IDE, NetBeans installer, NetBeans development environment" >
<style type="text/css">
<!--
.style2 {color: #000000}
-->
</style>
</head>
<body>
<a name="top"></a>
<h1>Instructions d'installation de NetBeans IDE 6.9</h1>
<div class="articledate" style="margin-left: 0px;">Derni&egrave;re mise &agrave; jour&nbsp;: <!-- #BeginDate format:Am1 -->8 juin 2010<!-- #EndDate --> </div>
<p>Ce document d&eacute;crit les proc&eacute;dures d'installation de NetBeans IDE 6.8 sur votre syst&egrave;me. Veuillez consulter les notes de version de NetBeans IDE 6.9 pour obtenir de plus amples informations sur les <a href="relnotes.html#system_requirements">syst&egrave;mes d''exploitation et les configurations mat&eacute;rielles pris en charge</a> par l''environnement de d&eacute;veloppement int&eacute;gr&eacute; (IDE) Pour en savoir plus sur les nouvelles fonctionnalit&eacute;s incluses dans cette version de l''EDI, reportez-vous &agrave; la page <a href="index.html">Information de version pour NetBeans IDE 6.9</a></p>

<h2>Sommaire</h2>
<ul>
<li><a href="#requiredsoftware" title="Logiciels requis">Logiciels requis</a></li>
<li><a href="#downloadoptions" title="Options de t&eacute;l&eacute;chargement du programme d'installation">Options de t&eacute;l&eacute;chargement du programme d'installation</a></li>
<li><a href="#customizeinstall" title="Personnalisation de votre installation">Personnalisation de votre installation</a></li>
<li><a href="#startdownload" title="Lancement du t&eacute;l&eacute;chargement">Lancement du t&eacute;l&eacute;chargement</a></li>
<li><a href="#installation" title="Installation du logiciel">Installation du logiciel</a><div>
<ul>
<li><a href="#install_windows">Microsoft Windows, SE Solaris et Linux</a></li>
<li><a href="#install_mac">Mac OS X</a> </li>
<li><a href="#install_zip">Package ind&eacute;pendant de la plate-forme</a> </li>
</ul>
</div></li>
<li><a href="#uninstallation" title="D&eacute;sinstallation du logiciel">D&eacute;sinstallation du logiciel</a></li>
<li><a href="#upgrading">Cohabitation de plusieurs version de NetBeans IDE</a></li>
<li><a href="#troubleshooting" title="D&eacute;pannage">D&eacute;pann</a><a href="#troubleshooting" title="D&eacute;pannage">age</a></li>
<li><a href="#moreinformation" title="Plus d'informations">Plus</a><a href="#moreinformation" title="Plus d'informations">d'informations</a></li>
</ul>
<h2><a name="requiredsoftware" id="requiredsoftware"></a>Logiciels requis</h2>
<p>La version Java SE Development Kit (JDK) 6.0 Update 13 ou version ult&eacute;rieure est requis pour installer l'EDI NetBeans. La version 6.9 de l'IDE ne peut pas &ecirc;tre install&eacute;e avec JDK 5.0. Vous devez t&eacute;l&eacute;charger la derni&egrave;re version du JDK 6.0 sur <a href="http://java.sun.com/javase/downloads/index.jsp" target="_blank">http://java.sun.com/javase/downloads</a>
<p> Les kits PHP, Ruby et C/C++ de Netbeans seuls n&eacute;cessitent l''installation du runtime Java JRE 6. Cependant, si vous voulez utiliser n'importe quelle fonctionnalit&eacute; de Java, vous devrez avoir la version JDK 6.0 install&eacute;e. </p>
<p align="center"><a href="#top">Haut</a></p>
<h2><a name="downloadoptions" id="downloadoptions"></a>Options de t&eacute;l&eacute;chargement du programme d'installation</h2>
<p>Sur la <a href="https://netbeans.org/downloads/" target="_blank">page de t&eacute;l&eacute;chargement</a> de NetBeans&nbsp;IDE, vous pouvez choisir entre plusieurs programmes d'installation disponibles, chacun contenant l'EDI de base et des outils suppl&eacute;mentaires.  </p>
<p>Les programmes d'installation suivants sont disponibles&nbsp;: </p>
<ul>
   <li><b>Java SE</b>. Int&egrave;gre toutes les fonctions standards de d&eacute;veloppement Java SE comme support pour la plateforme de d&eacute;veloppement Netbeans RCP.</li>
   <li><b>JavaFX</b>. Prend en charge le d&eacute;veloppement d'applications riches multiplate-forme JavaFX.</li>
   <li><b>Java</b>. Fournit aussi bien les outils pour le d&eacute;veloppement d''applications Java SE, Java EE et Java ME que le support de la plateforme de d&eacute;veloppement Netbeans RCP. Cette option de t&eacute;l&eacute;chargement contient GlassFish Server Open Source Edition 3.0.1 et Apache Tomcat 6.0.26. </li>
   <li><b>Ruby</b>. Fournit des outils de d&eacute;veloppement Ruby et prend en charge Rails et JRuby. Il contient aussi GlassFish Server Open Source Edition 3.0.1</li>
   <li><b>C/C++</b>. Prend en charge le d&eacute;veloppement dans les langages C, C++, Qt, Fortran et Assembly. </li>
   <li><b>PHP</b>. Fournit des outils de d&eacute;veloppement PHP 5.x, Symfony et Zend Framework.</li>
   <li><b>Tout. </b> Cette option de t&eacute;l&eacute;chargement est la plus compl&egrave;te. Elle contient toutes les ex&eacute;cutions et tous les packages disponibles pour NetBeans IDE.  </li>
</ul>
<p align="center"><a href="#top">Haut</a></p>
<h2><a name="customizeinstall"></a>Personnalisation de votre installation</h2>
<p>Si vous t&eacute;l&eacute;chargez Java ou utilisez l'option de t&eacute;l&eacute;chargement &quot;Tout&quot;, vous pouvez choisir exactement quels outils et ex&eacute;cutions installer. Cliquez sur Personnaliser sur la page d'accueil du programme d'installation et s&eacute;lectionnez les fonctionnalit&eacute;s que vous souhaitez utiliser. Pour plus d'informations, reportez-vous &agrave; la section <a href="#installation" title="Installation du logiciel">Installation du logiciel</a>.</p>
<p>Si vous souhaitez ajouter des fonctionnalit&eacute;s &agrave; la configuration de NetBeans&nbsp;IDE, utilisez le Gestionnaire de plug-ins NetBeans. Par exemple, si vous commencez par t&eacute;l&eacute;charger et installer l'&eacute;l&eacute;ment Ruby, puis d&eacute;cidez d'essayer la fonctionnalit&eacute; C/C++&nbsp;: ouvrez le Gestionnaire de plug-ins NetBeans dans l'EDI (choisissez Outils &gt; Plug-ins) et ajoutez l'&eacute;l&eacute;ment C/C++ &agrave; votre installation existante.</p>
<p>Il est important de noter les &eacute;l&eacute;ments suivants relatifs &agrave; l'installation et la configuration de certaines fonctionnalit&eacute;s NetBeans&nbsp;IDE&nbsp;: </p>
<ol>
  <li>Apache Tomcat 6.0.26 est inclus dans les options de t&eacute;l&eacute;chargement &quot;Java&quot; et &quot;Tout&quot; mais n'est pas install&eacute; par d&eacute;faut &agrave; partir de ces options. Pour installer Apache Tomcat &agrave; partir de l'option de t&eacute;l&eacute;chargement &quot;Java&quot; ou &quot;Tout&quot;, lancer l'installeur et s&eacute;lectionner Apache Tomcat 6.0.26 dans la bo&icirc;te de dialogue de personnalisation d'installation.</li>

  <li>Pour le d&eacute;veloppement C/C++ (applicable pour les options de t&eacute;l&eacute;chargement C/C++ et Tout), vous devez en outre installer des compilateurs et des outils. Pour plus d'informations, reportez-vous &agrave; la section <a
  href="cpp-setup-instructions.html">Configuring the NetBeans IDE for C/C++/Fortran</a>. </li>
  <li>Pour Mac&nbsp;OS&nbsp;X, vous pouvez personnaliser l'installation de NetBeans&nbsp;IDE &agrave; partir des options de t&eacute;l&eacute;chargement Java, Ruby et Tout. L'installation de l'EDI &agrave; partir des options de t&eacute;l&eacute;chargement JavaSE, PHP et C/C++ ne peut pas &ecirc;tre personnalis&eacute;e. </li>
  <li>Vous pouvez aussi t&eacute;l&eacute;charger <a href="#install_zip"> un fichier zip de la plateforme ind&eacute;pendante </a> et ex&eacute;cuter le fichier ex&eacute;cutable de Netbeans IDE. Notez que GlassFish Server Open Source Edition et Apache Tomcat sont seulement disponibles avec les installeurs sp&eacute;cifiques &agrave; la plateforme. </li>
</ol>
<p align="center"><a href="#top">Haut</a></p>
<h2><a name="startdownload" id="startdownload"></a>Lancement du t&eacute;l&eacute;chargement</h2>

<ol>
<li>Aller &agrave; <a href="https://netbeans.org/downloads/" target="_blank"> <strong>https://netbeans.org/downloads/</strong></a></li>
<li>Dans la partie sup&eacute;rieure droite de la page, s&eacute;lectionnez la langue et la plate-forme dans la liste d&eacute;roulante. Vous pouvez &eacute;galement choisir de t&eacute;l&eacute;charger et d'utiliser le fichier zip ind&eacute;pendant de la plate-forme. </li>
<li>Cliquez sur le bouton de t&eacute;l&eacute;chargement correspondant &agrave; l'option que vous souhaitez installer.</li>
<li>Enregistrez le fichier du programme d'installation sur votre syst&egrave;me.</li>
</ol>
<p align="center"><a href="#top">Haut</a></p>
<h2><a name="installation"></a>Installation du logiciel</h2>

<p>Suivez les instructions de cette section pour installer l'EDI sur votre syst&egrave;me. Ces instructions d'installation s'appliquent &agrave; toutes les plates-formes prises en charge. Pour consulter la liste des plates-formes prises en charge, reportez-vous aux <a href="relnotes.html">Notes de version</a>. </p>
<h3><a name="install_windows" id="install_windows">Microsoft Windows, SE Solaris et Linux</a></h3>
<p><b>Pour installer le logiciel&nbsp;:</b></p>
  <ol>
    <li>Une fois le t&eacute;l&eacute;chargement termin&eacute;, ex&eacute;cutez le programme d'installation. 
   <ul>
    <li>Sous Windows, le fichier ex&eacute;cutable du programme d'installation porte l'extension <tt>.exe</tt>. Double-cliquez sur le fichier du programme d'installation pour l'ex&eacute;cuter. </li>
    <li>Pour les plates-formes Solaris et Linux, le fichier du programme d'installation porte l'extension <tt>.sh</tt>. Pour ces plates-formes, vous devez rendre les fichiers du programme d'installation ex&eacute;cutables &agrave; l'aide de la commande suivante&nbsp;: <tt> chmod +x &lt;<i>nom-fichier-programme-installation</i>&gt;</tt></li>
   </ul>
  </li>
    <li>Pour choisir les outils et ex&eacute;cutions &agrave; installer, ex&eacute;cutez les &eacute;tapes suivantes &agrave; partir de la page d'accueil de l'assistant d'installation&nbsp;:
      <ol type="a">
         <li>Cliquez sur Personnaliser.</li>
         <li>Dans la bo&icirc;te de dialogue Personnaliser l'installation, effectuez vos s&eacute;lections.</li>
         <li>Cliquez sur OK.</li>
       </ol>
    </li>
     <li>Sur la page d'accuiel de l'assistant d'installation, cliquez sur Suivant.</li>
     <li>A la page d''accord de licence, lire l'accord de licence, cliquer sur la case &agrave; cocher d'acceptation et cliquer sur Suivant.</li>
     <li>Sur la page d'installation de NetBeans&nbsp;IDE, proc&eacute;dez comme suit&nbsp;:
       <ol type="a">
      <li>Acceptez le r&eacute;pertoire d'installation par d&eacute;faut pour NetBeans&nbsp;IDE ou sp&eacute;cifiez un autre r&eacute;pertoire.
         <p><b>Note:</b> Le r&eacute;pertoire d''installation doit &ecirc;tre vide et l''utilisateur doit avoir les droits de lecture/&eacute;criture pour ce r&eacute;pertoire.</p></li>
      <li>Acceptez le JDK par d&eacute;faut &agrave; utiliser avec NetBeans&nbsp;IDE ou s&eacute;lectionnez une autre installation dans la liste d&eacute;roulante. Si l'assistant d'installation n'a pas trouv&eacute; d'installation JDK compatible &agrave; utiliser avec NetBeans&nbsp;IDE, votre JDK n'est pas install&eacute; dans l'emplacement par d&eacute;faut. Dans ce cas, sp&eacute;cifier le chemin d'un JDK install&eacute; et cliquer Suivant ou annuler l'installation en cours. Apr&egrave;s l'installation de la version JDK requise vous pouvez red&eacute;marrer l'installation.</li>
        </ol>
   <li>Si la page d''installation GlassFish Server Open Source Edition 3.0.1 s''ouvre, accepter le r&eacute;pertoire d''installation par d&eacute;faut ou sp&eacute;cifier un autre emplacement.</li>
   <li>Si vous installez Apache Tomcat, acceptez le r&eacute;pertoire d'installation par d&eacute;faut ou indiquez un autre emplacement d'installation sur la page d'installation. </li>
   <li>Sur la page r&eacute;capitulative, v&eacute;rifiez que la liste des composants &agrave; installer est correcte et que l'espace disponible sur votre syst&egrave;me est suffisant pour l'installation.</li>
   <li>Cliquez sur Installer pour commencer l'installation.</li>
  </ol>
<p class="notes"><b>Remarque&nbsp;:</b> si vous rencontrez des probl&egrave;mes lors de l'installation du logiciel, reportez-vous &agrave; la section <a href="#troubleshooting">D&eacute;pannage</a> pour consulter les descriptions et solutions de contournement sugg&eacute;r&eacute;es relatifs aux probl&egrave;mes non r&eacute;solus susceptibles d'affecter la proc&eacute;dure d'installation. </p>
<h3><a name="install_mac" id="install_mac">Mac OS X</a></h3>
<p><b>Pour installer le logiciel&nbsp;:</b></p>
<ol>
  <li>Une fois le t&eacute;l&eacute;chargement termin&eacute;, ex&eacute;cutez le programme d'installation. Le fichier du programme d'installation porte l'extension <tt>.dmg</tt>. </li>
  <li>Cliquez sur l'ic&ocirc;ne du package dans les fen&ecirc;tres qui s'ouvrent. Le package porte l'extension <tt>.mpkg</tt>. L'assistant d'installation d&eacute;marre.</li>
  <li>Sur la page d'accueil de l'assistant d'installation, cliquez sur Continuer.</li>
  <li>Lisez le contrat de licence et cliquez sur Continuer. Cliquez sur Accepter dans la fen&ecirc;tre contextuelle pour accepter la licence.</li>
  <li>Sur la page de s&eacute;lection de la destination, choisissez le lecteur et cliquez sur Continuer. </li>
  <li>Si vous avez choisi l'option de t&eacute;l&eacute;chargement Tout, Java ou Ruby, vous pouvez personnaliser votre installation. Sur la derni&egrave;re fen&ecirc;tre de l'assistant d'installation, cliquez sur le bouton Personnaliser en bas &agrave; gauche. L'arborescence des produits s'affiche.  </li>
  <li>S&eacute;lectionnez les produits &agrave; installer.</li>
  <li>Saisissez le nom et le mot de passe administrateur de votre syst&egrave;me et cliquez sur OK pour commencer l'installation.</li>
</ol>

<h3><a name="install_zip" id="install_zip">Package ind&eacute;pendant de la plate-forme</a></h3>
<p><b>Pour ex&eacute;cuter le logiciel&nbsp;:</b></p>
<ol>
  <li>Une fois le t&eacute;l&eacute;chargement du fichier ZIP ind&eacute;pendant de la plate-forme termin&eacute;, extrayez-le dans n'importe quel dossier de votre syst&egrave;me. </li>
  <li>Ex&eacute;cutez le fichier ex&eacute;cutable situ&eacute; dans le r&eacute;pertoire <tt>netbeans/bin</tt>. </li>
  <li>Acceptez le contrat de licence. NetBeans&nbsp;IDE se lance. </li>
</ol>
<p><span class="notes"><b>Note</b>:Si une installation de JDK compatible n''existe pas, vous devriez ajouter manuellement un chemin vers le r&eacute;pertoire d''installation JDK en faisant ceci:</span></p>
<ol>
  <li>Ouvrir le <tt>fichier netbeans.conf</tt> situ&eacute; dans le r&eacute;pertoire <tt>netbeans/etc</tt>dans un &eacute;diteur de texte.</li>
  <li>Entrer l''emplacement de l''installation de JDK compatible pour l''option <tt>netbeans_jdkhome</tt>. L''emplacement par d&eacute;faut dans Windows est <tt>C:\Program Files\Java\jdk1.6.0</tt>.</li>
  <li>Enregistrer le fichier<tt>netbeans.conf</tt> et ex&eacute;cuter le fichier dans le r&eacute;pertoire<tt>netbeans/bin</tt>.</li>
</ol>
<p><span class="notes"><b>Note</b>: GlassFish Server Open Source Edition et Apache Tomcat sont disponible seulement avec les installeurs sp&eacute;cifiques &agrave; la plateforme.</span></p>

<p align="center"><a href="#top">Haut</a></p>
<h2><a name="uninstallation">D&eacute;sinstallation du logiciel</a></h2>
<p>Suivre les instructions dans cette section pour d&eacute;sinstaller l''EDI de votre syst&egrave;me. Ces instructions de d&eacute;sinstallation s'appliquent &agrave; toutes les plateformes support&eacute;es. Pour consulter la liste des plates-formes prises en charge, reportez-vous aux <a href="relnotes.html">Notes de version</a>.</p>
<div>
<h3><a name="uninstall_windows">Microsoft Windows</a></h3>
<p>Si n&eacute;cessaire, vous pouvez d&eacute;sinstaller l'EDI Netbeans,lassFish Server Open Source Edition 3.0.1 et Apache Tomcat en utilisant les proc&eacute;dures suivantes. </p>
<p><b>Pour d&eacute;sinstaller l'EDI</b>&nbsp;:</p>
<ol>
  <li>Arr&ecirc;tez l'EDI.
  </li>
  <li>A partir du panneau de configuration, s&eacute;lectionner Ajout/Suppression de programmes puis s&eacute;lectionner Netbeans IDE 6.9 et cliquer Supprimer.</li>
</ol>
<p><b>Pour d&eacute;sinstaller GlassFish Server Open Source Edition 3.0.1:</b></p>
<ol>
  <li>Arr&ecirc;tez l'EDI.</li>
  <li>A partir du panneau de configuration, s&eacute;lectionner Ajout/Suppression de programmes puis s&eacute;lectionner GlassFish Server Open Source Edition 3.0.1 et cliquer Supprimer.</li>
</ol>
<p><b>Pour d&eacute;sinstaller Apache Tomcat&nbsp;: </b></p>

<ol>
  <li>Arr&ecirc;tez l'EDI.</li>
  <li>A partir du panneau de configuration, s&eacute;lectionner Ajout/Suppression de programmes puis s&eacute;lectionner Apache Tomcat 6.0.26 et cliquer Supprimer.</li>
</ol>
</div>
<div>
<h3><a name="uninstall_sollinux">SE Solaris, Linux</a></h3>
<p>Si n&eacute;cessaire, vous pouvez d&eacute;sinstaller l'EDI Netbeans,lassFish Server Open Source Edition 3.0.1 et Apache Tomcat en utilisant les proc&eacute;dures suivantes. </p>
<p><b>Pour d&eacute;sinstaller l'EDI</b>&nbsp;:</p>

<ol>
  <li>Arr&ecirc;tez l'EDI.</li>
  <li>Dans le r&eacute;pertoire d'installation de l'EDI, ex&eacute;cutez le fichier <tt>uninstall.sh</tt>. </li>
  <li>Pour d&eacute;sinstaller GlassFish et Tomcat ensemble avec l'EDI, &agrave; la page R&eacute;capitulatif s'assurer que les versions correctes sont repertori&eacute;es et cocher les cases appropri&eacute;es. </li>
  <li>Sur la page r&eacute;capitulative, cliquez sur D&eacute;sinstaller. 
  </li>
  <li>Une fois la d&eacute;sinstallation termin&eacute;e, cliquez sur Terminer.</li>
</ol>
<p><b>Pour d&eacute;sinstaller GlassFish Server Open Source Edition 3.0.1</b>:</p>
<ol>
  <li>Arr&ecirc;tez l'EDI.</li>
  <li>Recherchez le r&eacute;pertoire d'installation du serveur d'application.
  <p><b>Note</b>: L''emplacement de l''installation par d&eacute;faut est diff&eacute;rent en fonction du type d''installation et de la plateforme. Le tableau suivant pr&eacute;sente le r&eacute;pertoire d'installation du serveur d'application par d&eacute;faut pour diff&eacute;rentes plates-formes.</p>

  <table>
    <tbody>
        <tr class="tblheader">
            <th width="70">Plate-forme</th>
            <th width="101">Installation en tant que... </th>
			<th width="264">Installation de GlassFish 3.0.1</th>
        </tr>
        <tr class="tbltd0">
          <td>Windows</td>
          <td>Utilisateur avec droits d'administrateur</td>
          <td><tt>%ProgramFiles%\glassfish-3.0.1</tt></td>
        </tr>
        <tr class="tbltd0">
          <td>Windows</td>
          <td>Utilisateur</td>
          <td><tt>%USERPROFILE%\glassfish-3.0.1</tt></td>
        </tr>
        <tr class="tbltd0">
            <td>SE Solaris</td>
            <td>racine</td>
			 <td><tt>/opt/glassfish-3.0.1</tt></td>
        </tr>
        <tr class="tbltd1">

            <td>SE Solaris, Linux</td>
            <td valign="top">Utilisateur</td>
			<td valign="top"><tt>~/glassfish-3.0.1</tt></td>
        </tr>
        <tr class="tbltd0">
            <td>Linux</td>
            <td>racine</td>
			<td><tt>/usr/local/glassfish-3.0.1</tt></td>
        </tr>
    </tbody>
</table>
  </li>
  <li>Dans le r&eacute;pertoire d'installation du serveur d'application, ex&eacute;cutez le fichier <tt>uninstall.sh</tt>.</li>

  <li>Sur la page r&eacute;capitulative, cliquez sur D&eacute;sinstaller.
  </li>
  <li>Une fois la d&eacute;sinstallation termin&eacute;e, cliquez sur Terminer.</li>
</ol>
<p><b>Pour d&eacute;sinstaller Apache Tomcat&nbsp;:</b></p>
<ol>
  <li>Arr&ecirc;tez l'EDI.</li>

  <li>Recherchez le r&eacute;pertoire d'installation d'Apache Tomcat et ex&eacute;cutez le fichier <tt>uninstall.sh</tt>. 
  </li>
  <li>Sur la page r&eacute;capitulative, cliquez sur D&eacute;sinstaller. </li>
  <li>Une fois la d&eacute;sinstallation termin&eacute;e, cliquez sur Terminer.</li>
</ol>
</div>

<div>
<h3><a name="uninstall_mac" id="uninstall_mac">Mac OS X</a></h3>
<p><b>Pour d&eacute;sinstaller l'IDE et le serveur d'application</b>:</p>
<ol>
  <li>Arr&ecirc;tez le logiciel.</li>
  <li>Faites glisser les dossiers ou fichiers du programme vers la corbeille. Notez que l'emplacement par d&eacute;faut de l'EDI et du serveur d'application est <tt>/Applications/NetBeans/</tt>.  </li>
</ol>
</div>

<div>
<h3><a name="uninstall_zip" id="uninstall_zip">Package ind&eacute;pendant de la plate-forme</a></h3>
<p>Pour d&eacute;sinstaller les fichiers de l'EDI, suivez les &eacute;tapes d&eacute;crites &agrave; la section <a href="#clean">Nettoyage apr&egrave;s une installation incompl&egrave;te</a> de ce document. </p>
</div>

<p align="center"><a href="#top">Haut</a></p>

<h2><a name="upgrading"></a>Cohabitation de plusieurs version de NetBeans IDE</h2>
<p>Plusieurs installations de NetBeans IDE 5.x et 6.x peuvent coexister sur le m&ecirc;me syst&egrave;me avec NetBeans IDE 6.9. Vous n'avez pas &agrave; d&eacute;sinstaller les versions ant&eacute;rieures pour  installer ou ex&eacute;cuter NetBeans IDE 6.9. </p>
<p>Si vous avez une installation existante de NetBeans IDE, vous pouvez choisir ou non d'importer les param&egrave;tres utilisateur &agrave; partir du r&eacute;pertoire utilisateur existant lorsque vous ex&eacute;cutez NetBeans IDE 6.9 pour la premi&egrave;re fois.</p>
<p><span class="notes"><b>Note</b>: La mise &agrave; jour de version incr&eacute;mentale de l'IDE ne peut &ecirc;tre effectu&eacute;e &agrave; ce moment. Pour mettre &agrave; niveau vers la version la plus r&eacute;cente, vous devez t&eacute;l&eacute;charger le dernier programme d'installation. </span></p>
<p align="center"><a href="#top">Haut</a></p>
<h2><a name="troubleshooting" id="troubleshooting"></a>D&eacute;pannage</h2>
<div>
<h3>&Agrave; propos du r&eacute;pertoire de travail du programme d'installation</h3>
<p>Le programme d'installation stocke les donn&eacute;es concernant les sessions d'installation dans son r&eacute;pertoire de travail. Ces donn&eacute;es sont par exemple la liste des composants install&eacute;s sur votre syst&egrave;me, les messages du journal d'installation et les donn&eacute;es du registre. </p>

<p>L'emplacement par d&eacute;faut du r&eacute;pertoire de travail du programme d'installation est <tt>%USERPROFILE%\.nbi</tt> sous Windows et <tt>~/.nbi</tt> sur d'autres plates-formes. Le sous-r&eacute;pertoire du journal contient les fichiers journaux d'installation. </p>
</div>
<div>
<h3><a name="clean"></a>Nettoyage apr&egrave;s une installation incompl&egrave;te</h3>
<p>Apr&egrave;s des installations incompl&egrave;tes ou ayant &eacute;chou&eacute;, il peut &ecirc;tre n&eacute;cessaire de supprimer les installations pr&eacute;c&eacute;dentes de votre syst&egrave;me. </p>
<p><b>Sous Microsoft Windows, le SE Solaris et Linux&nbsp;:</b></p>
<ol>

  <li>Supprimez le r&eacute;pertoire de travail du programme d'installation.</li>
  <li>Supprimez les r&eacute;pertoires d'installation de l'EDI et du serveur d'application GlassFish.</li>
  <li>Sous la plate-forme Windows, supprimez toutes les entr&eacute;es du registre <tt>nbi*</tt> des cl&eacute;s de registre suivantes: <tt>HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall</tt> <tt>HKEY_CURRENT_USER\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall</tt> </li>

</ol>
<p><b>Sous Mac OS X&nbsp;:</b></p>
<ul>
  <li>Faites glisser les dossiers ou fichiers du programme vers la corbeille. </li>
</ul>
</div>
<div>
<h3>D&eacute;sactivation de certains logiciels avant l'installation</h3>
<p>Il est pr&eacute;f&eacute;rable de d&eacute;sactiver les applications de pare-feu, d'antivirus et de contr&ocirc;le avant de commencer l'installation. Certaines de ces applications peuvent emp&ecirc;cher la configuration des composants de l'EDI pendant la proc&eacute;dure d'installation. </p>
<p>Par exemple, si l'application Process Monitor de Logitech (<tt>LVPrcSrv.exe</tt> est en cours d'ex&eacute;cution sur votre syst&egrave;me, d&eacute;sactivez-la avant l'installation. </p>

</div>
<p align="center"><a href="#top">Haut</a></p>
<h2><a name="moreinformation"></a>Informations compl&eacute;mentaires</h2>

<ul>
<li><a href="index.html">Vue d'ensemble de NetBeans IDE 6.9</a></li>
<li><a href="relnotes.html">Notes de version de NetBeans IDE 6.9</a></li>
<li><a href="http://wiki.netbeans.org/NetBeansUserFAQ#Installation" target="_blank">FAQ sur l'installation de NetBeans IDE</a></li>
</ul>
<div class="feedback-box"><a href="https://netbeans.org/about/contact_form.html?to=3&subject=Feedback: NetBeans IDE 6.9 Installation Instructions">Formulaire d'envoi de commentaires</a>
</div>
<br style="clear:both;">
<p align="center"><a href="#top">Haut</a></p>
</body>
</html>
