<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<!--
  Copyright 2010, Oracle Inc. 
  All Rights Reserved.
-->

<html>
<head>
<link rel="stylesheet" type="text/css" href="../../../netbeans.css">
<link rel="stylesheet" type="text/css" media="print" href="../../../print.css">
<link rel="shortcut icon" href="https://netbeans.org/favicon.ico" type="image/x-icon" >
<title>Instruci&oacute;ns da instalaci&oacute;n do IDE NetBeans 6.9.1</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" >
<meta name="description" content="Installation Instructions for NetBeans IDE 6.9.1">
<meta name="keywords" content="NetBeans, IDE, free, open source, install notes, developer, installer, NetBeans, NetBeans IDE, NetBeans installer, NetBeans development environment" >
<style type="text/css">
<!--
.style2 {color: #000000}
-->
</style>
</head>
<body>
<a name="top"></a>
<h1>Instruci&oacute;ns da instalaci&oacute;n do IDE NetBeans 6.9.1</h1>
<div class="articledate" style="margin-left: 0px;">&Uacute;ltima actualizaci&oacute;n: <!-- #BeginDate format:Am1 -->1 de xullo de 2010<!-- #EndDate --> </div>
<p>Este documento describe como instalar NetBeans IDE 6.9.1 no seu sistema. Vexa as notas da versi&oacute;n do NetBeans IDE 6.9.1 para obter informaci&oacute;n sobre <a href="relnotes_gl.html#system_requirements">os sistemas operativos compat&iacute;beis e as configuraci&oacute;ns de hardware</a> para o IDE. Para obter m&aacute;is informaci&oacute;n das novas caracter&iacute;sticas inclu&iacute;das nesta versi&oacute;n do IDE consulte a p&aacute;xina de <a href="index_gl.html">informaci&oacute;n da versi&oacute;n 6.9.1 do IDE NetBeans</a>.</p>

<h2>Contidos</h2>
<ul>
<li><a href="#requiredsoftware" title="Software requirido">Software requirido</a></li>
<li><a href="#downloadoptions" title="Opci&oacute;ns de descarga do instalador">Opci&oacute;ns de descarga do instalador</a></li>
<li><a href="#customizeinstall" title="Personalizando a s&uacute;a instalaci&oacute;n">Personalizando a s&uacute;a instalaci&oacute;n</a></li>
<li><a href="#startdownload" title="Comezando a descarga">Comezando a descarga</a></li>
<li><a href="#installation" title="Instalando o software">Instalando o software</a><div>
<ul>
<li><a href="#install_windows">Microsoft Windows, OS Solaris e Linux</a></li>
<li><a href="#install_mac">Mac OS X</a> </li>
<li><a href="#install_zip">Paquete independente da plataforma</a> </li>
</ul>
</div></li>
<li><a href="#uninstallation" title="Desinstalando o software">Desinstalando o software</a></li>
<li><a href="#upgrading">Compatibilidade de anovar e m&uacute;ltiples instalaci&oacute;ns</a></li>
<li><a href="#troubleshooting" title="Resoluci&oacute;n de problemas">Problema</a><a href="#troubleshooting" title="Resoluci&oacute;n de problemas">Problema</a></li>
<li><a href="#moreinformation" title="M&aacute;is informaci&oacute;n">M&aacute;is en</a><a href="#moreinformation" title="M&aacute;is informaci&oacute;n">formaci&oacute;n</a></li>
</ul>
<h2><a name="requiredsoftware" id="requiredsoftware"></a>Software requirido</h2>
<p>Requ&iacute;rese o Kit de desenvolvemento de Java SE (JDK) 6.0 Update 13 ou superior para instalar o IDE NetBeans. A versi&oacute;n 6.9.1 do IDE non pode instalarse usando o JDK 5.0. Vostede debe descargar a &uacute;ltima actualizaci&oacute;n do JDK 6.0 desde <a href="http://java.sun.com/javase/downloads/index.jsp" target="_blank">http://java.sun.com/javase/downloads</a>.
<p> Os paquetes do NetBeans para PHP, Ruby e C/C++ s&oacute; requiren o Contorno de execuci&oacute;n de Java (JRE) 6 para a instalaci&oacute;n e execuci&oacute;n. Por&eacute;n, se vai usar as caracter&iacute;sticas de Java precisar&aacute; JDK 6.0. </p>
<p align="center"><a href="#top">superior</a></p>
<h2><a name="downloadoptions" id="downloadoptions"></a>Opci&oacute;ns de descarga do instalador</h2>
<p>No IDE NetBeans <a href="https://netbeans.org/downloads/" target="_blank">p&aacute;xina de descarga</a>, vostede pode obter un dos varios instaladores, cada un cont&eacute;n o IDE base e ferramentas adicionais.  </p>
<p>Existen os seguintes instaladores dispo&ntilde;&iacute;beis: </p>
<ul>
   <li><b>Java SE</b>. Admite todas as caracter&iacute;sticas de desenvolvemento do Java SE est&aacute;ndar as&iacute; como a plataforma de desenvolvemento de RCP do NetBeans.</li>
   <li><b>JavaFX</b>. Incl&uacute;e JavaFX SDK 1.3.1 e JavaFX Composer para o desenvolvemento de aplicativos ricos multiplataforma.</li>
   <li><b>Java</b>. Fornece ferramentas para o desenvolvemento de aplicativos Java SE e Java ME as&iacute; como a compatibilidade de plataforma de desenvolvemento RCP de NetBeans. Esta opci&oacute;n de descarga tam&eacute;n incl&uacute;e a edici&oacute;n Open Source do servidor GlassFish 3.0.1, e o software Apache Tomcat 6.0.26. </li>
   <li><b>Ruby</b>. Fornece ferramentas para o desenvolvemento con Ruby e compatibilidade con Rails e JRuby. Tam&eacute;n cont&eacute;n a edici&oacute;n de c&oacute;digo aberto do servidor GlassFish 3.0.1.</li>
   <li><b>C/C++</b>. Ofrece a compatibilidade de desenvolvemento coas linguaxes C, C++, Qt, Fortran e Ensamblador. </li>
   <li><b>PHP</b>. Fornece ferramentas para o desenvolvemento con PHP 5.x, a compatibilidade dos frameworks Zend e Symfony</li>
   <li><b>Todo. </b> Esta &eacute; unha opci&oacute;n de descarga completa, que cont&eacute;n todos os contornos de execuci&oacute;n e tecnolox&iacute;as dispo&ntilde;&iacute;beis para o IDE NetBeans.  </li>
</ul>
<p align="center"><a href="#top">arriba</a></p>
<h2><a name="customizeinstall"></a>Personalizando a t&uacute;a instalaci&oacute;n</h2>
<p>Se descarga a opci&oacute;n Java ou &quot;Todo&quot;, vostede pode seleccionar exactamente que ferramentas e contornos de execuci&oacute;n instalar. Prema en Personalizar na p&aacute;xina de Benvida do instalador e seleccione as funcionalidades que desexa empregar. Para obter m&aacute;is informaci&oacute;n, vexa <a href="#installation" title="Instalando o software">Instalando o software</a>.</p>
<p>Se quere engadir funcionalidades &aacute; s&uacute;a configuraci&oacute;n do IDE de NetBeans, empregue o xestor de complementos de NetBeans. Por exemplo, asuma que descargou o paquete de Ruby. E logo decide probar a funcionalidade de C/C++. Para facer isto, vaia ao Xestor de complementos de NetBeans dende o IDE (seleccione Ferramentas -&gt; Complementos) e engada o paquete C/C++ &aacute; s&uacute;a instalaci&oacute;n existente.</p>
<p>Existen algunhas notas importantes sobre a instalaci&oacute;n e a configuraci&oacute;n de algunhas funcionalidades de NetBeans: </p>
<ol>
  <li>Apache Tomcat 6.0.26 est&aacute; inclu&iacute;do nas opci&oacute;ns de descarga &quot;Java&quot; e &quot;Todo&quot; pero non se instala de forma predefinida en calquera das d&uacute;as opci&oacute;ns. Para instalar o Apache Tomcat desde as descargas Java e &quot;Todo&quot;, lance o instalador e seleccione Apache Tomcat 6.0.23 na caixa de di&aacute;logo Personalizar. </li>

  <li>Para o desenvolvemento con C/C++ (aplic&aacute;bel para as opci&oacute;ns de descarga de C/C++ e &quot;Todo&quot;), necesita instalar adicionalmente os compiladores e ferramentas. Para m&aacute;is informaci&oacute;n vaia a <a
  href="cpp-setup-instructions.html">Configurando o IDE NetBeans para C/C++/Fortran</a> </li>
  <li>Para Mac OS X, vostede pode personalizar a instalaci&oacute;n dende as opci&oacute;ns de descarga Java, Ruby e &quot;Todo&quot; A instalaci&oacute;n do IDE dende as opci&oacute;ns de descarga Java SE, PHP e C/C++ non pode personalizarse. </li>
  <li>Tam&eacute;n pode descargar un <a href="#install_zip">ficheiro independente da plataforma</a> e executar o ficheiro execut&aacute;bel do IDE NetBeans. Te&ntilde;a en conta que a edici&oacute;n Open Source do servidor GlassFish e Apache Tomcat s&oacute; est&aacute;n dispo&ntilde;&iacute;beis cos instaladores dependentes da plataforma. </li>
</ol>
<p align="center"><a href="#top">ir arriba</a></p>
<h2><a name="startdownload" id="startdownload"></a>Comezando a descarga</h2>

<ol>
<li>Vaia a <a href="https://netbeans.org/downloads/" target="_blank"> <strong>https://netbeans.org/downloads/</strong></a></li>
<li>Na zona superior dereita da p&aacute;xina seleccione a linguaxe e plataforma dende a lista despreg&aacute;bel. Vostede pode seleccionar para descargar e empregar un arquivo zip independente da plataforma. </li>
<li>Prema no bot&oacute;n de Descargar dende a opci&oacute;n de descarga que queira instalar.</li>
<li>Garde o ficheiro de instalaci&oacute;n ao seu sistema.</li>
</ol>
<p align="center"><a href="#top">ir arriba</a></p>
<h2><a name="installation"></a>Instalando o software</h2>

<p>Siga as instruci&oacute;ns nesta secci&oacute;n para instalar o IDE no seu sistema. Estas instruci&oacute;ns de instalaci&oacute;n apl&iacute;canse a todas as plataformas compat&iacute;beis. Para a lista de plataformas admitidas, vexa as <a href="relnotes_gl.html">notas de lanzamento</a>. </p>
<h3><a name="install_windows" id="install_windows">Microsoft Windows, OS Solaris e Linux</a></h3>
<p><b>Para instalar o software:</b></p>
  <ol>
    <li>Despois de que a descarga remate execute o instalador. 
   <ul>
    <li>Para Windows, o ficheiro execut&aacute;bel do instalador ten a extensi&oacute;n <tt>.exe</tt>. Prema d&uacute;as veces no ficheiro de instalaci&oacute;n para executalo. </li>
    <li>Para as plataformas Solaris e Linux, o ficheiro do instalador ten a extensi&oacute;n <tt>.sh</tt>. Para estas plataformas, precisa facer os ficheiros do instalador execut&aacute;beis empregando a seguinte orde: <tt> chmod +x &lt;<i>installer-file-name</i>&gt;</tt></li>
   </ul>
  </li>
    <li>Seleccione as ferramentas e contornos de execuci&oacute;n a instalar, leve a cabo os seguintes pasos na p&aacute;xina de Benvida do asistente de instalaci&oacute;n:
      <ol type="a">
         <li>Prema en personalizar.</li>
         <li>No caixa de di&aacute;logo de Personalizaci&oacute;n da instalaci&oacute;n faga as s&uacute;as selecci&oacute;ns.</li>
         <li>Prema en OK.</li>
       </ol>
    </li>
     <li>Na p&aacute;xina de Benvida do asistente de instalaci&oacute;n prema Seguinte.</li>
     <li>Na p&aacute;xina do acordo de licenza, revise o acordo de licenza e prema na caixa de verificaci&oacute;n de aceptaci&oacute;n, logo prema Seguinte.</li>
     <li>Na p&aacute;xina de instalaci&oacute;n do IDE de NetBeans faga o seguinte:
       <ol type="a">
      <li>Acepte o cartafol de instalaci&oacute;n predefinido para o IDE NetBeans ou especifique outro cartafol.
         <p><b>Nota:</b> O cartafol de instalaci&oacute;n debe estar baleiro e o perfil do usuario que est&aacute; usando para executar o instalador debe ter permisos para ler/escribir neste cartafol</p></li>
      <li>Acepte a instalaci&oacute;n do JDK predefinido para empregar co IDE de NetBeans ou seleccione unha instalaci&oacute;n diferente dende a lista despreg&aacute;bel. Se o asistente de instalaci&oacute;n non pode atopar unha instalaci&oacute;n de JDK compat&iacute;bel para empregar co IDE NetBeans, o seu JDK non est&aacute; instalada na localizaci&oacute;n predefinida. Neste caso, especifique o cami&ntilde;o ao JDK instalado e prema Seguinte, ou cancele a instalaci&oacute;n actual. Logo de instalar a versi&oacute;n do JDK requirido debe reiniciar a instalaci&oacute;n.</li>
        </ol>
   <li>Se se abre a p&aacute;xina de instalaci&oacute;n da edici&oacute;n Open Source do servidor GlassFish 3.0.1, acepte o cartafol de instalaci&oacute;n predefinido ou especifique un cartafol personalizado.</li>
   <li>Se est&aacute; instalando Apache Tomact, na s&uacute;a p&aacute;xina de instalaci&oacute;n acepte o cartafol de instalaci&oacute;n predefinido ou especifique outra localizaci&oacute;n de instalaci&oacute;n. </li>
   <li>Na p&aacute;xina de Resumo, verifique que a lista dos compo&ntilde;entes a instalar &eacute; correcta e que ten o espazo axeitado no seu sistema para realizar a instalaci&oacute;n.</li>
   <li>Prema en Instalar para comezar a instalaci&oacute;n.</li>
  </ol>
<p class="notes"><b>Nota:</b> se encontra problemas para instalar o software correctamente, consulte a <a href="#troubleshooting">Resoluci&oacute;n de problemas</a> para obter descrici&oacute;ns e suxesti&oacute;ns para solucionar problemas sen resolver que poden afectar ao proceso de instalaci&oacute;n. </p>
<h3><a name="install_mac" id="install_mac">Mac OS X</a></h3>
<p><b>Para instalar o software:</b></p>
<ol>
  <li>Despois de que a descarga remate, execute o instalador. O ficheiro do instalador ten a extensi&oacute;n <tt>.dmg</tt>. </li>
  <li>Nos paneis que se abren prema na icona do paquete. O paquete ten a extensi&oacute;n <tt>.mpkg</tt>. O asistente do instalador comezar&aacute;.</li>
  <li>Na p&aacute;xina de Benvida do asistente de instalaci&oacute;n prema en Continuar.</li>
  <li>Revise o acordo de licenza e prema en Continuar. Prema en Aceptar na xanela emerxente para aceptar a licenza.</li>
  <li>Na p&aacute;xina de Selecci&oacute;n de destino seleccione o dispositivo e prema en Continuar. </li>
  <li>Se descargou o paquete &quot;Todo&quot;, Java ou Ruby vostede pode personalizar a instalaci&oacute;n. No &uacute;ltimo panel da instalaci&oacute;n prema no bot&oacute;n de continuar no bot&oacute;n da parte esquerda do panel. Mostr&aacute;rase a &aacute;rbore de produtos.  </li>
  <li>Seleccione os produtos que quere instalar.</li>
  <li>Insira o nome do administrador e o contrasinal do seu sistema e prema en Aceptar para comezar a instalaci&oacute;n.</li>
</ol>

<h3><a name="install_zip" id="install_zip">Paquete independente da plataforma</a></h3>
<p><b>Para executar o software:</b></p>
<ol>
  <li>Despois de que a descarga do arquivo ZIP independente da plataforma remate, extra&iacute;ao a calquera cartafol do seu sistema. </li>
  <li>Executa o ficheiro execut&aacute;bel localizado no cartafol <tt>netbeans/bin</tt>. </li>
  <li>Acepte o acordo de licenza. O IDE NetBeans iniciarase. </li>
</ol>
<p><span class="notes"><b>Nota</b>: Se non pode encontrar unha instalaci&oacute;n do JDK compat&iacute;bel, pode que necesite engadir manualmente o cami&ntilde;o ao cartafol de instalaci&oacute;n do JDK realizando o seguinte:</span></p>
<ol>
  <li>Abra o ficheiro <tt>netbeans.conf</tt> localizado no cartafol <tt>netbeans/etc</tt> cun editor de textos.</li>
  <li>Introduza a localizaci&oacute;n da instalaci&oacute;n do JDK compat&iacute;bel na opci&oacute;n <tt>netbeans_jdkhome</tt> A localizaci&oacute;n predefinida en Windows &eacute; <tt>C:\Program Files\Java\jdk1.6.0</tt>.</li>
  <li>Garde o ficheiro <tt>netbeans.conf</tt> e execute o ficheiro execut&aacute;bel do cartafol <tt>netbeans/bin</tt>.</li>
</ol>
<p><span class="notes"><b>Nota</b>: A edici&oacute;n de c&oacute;digo aberto do servidor GlassFish e Apache Tomcat soamente est&aacute;n dispo&ntilde;&iacute;beis cos instaladores espec&iacute;ficos das plataformas.</span></p>

<p align="center"><a href="#top">arriba</a></p>
<h2><a name="uninstallation">Desinstalando o software</a></h2>
<p>Segue as instruci&oacute;ns desta secci&oacute;n para desinstalar o IDE do seu sistema. Estas instruci&oacute;ns de instalaci&oacute;n apl&iacute;canse a todas as plataformas compat&iacute;beis. Para a lista de plataformas admitidas, vexa as <a href="relnotes_gl.html">notas de lanzamento</a>.</p>
<div>
<h3><a name="uninstall_windows">Microsoft Windows</a></h3>
<p>Se &eacute; necesario, vostede pode desinstalar o IDE NetBeans, a edici&oacute;n Open Source do servidor GlassFish 3.0.1 e o Apache Tomcat usando os procedementos seguintes.</p>
<p><b>Para desinstalar o IDE</b>:</p>
<ol>
  <li>Apague o IDE.
  </li>
  <li>Desde o Panel de control, seleccione Engadir ou eliminar programas, logo seleccione o IDE NetBeans 6.9.1 e prema Eliminar.</li>
</ol>
<p><b>Para desinstalar a edici&oacute;n de c&oacute;digo aberto do servidor GlassFish 3.0.1: </b></p>
<ol>
  <li>Apague o IDE.</li>
  <li>Desde o panel de control, Seleccione Engadir ou Eliminar programas, logo seleccione a edici&oacute;n de c&oacute;digo aberto do servidor GlassFish 3.0.1 e prema Eliminar.</li>
</ol>
<p><b>Para desinstalar Apache Tomcat: </b></p>

<ol>
  <li>Apague o IDE.</li>
  <li>Desde o panel de control, Seleccione Engadir ou Eliminar programas, logo seleccione Apache Tomcat 6.0.26 e prema Eliminar.</li>
</ol>
</div>
<div>
<h3><a name="uninstall_sollinux">Solaris OS, Linux</a></h3>
<p>Se &eacute; necesario, pode desinstalar o IDE NetBeans, a edici&oacute;n de c&oacute;digo aberto do servidor GlassFish 3.0.1, e Apache Tomcat usando os seguintes procedementos.</p>
<p><b>Para desinstalar o IDE</b>:</p>

<ol>
  <li>Apague o IDE.</li>
  <li>No cartafol de instalaci&oacute;n do IDE, execute o ficheiro <tt>uninstall.sh</tt>. </li>
  <li>Para desinstalar GlassFish e Tomcat xunto co IDE, na p&aacute;xina do resumo comprobe que aparecen listadas as versi&oacute;ns correctas e marque as casillas de verificaci&oacute;n axeitadas. </li>
  <li>Na p&aacute;xina de resumo prema en Desinstalar. 
  </li>
  <li>Logo de que a desinstalaci&oacute;n remate, prema en Terminar.</li>
</ol>
<p><b>Para desinstalar a edici&oacute;n de c&oacute;digo aberto do servidor GlassFish 3.0.1</b>:</p>
<ol>
  <li>Apague o IDE.</li>
  <li>Localice o cartafol de instalaci&oacute;n do servidor de aplicativos.
  <p><b>Nota</b>: A localizaci&oacute;n predefinida da instalaci&oacute;n &eacute; diferente dependendo do tipo de instalaci&oacute;n e da plataforma. Na seguinte t&aacute;boa m&oacute;strase o cartafol de instalaci&oacute;n predefinido do servidor de aplicativos para varias plataformas.</p>

  <table>
    <tbody>
        <tr class="tblheader">
            <th width="70">Plataforma</th>
            <th width="101">Instalando como...</th>
			<th width="264">Instalaci&oacute;n de GlassFish 3.0.1</th>
        </tr>
        <tr class="tbltd0">
          <td>Windows</td>
          <td>usuario con permisos de administraci&oacute;n</td>
          <td><tt>%ProgramFiles%\glassfish-3.0.1</tt></td>
        </tr>
        <tr class="tbltd0">
          <td>Windows</td>
          <td>usuario</td>
          <td><tt>%USERPROFILE%\glassfish-3.0.1</tt></td>
        </tr>
        <tr class="tbltd0">
            <td>OS Solaris</td>
            <td>ra&iacute;z</td>
			 <td><tt>/opt/glassfish-3.0.1</tt></td>
        </tr>
        <tr class="tbltd1">

            <td>OS Solaris, Linux</td>
            <td valign="top">usuario</td>
			<td valign="top"><tt>~/glassfish-3.0.1</tt></td>
        </tr>
        <tr class="tbltd0">
            <td>Linux</td>
            <td>ra&iacute;z</td>
			<td><tt>/usr/local/glassfish-3.0.1</tt></td>
        </tr>
    </tbody>
</table>
  </li>
  <li>No cartafol de instalaci&oacute;n do servidor de aplicativos, execute o ficheiro <tt>uninstall.sh</tt>.</li>

  <li>Na p&aacute;xina de resumo prema en Desinstalar.
  </li>
  <li>Despois de que a desinstalaci&oacute;n remate prema en Terminar.</li>
</ol>
<p><b>Para desinstalar Apache Tomcat: </b></p>
<ol>
  <li>Apague o IDE.</li>

  <li>Localice o cartafol de instalaci&oacute;n do Apache Tomcat e execute o ficheiro <tt>uninstall.sh</tt>. 
  </li>
  <li>Na p&aacute;xina de resumo prema en Desinstalar. </li>
  <li>Despois de que a desinstalaci&oacute;n remate prema en Terminar.</li>
</ol>
</div>

<div>
<h3><a name="uninstall_mac" id="uninstall_mac">Mac OS X</a></h3>
<p><b>Para desinstalar o IDE e o servidor de aplicativos</b>:</p>
<ol>
  <li>Peche o software.</li>
  <li>Arrastre os cartafoles do programa ou os ficheiros ao Lixo. Nota que a localizaci&oacute;n predefinida para o IDE e o servidor de aplicativos est&aacute; en <tt>/Applications/NetBeans/</tt>.  </li>
</ol>
</div>

<div>
<h3><a name="uninstall_zip" id="uninstall_zip">Paquete independente da plataforma</a></h3>
<p>Para instalar os ficheiros do IDE, sigua os pasos descritos na secci&oacute;n <a href="#clean">Limpando despois dunha instalaci&oacute;n incompleta</a> de este documento. </p>
</div>

<p align="center"><a href="#top">ir arriba</a></p>

<h2><a name="upgrading"></a>Compatibilidade para a actualizaci&oacute;n e instalaci&oacute;n m&uacute;ltiple</h2>
<p>Poden coexistir m&uacute;ltiples instalaci&oacute;ns de NetBeans 5.x e 6.x co IDE NetBeans 6.9.1 no mesmo sistema. Non ten que desinstalar as versi&oacute;ns anteriores para instalar ou executar o IDE NetBeans 6.9.1. </p>
<p>Se ten unha instalaci&oacute;n existente do IDE NetBeans vostede pode seleccionar se desexa importar ou non as opci&oacute;ns de configuraci&oacute;n desde o cartafol de usuario existente ao executar IDE NetBeans 6.9.1 por primeira vez.</p>
<p><span class="notes"><b>Nota</b>: Nestes momentos non se poden realizar actualizaci&oacute;ns incrementais de versi&oacute;ns do IDE. Para actualizar &aacute; &uacute;ltima versi&oacute;n debe descargar o &uacute;ltimo instalador.</span></p>
<p align="center"><a href="#top">ir arriba</a></p>
<h2><a name="troubleshooting" id="troubleshooting"></a>Resoluci&oacute;n de erros</h2>
<div>
<h3>Sobre o cartafol de traballo do instalador</h3>
<p>O instalador almacena informaci&oacute;n sobre as sesi&oacute;ns da instalaci&oacute;n no cartafol de traballo do instalador. Alg&uacute;ns exemplos de datos son a lista de compo&ntilde;entes instalados no seu sistema, as mensaxes de rexistro de instalaci&oacute;n e os datos de rexistro. </p>

<p>A localizaci&oacute;n predefinida para o cartafol de traballo do instalador &eacute; <tt>%USERPROFILE%\.nbi</tt> en Windows e <tt>~/.nbi</tt> outras plataformas. O subcartafol de rexistro cont&eacute;n os ficheiros de rexistro da instalaci&oacute;n. </p>
</div>
<div>
<h3><a name="clean"></a>Limpando as instalaci&oacute;ns incompletas</h3>
<p>Despois de unha instalaci&oacute;n incompleta ou non exitosa, para solucionalo pode limpar o seu sistema das anteriores instalaci&oacute;ns.  </p>
<p><b>Para Microsoft Windows, Solaris OS, e Linux:</b></p>
<ol>

  <li>Elimine o cartafol de traballo do instalador.</li>
  <li>Elimine os cartafoles de instalaci&oacute;n do IDE e do servidor de aplicativos GlassFish.</li>
  <li>Na plataforma Windows, elimine todas as entradas do rexistro <tt>nbi*</tt> desde as chaves do rexistro seguintes: <tt>HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall</tt> <tt>HKEY_CURRENT_USER\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall</tt> </li>

</ol>
<p><b>Para Mac OS X:</b></p>
<ul>
  <li>Arrastre os cartafoles de programa ou ficheiros ao Lixo. </li>
</ul>
</div>
<div>
<h3>Desactivando alg&uacute;n software antes da instalaci&oacute;n</h3>
<p>Mellor desactive o firewall, antivirus e aplicativos de monitorizaci&oacute;n antes de comezar a instalaci&oacute;n. Alg&uacute;n destes aplicativos poden evitar que os compo&ntilde;entes do IDE sexan configurados correctamente durante o proceso de instalaci&oacute;n. </p>
<p>Por exemplo, se ten un aplicativo Monitor de procesos de Logitech {<tt>LVPrcSrv.exe</tt>} execut&aacute;ndose no sistema, dete&ntilde;ao antes de comezar a instalaci&oacute;n </p>

</div>
<p align="center"><a href="#top">ir arriba</a></p>
<h2><a name="moreinformation"></a>M&aacute;is informaci&oacute;n</h2>

<ul>
<li><a href="index_gl.html">Informaci&oacute;n da versi&oacute;n 6.9.1 do IDE NetBeans</a></li>
<li><a href="relnotes_gl.html">Notas da versi&oacute;n 6.9.1 do IDE NetBeans</a></li>
<li><a href="http://wiki.netbeans.org/NetBeansUserFAQ#Installation" target="_blank">FAQ de instalaci&oacute;n do IDE NetBeans</a></li>
</ul>
<div class="feedback-box"><a href="https://netbeans.org/about/contact_form.html?to=3&subject=Feedback: NetBeans IDE 6.9.1 Installation Instructions">Env&iacute;enos as s&uacute;as suxesti&oacute;ns</a>
</div>
<br style="clear:both;">
<p align="center"><a href="#top">ir arriba</a></p>
</body>
</html>
