<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<!--
  Copyright 2010, Oracle Inc. 
  All Rights Reserved.
-->

<html>
<head>
<link rel="stylesheet" type="text/css" href="../../../netbeans.css">
<link rel="stylesheet" type="text/css" media="print" href="../../../print.css">
<link rel="shortcut icon" href="https://netbeans.org/favicon.ico" type="image/x-icon" >
<title>Instrucciones de Instalaci&oacute;n del IDE NetBeans 6.9.1</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" >
<meta name="description" content="Installation Instructions for NetBeans IDE 6.9.1">
<meta name="keywords" content="NetBeans, IDE, free, open source, install notes, developer, installer, NetBeans, NetBeans IDE, NetBeans installer, NetBeans development environment" >
<style type="text/css">
<!--
.style2 {color: #000000}
-->
</style>
</head>
<body>
<a name="top"></a>
<h1>Instrucciones de Instalaci&oacute;n del IDE NetBeans 6.9.1</h1>
<div class="articledate" style="margin-left: 0px;">&Uacute;ltima actualizaci&oacute;n: <!-- #BeginDate format:Am1 -->1 de Julio de 2010<!-- #EndDate --> </div>
<p>Este documento describe c&oacute;mo instalar el IDE NetBeans 6.9.1 en su ordenador. Vea las Notas de Lanzamiento del IDE NetBeans 6.9.1 para informaci&oacute;n acerca de <a href="relnotes_es.html#system_requirements"> compatibilidad con sistemas operativos y configuraciones de hardware </a> para el IDE. Para conocer las nuevas funcionalidades incluidas en este lanzamiento del IDE, vaya a la p&aacute;gina de <a href="index_es.html">Informaci&oacute;n del Lanzamiento del IDE NetBeans 6.9.1</a>.</p>

<h2>Contenido</h2>
<ul>
<li><a href="#requiredsoftware" title="Requisitos de software">Requisitos de software</a></li>
<li><a href="#downloadoptions" title="Opciones de Descarga del Instalador">Opciones de Descarga del Instalador</a></li>
<li><a href="#customizeinstall" title="Personalizaci&oacute;n de la Instalaci&oacute;n">Personalizaci&oacute;n de la Instalaci&oacute;n</a></li>
<li><a href="#startdownload" title="Inicio de la Descarga">Inicio de la Descarga</a></li>
<li><a href="#installation" title="Instalaci&oacute;n del Software">Instalaci&oacute;n del Software</a><div>
<ul>
<li><a href="#install_windows">Microsoft Windows, Solaris OS y Linux</a></li>
<li><a href="#install_mac">Mac OS X</a> </li>
<li><a href="#install_zip">Paquete independiente de la Plataforma</a> </li>
</ul>
</div></li>
<li><a href="#uninstallation" title="Desinstalaci&oacute;n del Software">Desinstalaci&oacute;n del Software</a></li>
<li><a href="#upgrading">Soporte para Actualizaci&oacute;n y M&uacute;ltiple instalaci&oacute;n</a></li>
<li><a href="#troubleshooting" title="Resoluci&oacute;n de Problemas">Problemas</a><a href="#troubleshooting" title="Resoluci&oacute;n de Problemas">Resoluci&oacute;n</a></li>
<li><a href="#moreinformation" title="M&aacute;s informaci&oacute;n">M&aacute;s in</a><a href="#moreinformation" title="M&aacute;s informaci&oacute;n">formaci&oacute;n</a></li>
</ul>
<h2><a name="requiredsoftware" id="requiredsoftware"></a>Requisitos de software</h2>
<p>Antes de instalar el IDE NetBeans, debe tener instalado en el sistema la actualizaci&oacute;n 13 del JDK (Java SE Development Kit) 6.0, u otra posterior. La versi&oacute;n 6.9.1 del IDE no puede instalarse mediante el JDK 5.0. Puede descargar la versi&oacute;n m&aacute;s reciente de JDK en <a href="http://java.sun.com/javase/downloads/index.jsp" target="_blank">http://java.sun.com/javase/downloads</a>. 
<p> Para las opciones de descarga de PHP, Ruby y C/C++ puede instalar el JRE (Java Runtime Environment)6.0 en lugar de JDK. Sin embargo, si piensa usar cualquiera de las funciones de Java, necesitar&aacute; el JDK 6.0. </p>
<p align="center"><a href="#top">inicio</a></p>
<h2><a name="downloadoptions" id="downloadoptions"></a>Opciones de descarga del instalador</h2>
<p>En <a href="https://netbeans.org/downloads/" target="_blank">la p&aacute;gina de descarga</a> del IDE NetBeans puede obtener uno de los diversos instaladores, cada uno de los cuales contiene el IDE b&aacute;sico y herramientas adicionales.  </p>
<p>Los siguientes instaladores est&aacute;n disponibles:  </p>
<ul>
   <li><b>Java SE</b>. Proporciona todas las caracter&iacute;sticas est&aacute;ndar para el desarrollo de Java SE. Tambi&eacute;n se incluye la compatibilidad con el desarrollo de RCP de la plataforma NetBeans.</li>
   <li><b>JavaFX</b>. Proporciona el SDK de JavaFX 1.3.1 y el compositor de JavaFX, para el desarrollo de aplicaciones multiplataforma de JavaFX. </li>
   <li><b>Java</b>. Proporciona herramientas para desarrollar aplicaciones de Java SE, Java EE y Java ME. Tambi&eacute;n se incluye la compatibilidad con el desarrollo de RCP de la plataforma NetBeans. Esta opci&oacute;n de descarga tambi&eacute;n incluye el servidor GlassFish OSE (Open Source Edition) 3.0.1, y Apache Tomcat 6.0.26. </li>
   <li><b>Ruby</b>. Proporciona herramientas para el desarrollo de Ruby y es compatible con Rails y JRuby. Tambi&eacute;n incluye el servidor GlassFish OSE (Open Source Edition) 3.0.1.</li>
   <li><b>C/C++</b>. Es compatible con el desarrollo en los lenguajes C, C++, Qt, Fortran y Assembly. </li>
   <li><b>PHP</b>. Proporciona herramientas para el desarrollo de PHP 5.x, y los Frameworks Zend y Symfony.</li>
   <li><b>All (Todo). </b> &Eacute;sta es la opci&oacute;n de descarga completa, que incluye todos los entornos de ejecuci&oacute;n y los paquetes disponibles para el IDE NetBeans.   </li>
</ul>
<p align="center"><a href="#top">inicio</a></p>
<h2><a name="customizeinstall"></a>Personalizaci&oacute;n de la instalaci&oacute;n</h2>
<p>Si realiza la descarga mediante las opciones Java o &quot;All&quot; (Todo), puede seleccionar qu&eacute; herramientas y tiempos de ejecuci&oacute;n que desea instalar. Haga clic en Personalizar en la p&aacute;gina de bienvenida del instalador y seleccione las caracter&iacute;sticas que desee usar. Para obtener m&aacute;s informaci&oacute;n, consulte <a href="#installation" title="Instalaci&oacute;n del software">Instalaci&oacute;n del software</a>.</p>
<p>Si desea agregar funciones a la configuraci&oacute;n del IDE NetBeans, utilice el gestor de complementos de NetBeans. Por ejemplo, suponga que descarga e instala el paquete de Ruby. A continuaci&oacute;n, decide que desea probar las funciones de C/C++. Para ello, hay que acceder a NetBeans Plugin Manager desde el IDE (seleccione Herramientas &gt; Plugins) y agregar el paquete C/C++ a la instalaci&oacute;n existente. </p>
<p>Hay varias notas importantes sobre la instalaci&oacute;n y la configuraci&oacute;n de algunas funciones del IDE NetBeans: </p>
<ol>
  <li>Apache Tomcat 6.0.26 est&aacute; incluido en las opciones de descarga de &quot;Java&quot; y de &quot;Todo&quot;, no obstante no se instala por defecto en cualquiera de estas opciones. Para instalar Apache Tomcat desde las descargas de Java o de &quot;Todo&quot;, ejecute el instalador y en cuadro de di&aacute;logo de instalaci&oacute;n personalizada seleccione Apache Tomcat 6.0.26.</li>

  <li>Para el desarrollo de C/C++, aplicable a los tipos de descarga &quot;C/C++&quot; y &quot;All&quot; (Todo), deber&aacute; instalar adem&aacute;s compiladores y herramientas. Para obtener m&aacute;s informaci&oacute;n, consulte <a
  href="cpp-setup-instructions.html">Configuraci&oacute;n del IDE NetBeans para C/C++/Fortran</a>.  </li>
  <li>En Mac OS X, puede personalizar la instalaci&oacute;n del IDE NetBeans en las opciones de descarga de Java, Ruby, y &quot;All&quot; (Todo). Esta posibilidad no est&aacute; disponible en las descargas JavaSE, PHP y C/C++. </li>
  <li>Tambi&eacute;n puede descargar el <a href="#install_zip">fichero zip independiente de plataforma</a> y ejecutar el IDE NetBeans con el fichero ejecutable. Denote que el Servidor GlassFish OSE (Open Source Edition), y Apache Tomcat &uacute;nicamente est&aacute;n disponibles con instaladores espec&iacute;ficos de plataforma. </li>
</ol>
<p align="center"><a href="#top">inicio</a></p>
<h2><a name="startdownload" id="startdownload"></a>Inicio de la descarga </h2>

<ol>
<li>Vaya a <a href="https://netbeans.org/downloads/" target="_blank"> <strong>https://netbeans.org/downloads/</strong></a></li>
<li>En la parte superior derecha de la p&aacute;gina, seleccione el idioma y la plataforma en la lista desplegable. Tambi&eacute;n puede optar por descargar y utilizar el archivo zip independiente de la plataforma. </li>
<li>Haga clic en el bot&oacute;n Descargar en la opci&oacute;n de descarga que desee instalar.</li>
<li>Guarde el archivo del instalador en el sistema. </li>
</ol>
<p align="center"><a href="#top">inicio</a></p>
<h2><a name="installation"></a>Instalaci&oacute;n del software</h2>

<p>Siga las instrucciones que aparecen en esta secci&oacute;n para instalar el IDE en el sistema. Estas instrucciones de instalaci&oacute;n se aplican a todas las plataformas compatibles. Para obtener la lista de las plataformas compatibles, consulte las <a href="relnotes_es.html">notas de la versi&oacute;n</a>. </p>
<h3><a name="install_windows" id="install_windows">Microsoft Windows, Solaris OS y Linux</a></h3>
<p><b>Para instalar el software:</b></p>
  <ol>
    <li>Una vez finalizada la descarga, ejecute el instalador. 
   <ul>
    <li>El archivo del instalador de Windows tiene la extensi&oacute;n <tt>.exe</tt>. Haga doble clic en &eacute;l para ejecutarlo. </li>
    <li>El archivo del instalador de las plataformas Solaris y Linux tiene la extensi&oacute;n <tt>.sh</tt>. En estas plataformas debe convertir los archivos del instalador en ejecutables mediante el siguiente comando: <tt> chmod +x &lt;<i>nombre-archivo-instalador</i>&gt;</tt></li>
   </ul>
  </li>
    <li>Para seleccionar las herramientas y tiempos de ejecuci&oacute;n que se van a instalar, siga estos pasos en la p&aacute;gina de bienvenida del asistente de instalaci&oacute;n:
      <ol type="a">
         <li>Haga clic en Personalizar.</li>
         <li>En el cuadro de di&aacute;logo Personalizar la instalaci&oacute;n, realice las selecciones.</li>
         <li>Haga clic en Aceptar. </li>
       </ol>
    </li>
     <li>En la p&aacute;gina de bienvenida del asistente para la instalaci&oacute;n, haga clic en Siguiente.</li>
     <li>En la p&aacute;gina de aceptaci&oacute;n de los acuerdos de licencia, revise los acuerdos de la licencia, haga clic en la casilla de aceptaci&oacute;n, y haga clic en Siguiente.</li>
     <li>En la p&aacute;gina de instalaci&oacute;n del IDE NetBeans, siga estos pasos: 
       <ol type="a">
      <li>Acepte el directorio de instalaci&oacute;n predeterminado del IDE NetBeans o especifique otro directorio. 
         <p><b>Nota:</b> El directorio de instalaci&oacute;n debe estar vac&iacute;o y el perfil de usuario con el que est&aacute; ejecutando el instalador debe tener permisos de lectura/escritura en este directorio.</p></li>
      <li>Acepte la instalaci&oacute;n de JDK predeterminada para usarlo con el IDE NetBeans o seleccione una instalaci&oacute;n diferente en la lista desplegable. Si el asistente de instalaci&oacute;n no encuentra una instalaci&oacute;n de JDK compatible para usar con el IDE NetBeans, no se instalar&aacute; en la ubicaci&oacute;n predeterminada. en este caso, especifique una ruta a un JDK instalado y haga clic a Siguiente, o cancele la instalaci&oacute;n en curso. Despu&eacute;s de haber instalado la versi&oacute;n necesaria del JDK puede reiniciar la instalaci&oacute;n.</li>
        </ol>
   <li>Si se abre la p&aacute;gina de instalaci&oacute;n del Servidor GlassFish OSE (Open Source Edition) 3.0.1, acepte el directorio predeterminado de instalaci&oacute;n o bien especifique otro diferente.</li>
   <li>Si va a instalar Apache Tomcat: en la p&aacute;gina de instalaci&oacute;n, acepte el directorio de instalaci&oacute;n predeterminado o especifique otra ubicaci&oacute;n para la instalaci&oacute;n. </li>
   <li>En la p&aacute;gina de resumen, compruebe que la lista de componentes que se van a instalar es correcta y que dispone de espacio suficiente en el sistema para la instalaci&oacute;n.</li>
   <li>Haga clic en Instalar para comenzar la instalaci&oacute;n.</li>
  </ol>
<p class="notes"><b>Nota:</b> si surgen problemas para instalar el software correctamente, consulte <a href="#troubleshooting">Resoluci&oacute;n de problemas</a> para obtener descripciones y sugerencias para solucionar problemas no resueltos que pueden afectar al proceso de instalaci&oacute;n. </p>
<h3><a name="install_mac" id="install_mac">Mac OS X</a></h3>
<p><b>Para instalar el software:</b></p>
<ol>
  <li>Una vez finalizada la descarga, ejecute el instalador. La extensi&oacute;n del archivo del instalador es <tt>.dmg</tt>. </li>
  <li>En los paneles que se abren, haga clic en el icono del paquete. La extensi&oacute;n del paquete es <tt>.mpkg</tt>. El asistente de instalaci&oacute;n comienza.</li>
  <li>En la p&aacute;gina de bienvenida del asistente para la instalaci&oacute;n, haga clic en Continuar.</li>
  <li>Revise el contrato de licencia y haga clic en Continuar. Haga clic en Aceptar en la ventana emergente para aceptar la licencia.</li>
  <li>En la p&aacute;gina de selecci&oacute;n de destino, elija la unidad y haga clic en Continuar. </li>
  <li>Si ha descargado los paquetes de &quot;All&quot; (Todo), Java o Ruby, puede personalizar la instalaci&oacute;n. En el &uacute;ltimo panel del asistente de instalaci&oacute;n, pulse el bot&oacute;n Personalizar de la parte inferior izquierda del panel. Aparece el &aacute;rbol de productos.  </li>
  <li>Seleccione los productos que desea instalar.</li>
  <li>Especifique el nombre y la contrase&ntilde;a del administrador del sistema y haga clic en Aceptar para comenzar la instalaci&oacute;n.</li>
</ol>

<h3><a name="install_zip" id="install_zip">Paquete independiente de la plataforma</a></h3>
<p><b>Para ejecutar el software:</b></p>
<ol>
  <li>Cuando finalice la descarga del archivo ZIP independiente de la plataforma, extr&aacute;igalo a cualquier carpeta del sistema. </li>
  <li>Ejecute el archivo ejecutable ubicado en el directorio <tt>netbeans/bin</tt>. </li>
  <li>Acepte el contrato de licencia. Se inicia el IDE NetBeans. </li>
</ol>
<p><span class="notes"><b>Nota</b>: Si no se puede encontrar una instalaci&oacute;n de JDK compatible, puede que necesite a&ntilde;adir manualmente la ruta al directorio de instalaci&oacute;n del JDK realizando lo siguiente:</span></p>
<ol>
  <li>Abra el fichero <tt>netbeans.conf</tt> que se encuentra en el directorio <tt>netbeans/etc</tt> con un editor de textos.</li>
  <li>Introduzca la localizaci&oacute;n de la instalaci&oacute;n del JDK compatible en la opci&oacute;n <tt>netbeans_jdkhome</tt>. La localizaci&oacute;n predeterminada en Windows es <tt>C:\Program Files\Java\jdk1.6.0</tt>.</li>
  <li>Guarde el fichero <tt>netbeans.conf</tt> y ejecute el fichero ejecutable del directorio <tt>netbeans/bin</tt>.</li>
</ol>
<p><span class="notes"><b>Nota</b>: El servidor GlassFish OSE (Open Source Edition) y Apache Tomcat &uacute;nicamente est&aacute;n disponibles para instaladores espec&iacute;ficos de plataforma.</span></p>

<p align="center"><a href="#top">inicio</a></p>
<h2><a name="uninstallation">Desinstalaci&oacute;n del software</a></h2>
<p>Siga las instrucciones en esta secci&oacute;n para desinstalar el IDE de su sistema. Estas instrucciones de desinstalaci&oacute;n se aplica a todas las plataformas permitidas. Para obtener la lista de las plataformas compatibles, consulte las <a href="relnotes_es.html">notas de la versi&oacute;n</a>.</p>
<div>
<h3><a name="uninstall_windows">Microsoft Windows</a></h3>
<p>Si es necesario, puede desinstalar el IDE NetBeans, el servidor GlassFish OSE (Open Source Edition) 3.0.1, y Apache Tomcat usando los siguientes procedimientos.</p>
<p><b>Para desinstalar el IDE</b>:</p>
<ol>
  <li>Cierre el IDE.
  </li>
  <li>Desde el panel de control, Seleccione A&ntilde;adir o quitar programas, despu&eacute;s seleccione el IDE NetBeans 6.9.1 y haga clic en quitar.</li>
</ol>
<p><b>Para desinstalar el servidor GlassFish OSE (Open Source Edition) 3.0.1: </b></p>
<ol>
  <li>Ci&eacute;rrelo.</li>
  <li>Desde el panel de control, Seleccione A&ntilde;adir o quitar programas, despu&eacute;s seleccione el Servidor GlassFish OSE (Open Source Edition) 3.0.1 y haga clic en quitar.</li>
</ol>
<p><b>Para desinstalar Apache Tomcat: </b></p>

<ol>
  <li>Cierre el IDE.</li>
  <li>Desde el panel de control, Seleccione A&ntilde;adir o quitar programas, despu&eacute;s seleccione Apache Tomcat 6.0.26 y haga clic en quitar.</li>
</ol>
</div>
<div>
<h3><a name="uninstall_sollinux">Solaris OS, Linux</a></h3>
<p>Si es necesario, puede desinstalar el IDE NetBeans, el servidor GlassFish OSE (Open Source Edition) 3.0.1, y Apache Tomcat usando los siguientes procedimientos.</p>
<p><b>Para desinstalar el IDE</b>:</p>

<ol>
  <li>Ci&eacute;rrelo.</li>
  <li>En el directorio de instalaci&oacute;n del IDE, ejecute el archivo <tt>uninstall.sh</tt>. </li>
  <li>Para desinstalar GlassFish y Tomcat juntamente con el IDE, en la pagina de resumen compruebe que aparecen listadas las versiones correctas y marque las casillas apropiadas. </li>
  <li>En la p&aacute;gina Resumen, haga clic en Desinstalar. 
  </li>
  <li>Cuando finalice la desinstalaci&oacute;n, haga clic en Terminar.</li>
</ol>
<p><b>Para desinstalar el servidor GlassFish OSE (Open Source Edition) 3.0.1</b>:</p>
<ol>
  <li>Cierre el IDE.</li>
  <li>Busque el directorio de instalaci&oacute;n del servidor de aplicaciones.
  <p><b>Nota</b>: La localizaci&oacute;n predeterminada de la instalaci&oacute;n es diferente dependiendo del tipo de instalaci&oacute;n y de plataforma. La tabla siguiente muestra el directorio de instalaci&oacute;n del servidor de aplicaciones predeterminado en las distintas plataformas.</p>

  <table>
    <tbody>
        <tr class="tblheader">
            <th width="70">Plataforma</th>
            <th width="101">Instalar como...</th>
			<th width="264">Instalaci&oacute;n de GlassFish 3.0.1 </th>
        </tr>
        <tr class="tbltd0">
          <td>Windows</td>
          <td>usuario con derechos de administrador</td>
          <td><tt>%ProgramFiles%\glassfish-3.0.1</tt></td>
        </tr>
        <tr class="tbltd0">
          <td>Windows</td>
          <td>usuario</td>
          <td><tt>%USERPROFILE%\glassfish-3.0.1</tt></td>
        </tr>
        <tr class="tbltd0">
            <td>Solaris&nbsp;OS&nbsp;</td>
            <td>ra&iacute;z</td>
			 <td><tt>/opt/glassfish-3.0.1</tt></td>
        </tr>
        <tr class="tbltd1">

            <td>Solaris&nbsp;OS, Linux</td>
            <td valign="top">usuario</td>
			<td valign="top"><tt>~/glassfish-3.0.1</tt></td>
        </tr>
        <tr class="tbltd0">
            <td>Linux</td>
            <td>ra&iacute;z</td>
			<td><tt>/usr/local/glassfish-3.0.1</tt></td>
        </tr>
    </tbody>
</table>
  </li>
  <li>En el directorio de instalaci&oacute;n del servidor de aplicaciones, ejecute el archivo <tt>uninstall.sh</tt>.</li>

  <li>En la p&aacute;gina Resumen, haga clic en Desinstalar.
  </li>
  <li>Cuando finalice la desinstalaci&oacute;n, haga clic en Terminar.</li>
</ol>
<p><b>Para desinstalar Apache Tomcat: </b></p>
<ol>
  <li>Cierre el IDE.</li>

  <li>Busque el directorio de instalaci&oacute;n de Apache Tomcat y ejecute el archivo <tt>uninstall.sh</tt>. 
  </li>
  <li>En la p&aacute;gina Resumen, haga clic en Desinstalar. </li>
  <li>Cuando finalice la desinstalaci&oacute;n, haga clic en Terminar.</li>
</ol>
</div>

<div>
<h3><a name="uninstall_mac" id="uninstall_mac">Mac OS X</a></h3>
<p><b>Para desinstalar el IDE y el servidor de aplicaciones</b>:</p>
<ol>
  <li>Cierre el software.</li>
  <li>Arrastre las carpetas o los archivos del programa a la Papelera. Tenga en cuenta que la ubicaci&oacute;n predeterminada del IDE y del servidor de aplicaciones es <tt>/Aplicaciones/NetBeans/</tt>.  </li>
</ol>
</div>

<div>
<h3><a name="uninstall_zip" id="uninstall_zip">Paquete independiente de la plataforma</a></h3>
<p>Para desinstalar los archivos del IDE, siga los pasos que se describen en la secci&oacute;n <a href="#clean">Limpieza tras instalaciones incompletas</a> de este documento. </p>
</div>

<p align="center"><a href="#top">inicio</a></p>

<h2><a name="upgrading"></a>Soporte para la actualizaci&oacute;n e instalaci&oacute;n m&uacute;ltiple</h2>
<p>En el mismo sistema junto al IDE NetBeans 6.9.1, pueden coexistir diversas instalaciones del IDE NetBeans 5.x y 6.x. No tiene que desinstalar las versiones previas para poder instalar o ejecutar el IDE NetBeans 6.9.1. </p>
<p>Si dispone de una instalaci&oacute;n previa del IDE NetBeans puede escoger si desea importar, o no, las preferencias de usuario desde un directorio de usuario existente cuando ejecute el IDE NetBeans 6.9.1 por primera vez.</p>
<p><span class="notes"><b>Nota</b>: En estos momentos no se pueden realizar actualizaciones incrementales de versiones del IDE. Para actualizar a la versi&oacute;n m&aacute;s reciente tiene que descargar el &uacute;ltimo instalador.</span></p>
<p align="center"><a href="#top">inicio</a></p>
<h2><a name="troubleshooting" id="troubleshooting"></a>Resoluci&oacute;n de problemas</h2>
<div>
<h3>Acerca del directorio de trabajo del instalador</h3>
<p>El programa de instalaci&oacute;n almacena datos sobre las sesiones de instalaci&oacute;n en el directorio de trabajo del instalador. Ejemplos de estos datos son la lista de componentes instalados en el sistema, los mensajes de registro de la instalaci&oacute;n y los datos de registro. </p>

<p>La ubicaci&oacute;n predeterminada del directorio de trabajo del instalador es <tt>%PERFILUSUARIO%\.nbi</tt> en Windows y <tt>~/.nbi</tt> en las dem&aacute;s plataformas. El subdirectorio de registro contiene los archivos de registro de la instalaci&oacute;n. </p>
</div>
<div>
<h3><a name="clean"></a>Limpieza tras instalaciones incompletas</h3>
<p>Tras una instalaci&oacute;n incompleta o incorrecta, quiz&aacute; deba limpiar el sistema de instalaciones anteriores. </p>
<p><b>En Microsoft Windows, Solaris SO y Linux:</b></p>
<ol>

  <li>Elimine el directorio de trabajo del instalador.</li>
  <li>Elimine los directorios de instalaci&oacute;n del IDE y del servidor de aplicaciones GlassFish.</li>
  <li>En Windows, elimine todas las entradas del registro que contengan <tt>nbi*</tt> de las siguientes claves de registro: <tt>HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall</tt> <tt>HKEY_CURRENT_USER\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall</tt> </li>

</ol>
<p><b>En Mac OS X:</b></p>
<ul>
  <li>Arrastre las carpetas o los archivos del programa a la Papelera. </li>
</ul>
</div>
<div>
<h3>Deshabilitar software espec&iacute;fico antes de la instalaci&oacute;n</h3>
<p>Es recomendable deshabilitar servidores de seguridad, antivirus y aplicaciones de supervisi&oacute;n antes de iniciar la instalaci&oacute;n. Algunas de estas aplicaciones pueden evitar que los componentes del IDE se configuren correctamente durante el proceso de instalaci&oacute;n. </p>
<p>Por ejemplo, si la aplicaci&oacute;n Logitech Process Monitor (<tt>LVPrcSrv.exe</tt>) se est&aacute; ejecutando en el sistema, debe desactivarla antes de la instalaci&oacute;n. </p>

</div>
<p align="center"><a href="#top">inicio</a></p>
<h2><a name="moreinformation"></a>M&aacute;s informaci&oacute;n</h2>

<ul>
<li><a href="index_es.html">Informaci&oacute;n del lanzamiento del IDE NetBeans 6.9.1</a></li>
<li><a href="relnotes_es.html">Notas de lanzamiento del IDE NetBeans 6.9.1</a></li>
<li><a href="http://wiki.netbeans.org/NetBeansUserFAQ#Installation" target="_blank">Preguntas frecuentes de instalaci&oacute;n del IDE NetBeans</a></li>
</ul>
<div class="feedback-box"><a href="https://netbeans.org/about/contact_form.html?to=3&subject=Feedback: NetBeans IDE 6.9.1 Installation Instructions">Env&iacute;enos sus comentarios</a>
</div>
<br style="clear:both;">
<p align="center"><a href="#top">arriba</a></p>
</body>
</html>
