<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">

<!--
Copyright (c) 2009, 2010, Oracle and/or its affiliates. All rights reserved.
-->

<html>
    <head>
        <title>Assist&egrave;ncia de codi en d'editor Java de l'IDE NetBeans: Una guia de refer&egrave;ncia a l'IDE NetBeans 6.8</title>
        <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" >
        <link rel="stylesheet" type="text/css" href="../../../netbeans.css" media="screen">
		 <script src="../../../images_www/js/listCollapse.js" type="text/javascript"></script>
        <meta content="?and? 0.5.5" name="GENERATOR">
        <style type="text/css">
            .floatright {
                float: right;
                margin: 0 0 10px 10px;
                border: 1px solid #666;
                padding: 2px;
            }
            .repo {
                padding-top: .7em;
                line-height: 1.2em;
            }
       
        .style1 {font-style: italic}
        </style>
    </head>

    <body>      
   
        <h1>
        <!-- Begin Content Area -->
        <a name="top"></a> Assist&egrave;ncia de codi en d'editor Java de l'IDE NetBeans: Una guia de refer&egrave;ncia
        </h1>
        <p>El prop&ograve;sit de qualsevol entorn de desenvolupament integrat (IDE) &eacute;s maximitzar la productivitat i els suport al desenvolupament sense traves des d'una eina senzilla. Aquest document de refer&egrave;ncia descriu les caracter&iacute;stiques &uacute;tils d'assist&egrave;ncia de codi, opcions personalitzables, i les capacitats de navegaci&oacute; de l'editor Java de l'IDE NetBeans. Moltes d'aquestes caracter&iacute;stiques han estat disponibles en altres versions anteriors de l'IDE NetBeans 6.8, aquesta guia ha estat escrita i verificada un altre cop per al &uacute;ltim llan&ccedil;ament, el qual &eacute;s l'IDE NetBeans 6.8. </p>
        <!-- <p>See the &lt;link to screencast_TO_DO&gt; screencast for examples of using the NetBeans IDE's code productivity features. </p> -->
        <h3>Continguts</h3>
        <img src="../../../images_www/articles/68/netbeans-stamp.gif" class="stamp" width="114" height="114" alt="El contingut d'aquesta p&agrave;gina s'aplica al IDE NetBeans 6.8" title="El contingut d'aquesta p&agrave;gina s'aplica al IDE NetBeans 6.8">
        <ul id="collapsableList">
            <li><a href="#codecompletion">Auto-completat de codi perspica&ccedil;</a>
              <ul>
                <li><a href="#invoke">Invocant l'auto-completat de codi</a></li>
                <li><a href="#smart">Suggeriments perspica&ccedil;os al principi</a></li>
                <li><a href="#keywords">Auto-completant paraules</a></li>
                <li><a href="#names">Suggerint noms per variables i camps</a> </li>
                <li><a href="#parameters">Suggerint par&agrave;metres</a></li>
                <li><a href="#prefix">Auto-completat de prefix com&uacute;</a></li>
              </ul>
            </li>
            <li><a href="#imports">Gestionant importacions</a></li>
          <li><a href="#generatecode">Generant codi</a></li>
            <li><a href="#livetemplates">Utilitzant plantilles aut&ograve;nomes</a></li>
            <li><a href="#javadoc">Treballant amb Javadoc</a>
              <ul>
                <li><a href="#display">Mostrant Javadoc</a> </li>
                <li> <a href="#create">Creant Stubs de Javadoc</a></li>
                <li> <a href="#hints">Utilitzant indicacions Javadoc</a></li>
                <li><a href="#usecc"> Utilitzant la l'auto-completat de codi per etiquetes Javadoc </a></li>
                <li><a href="#generate-javadoc">Generant Javadoc</a></li>
                <li><a href="#analyze-javadoc">Analitzant Javadoc</a>  </li>
              </ul>
            </li>
			<li><a href="#hints">Utilitzant indicacions</a>
			<ul>
			<li><a href="#hints-tofix">Utilitzant indicacions per corregir codi</a></li>
			<li><a href="#hints-customize">Personalitzant indicacions</a></li>
			<li><a href="#surround">Encerclar amb...</a> </li>
			</ul>
			</li>
			
            <li><a href="#editor-features">Caracter&iacute;stiques generals d'edici&oacute;</a>
			<ul>
			<li><a href="#formatting">Formataci&oacute; del codi</a></li>
			<li><a href="#braces">Inserint i ressaltant claus, claud&agrave;tors i cometes</a></li>
			<li><a href="#codefolding">Replegament del codi</a> </li>
			<li><a href="#customizeshortcuts">Personalitzant les dreceres de teclat</a>  </li>
			</ul>
			</li>
            <li><a href="#coloring">Acoloriment i ressaltament sem&agrave;ntic</a>
              <ul>
			<li><a href="#customizecolors">Personalitzant colors</a></li>
			<li><a href="#example">Exemple d'acoloriment</a></li>
			<li><a href="#highlights">Utilitzant ressaltaments</a> </li>
              </ul>
			</li>
            <li><a href="#navigation">Navegaci&oacute;</a> 
			<ul>
			<li><a href="#stripes">Subratllat d'errors </a></li>
			<li><a href="#goto">Navegant des de l'editor: Anar a...</a></li>
			<li><a href="#lastedit">Saltant a l'&uacute;ltima edici&oacute;</a></li>
			<li><a href="#switchfiles">Alternaci&oacute; entre fitxers</a></li>
			<li><a href="#bookmarks">Utilitzant marcadors</a></li>
			<li><a href="#navigator">Utilitzant el navegador</a> </li>
			</ul>
			</li>
            <li><a href="#appendixa">Ap&egrave;ndix A: Icones en la finestra d'auto-completat de codi</a></li>
    </ul>
     
     <p><b>Per completar aquesta guia d'aprenentatge, necessiteu el programari i recursos llistats en la seg&uuml;ent taula.</b></p>

<table>
  <tbody>
    <tr>
      <th class="tblheader" scope="col">Programari o recurs</th>
      <th class="tblheader" scope="col">Versi&oacute; necess&agrave;ria</th>
    </tr>
        <tr>
            <td class="tbltd1"><a href="http://download.netbeans.org/netbeans/6.8/beta/" target="_blank">IDE NetBeans</a></td>
            <td class="tbltd1">versi&oacute; 6.8 (desc&agrave;rrega Java) </td>
        </tr>
        <tr>
            <td class="tbltd1"><a href="http://java.sun.com/javase/downloads/index.jsp" target="_blank">Kit de desenvolupament de Java(JDK)</a></td>
            <td class="tbltd1">versi&oacute; 6 o<br>
            versi&oacute; 5</td>
        </tr>
  </tbody>
</table>
 
<h2><a name="codecompletion"></a>Auto-completat de codi perspica&ccedil;</h2>
<p>L'editor de Java de l'IDE NetBeans us ajuda a completar r&agrave;pidament i generar codi per mitj&agrave; de la caracter&iacute;stica d'auto-completat de codi En un sentit general, l'auto-completat de codi &eacute;s molt &uacute;til quan voleu omplir el codi que falta, observar les opcions disponibles en el context de la vostra aplicaci&oacute;, i generar blocs de codi quant es necessitin. Vegeu a continuaci&oacute; exemples de com utilitzar l'auto-completat de codi. </p>
<h3><a name="invoke"></a>Invocant l'auto-completat de codi</h3>
                 <table class="full-width colapse">
         <tr>
            <td width="43%">
            <img src="../../../images_www/articles/73/java/editor-codereference/codecompletion3.png" alt="Imatge que mostra la caixa d'auto-completat de codi" width="426" height="225" >  </td>
            <td width="57%" class="valign-top"><p>Premeu <tt>Ctrl-Espai</tt> (o seleccioneu Codi &gt; Auto-completar codi des del men&uacute; principal) per obrir la caixa d'auto-completat de codi. Mentre esteu escrivint, el llistat redu&iuml;t de suggeriments. Els suggeriments llistats inclouen aquells importats al vostre fitxer de codi i els s&iacute;mbols del paquet <tt>java.lang</tt>. </p>
              <p>Per personalitzar les prefer&egrave;ncies d'auto-completat de codi, seleccioneu Eines &gt; Opcions &gt; Editor &gt; Auto-completat de codi. </p>
              <p>Per exemple, podeu establir la finestra d'auto-completat de codi a emergir tant de forma autom&agrave;tica o &uacute;nicament quant sigui necessari. En la pestanya d'auto-completat de codi, seleccionar la casella Finestra emergent auto-completat, per invocar autom&agrave;ticament la finestra d'auto-completat de codi quant estigueu escrivint certs car&agrave;cters. El car&agrave;cter predeterminat &eacute;s &quot;<tt>.</tt>&quot;, per&ograve; podeu afegir els vostres propis car&agrave;cters. </p>
              <p>Per afegir car&agrave;cters que invoquin la finestra d'auto-completat, seleccioneu Java des del llistat desplegable d'Idioma, i escriviu els vostres car&agrave;cters al camp Activadors auto-emergir per Java La finestra d'auto-completat de codi emergir&agrave; cada cop que escriviu els car&agrave;cters especificats.</p>
            <p>Quan la casella de selecci&oacute; Finestra emergent auto-completat, est&agrave; deshabilitada, necessiteu pr&eacute;mer <tt>Ctrl-Espai</tt> cada cop que vulgueu utilitzar l'auto-completat de codi. </p>
            </td>
         </tr>
    </table>

            
                 <h3><a name="smart"></a>Suggeriments perspica&ccedil;os al principi </h3>
            <table class="full-width colapse">
         <tr>
            <td width="45%">
            <img src="../../../images_www/articles/73/java/editor-codereference/smartcompletion1.png" alt="Imatge que mostra la caixa d'auto-completat de codi amb suggeriments perspica&ccedil;os." width="418" height="217">  </td>
            <td width="55%" class="valign-top"><p>En el IDE NetBeans, l'auto-completat de codi de Java &eacute;s &quot;perspica&ccedil;&quot;, aix&ograve; significa que tots els  suggeriments que s&oacute;n m&eacute;s rellevants pel context del vostre codi s&oacute;n mostrats al principi, per damunt de la l&iacute;nia negra de la finestra d'auto-completat de codi. </p>
              <p>En l'exemple de l'esquerra, l'editor suggereix la inserci&oacute; del constructor <tt>LinkedHashMap</tt> del paquet <tt>java.util</tt>. </p>
           <p>Si el suggeriment &quot;perspica&ccedil;&quot; no &eacute;s cap dels que voleu, premeu <tt>Ctrl-Espai</tt> un altre com per visualitzar tot el llistat. </p></td>
         </tr>
    </table>
            <h3><a name="keywords"></a>Auto-completant paraules</h3>
			<table class="full-width colapse">
         <tr>
            <td width="45%">
            <img src="../../../images_www/articles/73/java/editor-codereference/keywords.png" alt="Imatge que mostra l'auto-completat de paraules" class="img-left">  </td>
           <td width="55%" class="valign-top"><p>Utilitzeu l'auto-completat de codi (<tt>Ctrl-Espai</tt>) per completar paraules al vostre codi. L'editor analitza el context i suggereix les paraules m&eacute;s rellevants. </p>
              <p>En l'exemple de l'esquerra, la classe <tt>ColorChooserDemo</tt> amplia la classe <tt>JPanel</tt>. Podeu afegir r&agrave;pidament la paraula <tt>extends</tt> des dels elements suggerits.</p>
           </td>
         </tr>
    </table>

            <h3><a name="names"></a>Suggerint noms per a variables i camps </h3>
            <table width="1216" class="full-width colapse">
         <tr>
            <td width="45%">
           <img src="../../../images_www/articles/73/java/editor-codereference/names.png" alt="Imatge que mostra l'auto-completat de noms i camps."> </td>
            <td width="55%" class="valign-top"><p>Quant esteu afegint una nova variable o nou camp, utilitzeu l'auto-completat de codi (<tt>Ctrl-Espai)</tt> per afegir un nom que coincideixi amb el seu tipus. </p>
           <p>Escriviu un prefix pel nou nom, premeu <tt>Ctr-Space</tt> i seleccioneu el nom que voleu utilitzar dels noms suggerits. </p></td>
         </tr>
    </table>
			
			 
			<h3><a name="parameters"></a>Suggerint par&agrave;metres</h3>
            <table class="full-width colapse">
         <tr>
            <td width="45%">
          <img src="../../../images_www/articles/73/java/editor-codereference/parameter.png" alt="Imatge que mostra els suggeriments per formats de par&agrave;metre." width="423" height="62"> </td>
            <td width="55%" class="valign-top"><p>L'editor s'imagina les variables, els m&egrave;todes o els camps, pels par&agrave;metres i mostra els suggeriment en una caixa emergent. </p>
              <p>Per exemple, quant seleccioneu un m&egrave;tode des de la finestra d'auto-completat de codi el qual t&eacute; un o m&eacute;s arguments, L'editor ressalta el primer argument i mostra un consell suggerint el format per aquest argument. Per a despla&ccedil;ar al seg&uuml;ent argument, premeu les tecles <tt>Tabulador</tt> o <tt>Retorn</tt>. </p>
              <p>Podeu invocar els consells amb els par&agrave;metres del m&egrave;tode tot prement <tt>Ctrl-P</tt> (o Codi &gt; Mostrar par&agrave;metres m&egrave;tode) en qualsevol moment. </p>
           </td>
         </tr>
    </table>
			<h3><a name="prefix"></a>Auto-completat de prefix com&uacute;</h3>
			 <table class="full-width colapse">
         <tr>
            <td width="44%">
          <img src="../../../images_www/articles/73/java/editor-codereference/prefixcompletion.png" alt="Imatge que mostra l'auto-completat de prefixes." width="355" height="207"> </td>
            <td width="56%" class="valign-top"><p>Podeu utilitzar la tecla <tt>Tabulador</tt> per omplir r&agrave;pidament amb els prefixes m&eacute;s freq&uuml;entment utilitzats i amb senzills suggeriments. </p>
              <p>Per comprovar com funciona aquesta caracter&iacute;stica, intenteu d'escriure el seg&uuml;ent:</p>
              <ol>
                <li>Escriviu <tt>System.out.p</tt> i espereu que l'auto-completat de codi mostri tots els camps i m&egrave;todes que comencin amb &quot;p.&quot; tots els suggeriments estaran relacionats amb &quot;print.&quot; </li>
                <li>Premeu la tecla <tt>Tabulador</tt> i l'editor omplir&agrave; autom&agrave;ticament amb &quot;print&quot;. <br>
                Podeu continuar i escriure &quot;l&quot; i, despr&eacute;s de pr&eacute;mer Tabulador, &quot;println&quot; ser&agrave; afegit. </li>
              </ol>
           </td>
         </tr>
    </table>
	
				<p>En la finestra d'auto-completat de codi, les icones s'utilitzen per distingir membres diferents del llenguatge Java. Vegeu l'<a href="#appendixa">Ap&egrave;ndix A</a> al final d'aquest document per visualitzar el significat d'aquestes icones. </p>
	            <a href="#top">principi</a>
				<h2><a name="imports"></a>Gestionant importacions</h2>
			<p>Hi han diverses maneres de com podeu treballar amb les sent&egrave;ncies d'importaci&oacute;. L'editor Java de l'IDE comprova constantment el vostre codi per a la correcta utilitzaci&oacute; de les sent&egrave;ncies d'importaci&oacute;, i immediatament us adverteix quant es detecten classes sense importar o importacions sense utilitzar.			</p>
			<table class="full-width colapse">
         <tr>
            <td width="45%">
              <p><img src="../../../images_www/articles/73/java/editor-codereference/imports3.png" alt="Imatge que mostra els suggeriments per a una sent&egrave;ncia d'importaci&oacute;." width="367" height="186"> </p>
           <p>&nbsp;</p></td>
            <td width="55%" class="valign-top"><p>Quant es troba una classes sense importar, la marca d'error amb la <img src="../../../images_www/articles/73/java/editor-codereference/bulberror1.png" alt="icona bombeta d'error"> apareix al cant&oacute; del marge esquerra de l'IDE (aquest marge tamb&eacute; &eacute;s anomenat <em>marge de s&iacute;mbol</em>). Cliqueu a la marca d'error i seleccioneu si voleu afegir la importaci&oacute; que falta, o si voleu crear aquesta classe en el paquet actual. </p>
              <p>Mentre esteu escrivint, premeu <tt>Ctrl-Maj&uacute;s-I</tt> (o seleccioneu Codi &gt; Corregir importacions, des del men&uacute;) per afegir les sent&egrave;ncies d'importaci&oacute; que hi falten.</p>
              <p>Premeu <tt>Alt-Maj&uacute;s-I</tt> per afegir &uacute;nicament una importaci&oacute; pel tipus al qual el cursor est&agrave; situat.  </p>
           <p>&nbsp;</p>              </td>
         </tr>
		 <tr>
            <td width="45%">
          <img src="../../../images_www/articles/73/java/editor-codereference/imports2.png" alt="Imatge que mostra l'addici&oacute; autom&agrave;tica de sent&egrave;ncies d'importaci&oacute;."> </td>
            <td width="55%" class="valign-top"><p>Quant seleccioneu una classe des de la finestra d'auto-completat de codi, l'editor autom&agrave;ticament l'hi afegeix una sent&egrave;ncia d'importaci&oacute;, per tant no us heu de preocupar per aix&ograve;. </p>
           </td>
         </tr>
		 <tr>
           <td width="45%"><img src="../../../images_www/articles/73/java/editor-codereference/imports.png" alt="Imatge que mostra l'eliminaci&oacute; autom&agrave;tica d'importacions sense utilitzar."></td>
            <td width="55%" class="valign-top"><p>Si hi han sent&egrave;ncies d'importaci&oacute; sense utilitzar al vostre codi, premeu la marca d'error de la <img src="../../../images_www/articles/73/java/editor-codereference/bulberror.png" alt="icona bombeta d'advert&egrave;ncia"> en el marge del cant&oacute; esquerra de l'editor i seleccioneu treure una importaci&oacute; sense utilitzar, o b&eacute; treure totes les importacions sense utilitzar. En l'editor, les importacions sense utilitzar estan subratllades (per a m&eacute;s detalls vegeu la secci&oacute; <a href="#coloring">sem&agrave;ntica d'acoloriment</a>).</p>
           <p>Per a visualitzar r&agrave;pidament si el vostre codi cont&eacute; importacions sense utilitzar o que hi falten, observeu les ratlles al cat&oacute; del marge dret: les ratlles taronja marquem importacions sense utilitzar o que hi falten.  </p></td>
         </tr>
    </table>
			<p class="align-center"><a href="#top">principi</a></p>
			<h2><a name="generatecode"></a>Generant codi</h2>
			<p>Quant treballau en l'editor Java, podeu generar trossos de codi d'una de les dos maneres seg&uuml;ents: per mitj&agrave; de l'auto-completat de codi, o des del quadre de di&agrave;leg de generaci&oacute; de codi. Anem a donar un cop d'ull a exemples senzills de generaci&oacute; autom&agrave;tica de codi. </p>
			<h3>Utilitzant el quadre de di&agrave;leg de generaci&oacute; de codi </h3>
			<table class="full-width colapse">
              <tr>
                <td width="44%"><p><img src="../../../images_www/articles/73/java/editor-codereference/codegeneration1.png" alt="Imatge que mostra la generaci&oacute; de codi des del quadre de di&agrave;leg de generaci&oacute; de codi."></p>
                <p>&nbsp; </p></td>
                <td width="56%" class="valign-top"><p>Premeu <tt>Alt-Ins</tt> (o seleccioneu Codi &gt; Inserir codi) en qualsevol lloc de l'editor per inserir un constructor des dels quadre de di&agrave;leg de generaci&oacute; de codi. El llistat de suggeriments s'ajusta al context actual.</p>
                  <p>En l'exemple de l'esquerra, anem a generar un constructor per la classe Sample. Premeu <tt>Alt-Ins</tt>, seleccioneu el constructor des del quadre de generaci&oacute; de codi, i indiqueu els camps que s'inicialitzaran amb el constructor. L'editor generar&agrave; el constructor amb els par&agrave;metres especificats.</p>
                  <p>En l'editor Java de l'IDE, podeu generar autom&agrave;ticament diversos constructors i totalitat de m&egrave;todes, sobreescriure i delegar m&egrave;todes, i propietats i m&eacute;s. </p>
                </td>
              </tr>
    </table>
			  <h3>Utilitzant l'auto-completat </h3>
			  <table class="full-width colapse">
              <tr>
                <td width="44%"><img src="../../../images_www/articles/73/java/editor-codereference/codegeneration2.png" alt="Imatge que mostra la generaci&oacute; de codi des de la finestra d'auto-completat de codi"> </td>
                <td width="56%" class="valign-top"><p>Tamb&eacute; podeu generar codi des de la finestra d'auto-completat de codi. En aquest exemple, utilitzem el mateix tros de codi citat anteriorment per mostrar com podeu generar codi des de la finestra d'auto-completat de codi.</p>
                    <p>Premeu Ctrl-Espai per obrir la finestra d'auto-completat de codi i seleccioneu el seg&uuml;ent element: <tt>Sample(String name, int number) - generar</tt>. L'editor genera un constructor amb els par&agrave;metres especificats.</p>
                    <p>En la finestra d'auto-completat de codi, els constructors que es poden generar estan marcats amb la <img src="../../../images_www/articles/73/java/editor-codereference/newconstructor.png" alt="Icona de generaci&oacute;"> icona i la nota &quot;<tt>generar</tt>&quot;. Per a m&eacute;s aclariments quant a aquestes icones, vegeu l'<a href="#appendixa">Ap&egrave;ndix A</a>.</p></td>
              </tr>
            </table>
	<p class="align-center"><a href="#top">principi</a></p>
	<h2><a name="livetemplates"></a>Plantilles aut&ograve;nomes</h2>
	<p>Una plantilla aut&ograve;noma &eacute;s una pe&ccedil;a pre-definida de codi que t&eacute; una abreviatura associada amb ella. Vegeu els seg&uuml;ents exemples que mostren con utilitzar les plantilles aut&ograve;nomes.</p>
	<h3>Utilitzant plantilles aut&ograve;nomes</h3>
	<table class="full-width colapse">
              <tr>
                <td width="44%"><p><img src="../../../images_www/articles/73/java/editor-codereference/livetemplate.png" alt="Imatge que mostra la inserci&oacute; d'una plantilla aut&ograve;nom des de la finestra d'auto-completat de codi" ></p>
                </td>
                <td width="56%" class="valign-top"><p>Les plantilles aut&ograve;nomes est&agrave;n marcades amb la icona <img src="../../../images_www/articles/73/java/editor-codereference/codetemplateicon.png" alt="Icona de platilla aut&ograve;noma" width="16" height="16"> en la finestra d'auto-completat de codi. </p>
                  <p>Podeu fer una de les seg&uuml;ents coses:</p>
                  <ul>
                    <li>Seleccionar una plantilla des de la finestra d'auto-completat de codi i pr&eacute;mer Retorn, o b&eacute; </li>
                    <li>Escriure una abreviatura per aquesta plantilla i pr&eacute;mer la tecla que expandeix aquesta plantilla (Per defecte, <tt>Tabulador</tt>). </li>
                  </ul>
                <p>En la plantilla expandida, les parts editables es mostren amb caixes blaves. Utilitzeu la tecla <tt>Tabulador</tt> per a despla&ccedil;ar-vos per les parts que necessiteu editar. </p>                </td>
              </tr>
    </table>
			  <h3>Afegint o editant plantilles aut&ograve;nomes </h3>
			  <table class="full-width colapse">
              <tr>
                <td width="44%"><p><img src="../../../images_www/articles/73/java/editor-codereference/templateoptions.png" alt="Imatge que mostra com personalitzar les plantilles aut&ograve;nomes." width="453" height="595" ></p>
                </td>
                <td width="56%" class="valign-top"><p>Per personalitzar les plantilles aut&ograve;nomes:</p>
                  <ol>
                    <li>Seleccioneu Eines &gt; Opcions &gt; Editor &gt; Plantilles de codi. </li>
                    <li>Des del llistat desplegable de Llenguatge, seleccioneu Java. Es mostra el llistat d'abreviatures i plantilles associades. </li>
                    <li>Utilitzeu els botons Nou i Treure per a afegir o treure plantilles del llistat. Per editar una plantilla existent, seleccioneu la plantilla i editeu el codi en el camp Text expandit sota el llistat.</li>
                    <li>Seleccioneu la tecla que s'utilitzar&agrave; per expandir la plantilla. La tecla predeterminada &eacute;s <tt>Tabulador</tt>. </li>
                  </ol>                  
                <p>Vegeu <a href="http://wiki.netbeans.org/Java_EditorUsersGuide#How_to_use_Live_Templates" target="_blank">aquest document</a> per a con&egrave;ixer m&eacute;s quant a la sintaxis per escriure noves plantilles aut&ograve;nomes. </p></td>
              </tr>
    </table>
              <p><a href="#top">principi</a>    </p>
              <h2><a name="javadoc"></a>Treballant amb Javadoc</h2>
	<p>Utilitzeu les seg&uuml;ents caracter&iacute;stiques que faciliten l'escriptura de Javadoc pel vostre codi. </p>
	<h3><a name="display"></a>Mostrant Javadoc </h3>
	<table class="full-width colapse">
              <tr>
                <td width="45%"><img src="../../../images_www/articles/73/java/editor-codereference/javadoc.png" alt="Imatge que mostra la finestra Javadoc."> </td>
                <td width="55%" class="valign-top"><p>Situeu el cursor damunt d'un element i premeu <tt>Ctrl-Maj-Espai (o seleccioneu Codi &gt; Mostrar documentaci&oacute;)</tt>. Es mostra en una finestra emergent amb el Javadoc per aquest element. </p>
                  <p>En el men&uacute; principal de l'IDE, cliqueu a Finestra &gt; Altres &gt; Javadoc, per obrir la finestra Javadoc, en la qual la documentaci&oacute; &eacute;s autom&agrave;ticament refrescada per la localitzaci&oacute; del vostre cursor.  </p>
                  <p>&nbsp;</p>
                  <p>&nbsp; </p>
                <p class="style1">&nbsp;</p></td>
              </tr>
    </table>
	<h3><a name="create"></a>Creant Stubs Javadoc </h3>
	<table class="full-width colapse">
              <tr>
                <td width="45%"><img src="../../../images_www/articles/73/java/editor-codereference/javadoc1.png"  ></td>
                <td width="55%" class="valign-top"><p>Situeu el cursor per damunt del m&egrave;tode o classe que no tingui Javadoc, escriviu <tt>&quot;/**</tt>&quot;, i premeu <tt>Retorn</tt>. </p>
                  <p>El IDE crea l'estructura esquel&egrave;tica per a un comentari Javadoc omplert amb algun contingut. Si teniu la finestra Javadoc oberta, observareu els canvis autom&agrave;ticament quan escriviu. </p>
                  <p class="style1">&nbsp;</p></td>
              </tr>
    </table>
	<h3><a name="hints"></a>Utilitzant indicacions Javadoc</h3>
	<table class="full-width colapse">
              <tr>
                <td width="45%"><img src="../../../images_www/articles/73/java/editor-codereference/javadoc2.png" width="434" height="108"></td>
                <td width="55%" class="valign-top"><p>El IDE mostra les indicacions quant falta Javadoc o es necessiten etiquetes Javadoc. </p>
                  <p>Cliqueu a la icona bombeta del cant&oacute; del marge esquerra de l'editor per corregir errors Javadoc. </p>
                  <p>Si no voleu visualitzar les indicacions relacionades amb Javadoc, seleccioneu Eines &gt; Opcions &gt; Editor &gt; Indicacions, i netegeu la casella de selecci&oacute; de Javadoc en el llistat de les indicacions que s&oacute;n mostrades. </p>
                </td>
              </tr>
    </table>
	<h3><a name="usecc"></a>Utilitzant auto-completat de codi per etiquetes Javadoc </h3>
	<table width="100%" class="full-width colapse">
              <tr>
                <td width="45%"><img src="../../../images_www/articles/73/java/editor-codereference/javadoc3.png" width="240" height="177"></td>
                <td width="55%" class="valign-top"><p>L'auto-completat de codi est&agrave; disponible per a etiquetes Javadoc. </p>
                  <p>Escriviu el s&iacute;mbol &quot;@&quot; i espereu mentre s'obre la finestra d'auto-completat de codi (depenent de les vostres prefer&egrave;ncies, potser necessiteu pr&eacute;mer <tt>Ctrl-Espai</tt>). </p>
                </td>
              </tr>
    </table>
			<h3><a name="generate-javadoc" id="generate-javadoc"></a>Generant Javadoc </h3>
			<table width="100%" class="full-width colapse">
              <tr>
                <td width="45%"><img src="../../../images_www/articles/73/java/editor-codereference/generate.png" ></td>
                <td width="55%" class="valign-top"><p>Per generar Javadoc per un projecte, seleccioneu l'element del men&uacute; Execuci&oacute; &gt; Generar Javadoc (o cliqueu amb el bot&oacute; dret al projecte en la finestra de projectes, i seleccioneu Generar Javadoc) El IDE generar&agrave; el Javadoc i l'obrir&agrave; en una finestra de navegaci&oacute; separada.</p>
                  <p>En l'exemple de la dreta, podeu veure un exemple de sortida de la comanda Generar de Javadoc. Si hi han advert&egrave;ncies o errors, tamb&eacute; es mostren en aquesta finestra.</p>
                <p>Per personalitzar les opcions de formatejament de Javadoc, cliqueu amb el bot&oacute; dret al projecte i obriu el panell de documentaci&oacute; sota la categoria de Construcci&oacute;. Per a m&eacute;s informaci&oacute; quant a les opcions d'aquest panell, cliqueu al bot&oacute; d'Ajuda d'aquesta finestra. </p></td>
              </tr>
            </table>
			<h3><a name="analyze-javadoc" id="analyze-javadoc"></a>Analitzant Javadoc </h3>
			<table width="100%" class="full-width colapse">
              <tr>
                <td width="46%"><img src="../../../images_www/articles/73/java/editor-codereference/analyze-javadoc.png" width="540" height="349"></td>
                <td width="54%" class="valign-top"><p>Per identificar els llocs on el vostre codi necessita comentaris Javadoc, i afegir r&agrave;pidament aquests comentaris, podeu utilitzar l'eina d'analitzador Javadoc disponible en l'editor Java.</p>
                  <p>Per analitzar i corregir comentaris Javadoc:</p>
                  <ol>
                    <li>Seleccioneu un projecte, un paquet, o un fitxer individual i seleccioneu Eines &gt; Analitzar Javadoc, des del men&uacute; principal. <br>
                      La finestra de l'analitzador mostra els suggeriments per afegir o corregir comentaris Javadoc, depenent de l'&agrave;mbit de la vostra selecci&oacute;.  </li>
                    <li>Seleccioneu una o diverses caselles on vulgueu corregir Javadoc i cliqueu al bot&oacute; Corregir seleccionat. <br>
                    </li>
                    <li>Cliqueu Anar a trav&eacute;s dels problemes corregits i utilitzeu les fletxes amunt i abaix a l'actual per afegir els vostres comentaris. Aix&ograve; podria ser &uacute;til si heu seleccionat corregir diversos casos a la vegada i ara voleu tornar a els stubs.  </li>
                  </ol>                </td>
              </tr>
            </table>
			<p class="align-center"><a href="#top">principi</a></p>
			<h2 class="align-center"><a name="hints" id="hints"></a>Utilitzant indicacions</h2>
			<p>Mentre esteu escrivint, L'editor Java comprova el vostre codi i proporciona suggeriments per com corregir els errors i navegar a trav&eacute;s del codi. El seg&uuml;ent exemple mostra els tipus d'indicacions que hi han disponibles a l'editor, i com es poden personalitzar.  </p>
			<h3><a name="hints-tofix" id="hints-tofix"></a>Utilitzant indicacions per corregir codi</h3>
	        <table width="98%" class="full-width colapse">
              <tr>
                <td width="44%"><img src="../../../images_www/articles/73/java/editor-codereference/quickfixes.png" width="486" height="198"></td>
                <td width="56%" class="valign-top"><p>Per als errors de codi m&eacute;s comuns, podeu veure les indicacions al cant&oacute; del marge esquerra de l'editor. Les indicacions es mostren per a diversos tipus d'errors, com la falta de definici&oacute; de camps i variables, problemes amb importacions, claus, i altres. Cliqueu la icona d'indicaci&oacute; i seleccioneu la indicaci&oacute; a afegir. </p>
                  <p>Les indicacions es mostren de forma autom&agrave;tica per defecte. Tanmateix, si voleu veure totes les indicacions, seleccioneu Codi &gt; Corregir codi (o premeu Alt+Retorn)</p>
                  <p>Per exemple, intenteu escrivint &quot;myBoolean=true&quot;. L'editor detecta que la variable no est&agrave; definida. Cliqueu a la icona d'indicaci&oacute; i veieu que l'editor us suggereix crear un camp, in par&agrave;metre de m&egrave;tode, o una variable local. Seleccionar </p>
                </td>
              </tr>
    </table>
			<h3><a name="hints-customize" id="hints-customize"></a>Personalitzant indicacions </h3>
	        <table width="98%" class="full-width colapse">
              <tr>
                <td width="44%"><img src="../../../images_www/articles/73/java/editor-codereference/customizehints.png"></td>
                <td width="56%" class="valign-top"><p>Potser voler limitar el nombre de categories per a les quals es mostren indicacions. Feu aix&ograve;: </p>
                  <ol>
                    <li>Seleccioneu Eines &gt; Opcions &gt; Editor &gt; Indicacions. </li>
                    <li>Des del llistat desplegable de llenguatge, seleccioneu Java i visualitzeu el llistat d'elements pels quals es mostren indicacions (les seves caselles de selecci&oacute; estan marcades) </li>
                    <li>Per deshabilitar indicacions per algunes categories, netegeu les caselles de selecci&oacute; adequades. </li>
                  </ol>
                  <p class="notes">Nota: En la pestanya d'indicacions, podeu deshabilitar o limitar l'&agrave;mbit de depend&egrave;ncia de l'escaneig (opci&oacute; Escaneig de depend&egrave;ncies) Aquests passos poden millorar significativament el rendiment de l'IDE.  </p>
                  <p>El IDE detecta errors de compilaci&oacute; en els vostres fonts Java tot posicionant i re-compilant les classes que depenen el fitxer que esteu modificat (igualment si aquestes depend&egrave;ncies estan en fitxers que no estiguin oberts en l'editor). Quant es troba un error de compilaci&oacute;, s'afegeixen distintius vermells als nodes del fitxer font, paquet o projecte. L'escaneig de depend&egrave;ncies pot ser un consumidor de recursos i empitjorar el rendiment, especialment si treballeu en projectes enormes.  </p>
                  <p>Per millorar el rendiment de l'IDE, podeu fer el seg&uuml;ent:</p>
                  <ul>
                    <li>Limitar l'&agrave;mbit de l'escaneig de depend&egrave;ncies a la font arrel (cercar depend&egrave;ncies &uacute;nicament a l'arrel font on les classes modificades estan situades) o al projecte actual. </li>
                    <li>Deshabilitar l'escaneig de depend&egrave;ncies. En aquest cas, l'IDE no escaneja depend&egrave;ncies o actualitza els distintius d'error quan es modifica un fitxer. </li>
                  </ul>                  
                </td>
              </tr>
    </table>
			<h3><a name="surround" id="surround"></a>Encerclar amb... </h3>
			<table width="98%" class="full-width colapse">
              <tr>
                <td width="44%"><img src="../../../images_www/articles/73/java/editor-codereference/surroundwith.png" width="503" height="321"></td>
                <td width="56%" class="valign-top"><p>Podeu encerclar f&agrave;cilment els trossos del vostre codi amb diverses sent&egrave;ncies, com <tt>for</tt>, <tt>while</tt>, <tt>if</tt>, <tt>try/catch</tt>, i altres.</p>
                    <p>Seleccioneu un bloc del vostre codi que vulgueu encerclar amb una sent&egrave;ncia i cliqueu a la icona bombeta del canto del marge esquerra (o premeu Alt-Retorn). L'editor mostra un llistat de suggeriments des del qual seleccioneu la sent&egrave;ncia que necessiteu.</p></td>
              </tr>
            </table>
			<h2 class="align-center"><a name="editor-features" id="editor-features"></a>Caracter&iacute;stiques generals d'edici&oacute; </h2>
			<h3><a name="formatting" id="formatting"></a>Formataci&oacute; del codi </h3>
			<table width="98%" class="full-width colapse">
              <tr>
                <td width="46%"><p><img src="../../../images_www/articles/73/java/editor-codereference/formatting.png"></p>
                </td>
                <td width="54%" class="valign-top"><p>Seleccioneu Codi &gt; Format, o b&eacute; premeu <tt>Alt-Maj-F</tt> per donar format a tot el fitxer o al codi seleccionat. El IDe dona format al codi en concordan&ccedil;a amb les prefer&egrave;ncies de formataci&oacute; especificades.</p>
                  <p>Per personalitzar les prefer&egrave;ncies de formataci&oacute; pel codi Java:</p>
                  <ol>
                    <li>Seleccioneu Eines &gt; Opcions &gt; Editor &gt; Formataci&oacute;.</li>
                    <li>Des del llistat desplegable de llenguatges, seleccioneu Java. </li>
                    <li>Des del llistat desplegable de categoria, seleccioneu la categoria que vulgueu personalitzar. Per exemple, podeu personalitzar el n&uacute;mero de l&iacute;nies en blanc, la mida de les tabulacions i sagnat, estil embolcallament, etc.</li>
                    <li>Modifiqueu les regles per a la categoria seleccionada i pre-visualitzeu el resultat. </li>
                </ol></td>
              </tr>
            </table>
	        <h3><a name="braces" id="braces"></a>Inserint i ressaltant claus, claud&agrave;tors, i cometes </h3>
            <table width="98%" class="full-width colapse">
              <tr>
                <td width="46%"><p><img src="../../../images_www/articles/73/java/editor-codereference/braces.png" ></p>
                </td>
                <td width="54%" class="valign-top"><p>Per defecte, l'IDE autom&agrave;ticament insereix un nombre coincident de claus, claud&agrave;tors i cometes. Quant obriu un claud&agrave;tor i premeu <tt>Retorn</tt>, s'afegeix autom&agrave;ticament el claud&agrave;tor de tancament. Per <tt>(</tt>, <tt>[</tt>, <tt>&quot;</tt>, i <tt>'</tt>, l'editor insereix el parell de claus pertinents.</p>
                  <p>Si, per alguna ra&oacute;, aquesta caracter&iacute;stica estigu&eacute;s deshabilitada, habiliteu-la; </p>
                  <ol>
                    <li>Seleccioneu Eines &gt; Opcions &gt; Editor &gt; Auto-completat de codi.</li>
                    <li>Seleccioneu la casella Tancar autom&agrave;ticament els claud&agrave;tors. </li>
                  </ol>
                  <p>L'editor tamb&eacute; ressalta la correspond&egrave;ncia de claus, claud&agrave;tors i cometes. Per exemple, situeu el cursor abans de qualsevol clau o claud&agrave;tor, si respectivament han estat aparellats correctament, ambd&oacute;s seran ressaltats en groc. Les claus a&iuml;llades de qualsevol tipus s&oacute;n ressaltades amb vermell, i la marca d'error &eacute;s mostrada al cant&oacute; del marge esquerra. </p>
                  <p>Per personalitzar els colors de ressaltat, seleccioneu Eines &gt; Opcions &gt; Tipus de lletra i colors &gt; Ressaltat. </p></td>
              </tr>
            </table>
	        <h3><a name="codefolding" id="codefolding"></a>Replegament de codi</h3>
	        <table width="98%" class="full-width colapse">
              <tr>
                <td width="46%"><p><img src="../../../images_www/articles/73/java/editor-codereference/code-folded.png" width="362" height="291"></p></td>
                <td width="54%" class="valign-top"><p>En l'editor Java, podeu expandir o contraure blocs de codi de forma r&agrave;pida, com la declaraci&oacute; de m&egrave;todes, comentaris Javadoc, sent&egrave;ncies d'importaci&oacute;, etc. Els blocs que es poden contraure s&oacute;n mostrats amb l&iacute;nies grises amb els signes m&eacute;s/menys pr&ograve;xims al cant&oacute; del marge esquerra de l'editor  </p>
                  <ul>
                    <li>La manera m&eacute;s senzilla de contraure un bloc de codi &eacute;s clicar a les l&iacute;nies grises amb el s&iacute;mbol m&eacute;s del cant&oacute; esquerra del marge. </li>
                    <li>Per contraure tots els blocs de codi en un fitxer, cliqueu amb el bot&oacute; dret en l'editor i seleccioneu Blocs de codi &gt; Contraure tot, des del men&uacute; emergent.</li>
                    <li>Des del men&uacute; emergent Blocs de codi &gt; Contraure tot, al fitxer podeu seleccionar contraure tots els comentaris Javadoc o tot el codi Java.</li>
                    <li>Podeu situar el ratol&iacute; damunt del codi replegat per revisar r&agrave;pidament les parts ocultes. </li>
                  </ul>
                  <p>Per personalitzar les opcions de replegament de codi:</p>
                  <ol>
                    <li>Seleccioneu Eines &gt; Opcions &gt; Editor &gt; General.</li>
                    <li>Per deshabilitar el replegament del codi, netegeu Utilitzar replegament de codi. Denoteu que el replegament del codi per defecte est&agrave; habilitat.</li>
                    <li>Seleccioneu els blocs de codi a contraure per defecte quant obriu un fitxer.</li>
                  </ol></td>
              </tr>
            </table>
	        <h3><a name="customizeshortcuts" id="customizeshortcuts"></a>Personalitzant les dreceres de teclat</h3>
	        <table width="98%" class="full-width colapse">
              <tr>
                <td width="44%"><p><img src="../../../images_www/articles/73/java/editor-codereference/keyboard.png" width="459" height="497"></p></td>
                <td width="56%" class="valign-top"><p>En l'IDE NetBeans, seleccioneu Eines &gt; Opcions &gt; Mapa de car&agrave;cters Podeu fer-ho de diferents formes:</p>
                  <ul>
                    <li>Seleccionar un conjunt preestablert de dreceres de teclat, el qual s'anomena Perfil.</li>
                    <li>Editar determinades dreceres de teclat. </li>
                  </ul>
                  <p>Podeu desar les vostres definicions de les vostres dreceres com a Perfils. Despr&eacute;s, podeu alternar d'un perfil a un altre per canviar r&agrave;pidament diverses prefer&egrave;ncies. Per exemple, per crear un perfil personalitzat de dreceres de teclat: </p>
                  <ol>
                    <li>En la finestra Opcions &gt; Mapa de car&agrave;cters, cliqueu a Gestionar perfils. </li>
                    <li>Seleccioneu el perfil que voleu utilitzar com a base pel vostre nou perfil i cliqueu a Duplicar.  </li>
                    <li>Introduiu el nom del perfil nou i cliqueu a Acceptar. </li>
                    <li>Assegureu-vos que el nou perfil estigui seleccionat i modifiqueu les dreceres que necessiteu.<br>
                    Per editar una drecera, cliqueu dues vegades al camp Dreceres o cliqueu al bot&oacute; de punts suspensius (...). Quant premeu la seq&uuml;&egrave;ncia de tecles, l'hi &eacute;s afegida la combinaci&oacute;. <br>
                    Si voleu afegir car&agrave;cters especials, com <tt>Tabulador</tt>, <tt>Escapament</tt>, o <tt>Retorn</tt>, cliqueu al bot&oacute; de punts suspensius (...) i seleccioneu la tecla des de la finestra emergent.</li>
                    <li>Quant acabeu l'edici&oacute;, cliqueu Acceptar en la finestra Opcions. </li>
                  </ol>
                  <p>Per trobar una drecera per a una comanda espec&iacute;fica, escriviu el nom de la comanda en el camp de Cercar. Per trobar una comanda mitjan&ccedil;ant un combinaci&oacute;, inseriu el cursor en el camp Cercar a Dreceres, i premeu la combinaci&oacute; de tecles de la drecera. </p>                  
                  <p>&nbsp;</p></td>
              </tr>
            </table>
	        <h2><a name="coloring"></a>Acoloriment i ressaltament sem&agrave;ntic </h2>
	        <p>L'Editor Java de l'IDE mostra els elements del codi en diferents colors, basant-se en la sem&agrave;ntica del vostre codi. Amb l'acoloriment de la sem&agrave;ntica, la identificaci&oacute; de diversos elements en el vostre codi es converteix una tasca senzilla. A m&eacute;s del acoloriments, l'editor de Java ressalta elements similars amb un color de fons concret. D'aquesta manera, podeu veure la caracter&iacute;stica de ressaltament com una alternativa a la comanda Cercar, perqu&egrave; en combinaci&oacute; amb el subratllat d'errors, us d&oacute;na una visi&oacute; general d'on les zones ressaltades estan situades dins del fitxer. </p>
	        <h3><a name="customizecolors"></a>Personalitzant colors </h3>
	        <table width="98%" class="full-width colapse">
              <tr>
                <td width="44%"><p><img src="../../../images_www/articles/73/java/editor-codereference/coloringoptions.png" width="445" height="609"></p></td>
                <td width="56%" class="valign-top"><p>Per personalitzar les prefer&egrave;ncies de l'acoloriment de sintaxis per l'editor Java, Seleccioneu Eines &gt; Opcions &gt; Tipus de lletra i colors.</p>
                  <p>El IDe proporciona diferents esquemes d'acoloriment preestablerts, els quals s'anomenen Perfils. Podeu crear perfils nous amb colors personalitzats i alternar r&agrave;pidament entre ells. </p>
                  <p>Es recomana desar els colors personalitzats en perfils nous. Per exemple, feu el seg&uuml;ent: </p>
                  <ol>
                    <li>En la finestra Opcions &gt; Tipus de lletra i colors, cliqueu a Duplicar que est&agrave; situat a la vora del llistat desplegable de Perfils. </li>
                    <li>Introdu&iuml;u el nom del perfil nou i cliqueu a Acceptar. </li>
                    <li>Assegureu-vos que el perfil nou estigui actualment seleccionat, i que heu seleccionat Java des del llistat desplegable de Llenguatges. </li>
                    <li>Seleccioneu una categoria i canvieu per aquesta categoria el tipus de lletra, color de la lletra (color primer pla), fons i efectes, <br>
                    Utilitzeu la finestra de Previsualitzaci&oacute; per veure'n els resultats.</li>
                    <li>Cliqueu a Acceptar.  </li>
                  </ol>
                  <p class="notes">Nota: Totes les prefer&egrave;ncies i perfils de l'IDE NetBeans estan emmagatzemades en <em>userdir de NetBeans</em> (adreceu-vos a les <a href="http://wiki.netbeans.org/FaqWhatIsUserdir" target="_blank">PMF</a> de com localitzar el <em>userdir</em> pel vostre sistema operatiu). Quant actualitzeu a versions m&eacute;s noves de NetBeans, podeu exportar les prefer&egrave;ncies antigues i despr&eacute;s importar-les a la nova versi&oacute;.</p>
                  <p class="notes">Per exportar les prefer&egrave;ncies de l'IDE: </p>
                  <ol>
                    <li>En la finestra Opcions (Eines &gt; Opcions), cliqueu a Exportar.</li>
                    <li>Especifique el nom i localitzaci&oacute; del fitxer ZIP que ser&agrave; creat. </li>
                    <li>Seleccioneu les prefer&egrave;ncies que voleu exportar i cliqueu a Acceptar. </li>
                  </ol>
                  <p class="notes">Per importar les prefer&egrave;ncies al IDE: </p>
                  <ol>
                    <li>En la finestra Opcions (Eines &gt; Opcions), cliqueu a Importar.</li>
                    <li>Especifiqueu el fitxer ZIP amb les prefer&egrave;ncies de l'IDE, o b&eacute; la ruta al <em>userdir</em> d'una versi&oacute; anterior. </li>
                    <li>Seleccioneu les prefer&egrave;ncies que vulgueu importar i cliqueu a Acceptar. </li>
                </ol>                  <p>&nbsp;</p></td>
              </tr>
            </table>
	        <h3><a name="example" id="example"></a>Exemple d'acoloriment</h3>
	        <table width="98%" class="full-width colapse">
              <tr>
                <td width="44%"><p><img src="../../../images_www/articles/73/java/editor-codereference/coloring.png" ></p></td>
                <td width="56%" class="valign-top"><p>A l'esquerra, podeu visualitzar un exemple de l'esquema d'acoloriment. Depenent de les vostres prefer&egrave;ncies, els vostres colors es poden visualitzar de forma diferent a la captura de pantalla. </p>
                  <p>Diversos colors s&oacute;n utilitzats per paraules clau (blau), variables i camps (verd), i par&agrave;metres (taronja). </p>
                  <p>Les refer&egrave;ncies a m&egrave;todes o classes obsolets es mostren com a tatxats. Aix&ograve; us adverteix quant aneu a escriure codi que confia en membres obsolets. </p>
                  <p>Els membres sense utilitzar s&oacute;n subratllats amb una l&iacute;nia ondulada de color blau. Els comentaris es mostren amb gris.</p>
                  <p>&nbsp;</p></td>
              </tr>
            </table>
	        <h3><a name="highlights" id="highlights"></a>Utilitzant ressaltaments</h3>
	        <table width="98%" class="full-width colapse">
              <tr>
                <td width="44%"><p><img src="../../../images_www/articles/73/java/editor-codereference/highlightelement.png" width="481" height="359" ></p></td>
                <td width="56%" class="valign-top"><p>El IDE ressalta els usos del mateix element, correspond&egrave;ncia de claus, punts de sortida de m&egrave;todes, i punts de llan&ccedil;ament d'excepcions. </p>
                  <p>Si situeu el cursor damunt d'un element, com un camp o una variable, tots els usos d'aquests element s&oacute;n ressaltats. Denoteu que la ratlla d'error en el cant&oacute; del marge dret indica els usos d'aquest element en tot el fitxer font (vegeu <a href="#stripes">Ratlles d'error</a>). Cliqueu a la ratlla d'error per navegar r&agrave;pidament a la localitzaci&oacute; desitjada d'&uacute;s.</p>
                  <p>Si decidiu reanomenar totes les inst&agrave;ncies ressaltades, utilitzeu la comanda Reanomenar inst&agrave;ncia (Ctrl-R o seleccioneu Reestructuraci&oacute; &gt; Reanomenar). </p>
                  <p>&nbsp;</p>
                </td>
              </tr>
            </table>
	        <h2><a name="navigation"></a>Navegaci&oacute;</h2>
	        <p>L'editor Java proporciona diferents formes per a poder navegar a trav&eacute;s del codi. Vegeu tot seguit diversos exemples que mostren les caracter&iacute;stiques de navegaci&oacute; de l'editor Java. </p>
	        <h3><a name="stripes"></a>Subratllat d'errors</h3>
	        <p>Les ratlles d'error del cant&oacute; del marge dret de l'editor proporcionen una visi&oacute; general dels llocs marcats en el fitxer actual: errors, indicacions, ocurr&egrave;ncies ressaltades, i anotacions. Denoteu que el marge de senyalitzaci&oacute; d'errors representen un fitxer sencer, no tan sols la part que est&agrave; mostrada en l'editor. Mitjan&ccedil;ant les ratlles d'error, podeu identificar r&agrave;pidament si el fitxer t&eacute; qualsevol error o advert&egrave;ncia, sense despla&ccedil;ar-vos per tor el fitxer.  </p>
	        <p>Cliqueu en una ratlla d'error per saltar a la l&iacute;nia que la marca referencia. </p>
	        <h3><a name="goto"></a>Navegant des de l'editor: Anar a...  </h3>
	        <table width="98%" class="full-width colapse">
              <tr>
                <td width="44%"><p><img src="../../../images_www/articles/73/java/editor-codereference/gotodeclaration.png" width="469" height="125" ></p></td>
                <td width="56%" class="valign-top"><p>Utilitzeu els seg&uuml;ents &quot;anar a..&quot;, comandes localitzades sota l'element del men&uacute; de navegaci&oacute;, per saltar a les localitzacions dest&iacute;:</p>
                  <ul>
                    <li><strong>Anar a la declaraci&oacute; (Ctr-B, per defecte)</strong>. Mantingueu pitjada la tecla Ctrl i cliqueu a l'&uacute;s de la classe, m&egrave;tode o camp per saltar a la seva declaraci&oacute;. Tamb&eacute; podeu situar el cursor damunt del membre (una classe, un m&egrave;tode, o un camp) i seleccionar Navegaci&oacute; &gt; Anar a la declaraci&oacute;, o b&eacute; amb el bot&oacute; dret seleccionar Navegaci&oacute; &gt; Anar a la declaraci&oacute;, des de la finestra emergent. </li>
                    <li><strong>Anar a la font (Ctrl-Maj-B, per defecte)</strong>. Mantingueu pitjada la tecla Ctrl i cliqueu a una classe, un m&egrave;tode, o un camp per saltar al codi font, si la font est&agrave; est&agrave; disponible. Tamb&eacute; podeu situar el cursor damunt del membre (una classe, un m&egrave;tode, o un camp) i podeu tant pr&eacute;mer Ctrl-Maj-B, o b&eacute; seleccionar Navegaci&oacute; &gt; Anar a la font, en el men&uacute; principal.</li>
                </ul></td>
              </tr>
            </table>
	        <table width="98%" class="full-width colapse">
              <tr>
                <td width="44%"><p><img src="../../../images_www/articles/73/java/editor-codereference/gototype.png" width="372" height="362" ></p></td>
                <td width="56%" class="valign-top"><ul>
                    <li><strong>Anar al tipus (Ctrl-O)</strong>, <strong>Anar al fitxer (Alt-Maj-O),</strong> i <strong>Anar al s&iacute;mbol (Ctrl-Alt-Maj-O)</strong>. Si coneixeu el nom del tipus (class, interface, annotation o enum), el nom del fitxer, o el s&iacute;mbol, on voleu saltar, utilitzeu aquestes comandes i escriviu el nom en la finestra nova. Fixeu-vos que podeu utilitzar prefixes, cas camell, i comodins.  </li>
                </ul></td>
              </tr>
            </table>
	        <table width="98%" class="full-width colapse">
              <tr>
                <td width="44%"><p><img src="../../../images_www/articles/73/java/editor-codereference/gotoline.png" width="218" height="115" ></p></td>
                <td width="56%" class="valign-top"><ul>
                    <li><strong>Anar a la l&iacute;nia (Ctrl-G)</strong>. Introdu&iuml;u el n&uacute;mero de l&iacute;nia on voleu saltar. </li>
                </ul></td>
              </tr>
            </table>
	        <h3><a name="lastedit"></a>Saltant a l'&uacute;ltima edici&oacute;</h3>
	        <table width="98%" class="full-width colapse">
              <tr>
                <td width="44%"><p><img src="../../../images_www/articles/73/java/editor-codereference/jumplastedit.png" width="353" height="154" ></p></td>
                <td width="56%" class="valign-top"><p>Per retornar r&agrave;pidament a la vostra &uacute;ltima edici&oacute;, enacara que estigueu en un altre fitxer o projecte. premeu  Ctrl-Q o utilitzeu el bot&oacute; de la barra d'eines l'editor Java situat al corner superior esquerra. L'&uacute;ltim document s'obre, i el cursor es situa en la posici&oacute; de l'&uacute;ltima edici&oacute;.</p></td>
              </tr>
            </table>
	        <h3><a name="switchfiles" id="switchfiles"></a>Alternaci&oacute; entre fitxers </h3>
	        <table width="98%" class="full-width colapse">
              <tr>
                <td><p><img src="../../../images_www/articles/73/java/editor-codereference/jumprecentfile.png" width="359" height="141" ></p>
                <p>&nbsp;</p></td>
                <td class="valign-top"><p>Hi han dos maneres molt c&ograve;modes que us permeten alternar entre documents oberts: </p>
                  <ul>
                    <li><strong>Anar enredera (Alt-Esquerra)</strong> i <strong>Anar endavant (Alt-Dreta).</strong> Per anar a l'anterior fitxer editat o avan&ccedil;ar, seleccioneu Navegaci&oacute; &lt; Retrocedir o Navegaci&oacute; &lt; Avan&ccedil;ar, o b&eacute; premeu els botons corresponents de la barra d'eines de l'editor (mostrats en la figura). El fitxer s'obre, i el cursor es situa en la posici&oacute; de la vostra &uacute;ltima edici&oacute;. Quant cliqueu a un d'aquest botons, podeu expandir el llistat de fitxers recents i clicar a navegar a qualsevol d'ells. </li>
                </ul></td>
              </tr>
              <tr>
                <td width="44%"><p><img src="../../../images_www/articles/73/java/editor-codereference/togglefile.png" width="384" height="157" ></p></td>
                <td width="56%" class="valign-top"><ul>
                  <li><strong>Commutar entre fitxers (Ctrl-Tab)</strong>. Despr&eacute;s que premeu Ctrl-Tabulador, tots els fitxers oberts es mostren a una finestra emergent, Mantingueu pitjada la tecla Ctrl i pitgeu diversos cops la tecla Tabulador per seleccionar el fitxer que voleu obrir:  </li>
                </ul></td>
              </tr>
            </table>
	        <h3><a name="bookmarks"></a>Utilitzant marcadors</h3>
	        <table width="98%" class="full-width colapse">
              <tr>
                <td width="44%"><p><img src="../../../images_www/articles/73/java/editor-codereference/bookmark.png" width="404" height="129" ></p></td>
                <td width="56%" class="valign-top"><p>Podeu utilitzar marcadors per a navegar r&agrave;pidament a trav&eacute;s de llocs concrets del vostre codi. </p>
                  <p>Premeu Ctrl-Maj-M (o amb el bot&oacute; dret cliqueu al marge esquerra i seleccioneu Marcador &gt; Commutar marcador) per emmarcar la l&iacute;nia actual. La l&iacute;nia emmarcada &eacute;s mostrada amb una icona blava petita en el marge esquerra (vegeu la figura).</p>
                  <p>Per a treure el marcador, torneu a pr&eacute;mer Ctrl-Maj-M un altre cop.</p>
                  <p>Per anar al seg&uuml;ent marcador, premeu Ctrl-Maj-Punt, per anar a l'anterior marcador, premeu Ctrl-Maj-Coma. </p>
                </td>
              </tr>
            </table>
	        <h3><a name="navigator"></a>Utilitzant el navegador  </h3>
	        <table width="98%" class="full-width colapse">
              <tr>
                <td width="44%"><p><img src="../../../images_www/articles/73/java/editor-codereference/navigatorwindow.png" width="383" height="403" ></p></td>
                <td width="56%" class="valign-top"><p>La finestra de navegaci&oacute; proporciona visualitzacions estructurades dels fitxers amb els quals esteu treballant, permetent-vos navegar r&agrave;pidament entre diferents parts del fitxer. </p>
                  <p>Per obrir la finestra de Navegaci&oacute;, seleccioneu Finestra &gt; Navegaci&oacute; &gt; Navegador, o b&eacute; premeu Ctrl-7.</p>
                  <p>En la finestra de Navegaci&oacute;, podeu fer el seg&uuml;ent:</p>
                  <ul>
                    <li>Seleccionar entre diferents visualitzacions: Membres, Patrons Beans, Arbres, Elements, etc.</li>
                    <li>Cliqueu dues vegades en un element per a saltar a la l&iacute;nia on est&agrave; definit.</li>
                    <li>Cliqueu amb el bot&oacute; dret i apliqueu comandes, com Anar a la font, Trobar usos, i Reestructurar.</li>
                    <li>Aplicar filtres als elements mostrats en el navegador (utilitzeu els botons de la part inferior)</li>
                    <li>Escriviu el nom de l'element que voleu trobar (la finestra de navegaci&oacute; ha d'estar activa).</li>
                  </ul>
                  <p>&nbsp;</p>
                </td>
              </tr>
            </table>
	      
	        <p><br>
    </p>
			<div class="feedback-box" ><a href="/about/contact_form.html?to=3&subject=Feedback: Code Assistance in the NetBeans IDE 6.8 Java Editor">Envia'ns la vostra opini&oacute;</a><br style="clear:both;" />         
        
    <a name="next_steps"></a></div>
    <h2>Vegeu tamb&eacute;</h2>
    <ul>
      <li><a href="https://usersguide.netbeans.org/shortcuts.pdf" target="_blank">Targeta de dreceres de teclat</a>            
    </ul>

        <p class="align-center"><a href="#top">principi</a></p>
        <h2 class="align-center"><a name="#appendixa" id="#appendixa"></a>Ap&egrave;ndix A: Icones en la finestra d'auto-completat de codi</h2>
        <table>
		<tbody>
          <tr>
            <td class="tblheader">Icona</td>
            <td class="tblheader">Significat</td>
            <td class="tblheader">Variants (si n'hi ha)</td>
            <td class="tblheader"><p>Significat </p>   </td>
          </tr>
          <tr>
            <td class="tbltd0"><img src="../../../images_www/articles/73/java/editor-codereference/annotation_type.png" width="16" height="16"></td>
            <td class="tbltd0">Tipus d'anotaci&oacute;</td>
            <td class="tbltd0">&nbsp;</td>
            <td class="tbltd0">&nbsp;</td>
          </tr>
          <tr>
            <td class="tbltd1"><img src="../../../images_www/articles/73/java/editor-codereference/class_16.png" width="16" height="16"></td>
            <td class="tbltd1">Classe</td>
            <td class="tbltd1">&nbsp;</td>
            <td class="tbltd1">&nbsp;</td>
          </tr>
          <tr>
            <td class="tbltd0"><img src="../../../images_www/articles/73/java/editor-codereference/package.png" width="16" height="16"></td>
            <td class="tbltd0">Paquet</td>
            <td class="tbltd0">&nbsp;</td>
            <td class="tbltd0">&nbsp;</td>
          </tr>
          <tr>
            <td class="tbltd1"><img src="../../../images_www/articles/73/java/editor-codereference/enum.png" width="16" height="16"></td>
            <td class="tbltd1">Tipus d'enumeraci&oacute; </td>
            <td class="tbltd1">&nbsp;</td>
            <td class="tbltd1">&nbsp;</td>
          </tr>
          <tr>
            <td class="tbltd0"><img src="../../../images_www/articles/73/java/editor-codereference/code_template.png" width="16" height="16"></td>
            <td class="tbltd0">Plantilla de codi </td>
            <td class="tbltd0">&nbsp;</td>
            <td class="tbltd0">&nbsp;</td>
          </tr>
          <tr>
            <td class="tbltd1"><img src="../../../images_www/articles/73/java/editor-codereference/constructor_16.png" width="16" height="16"></td>
            <td class="tbltd1">Constructor</td>
            <td class="tbltd1"><img src="../../../images_www/articles/73/java/editor-codereference/new_constructor_16.png" width="16" height="16"></td>
            <td class="tbltd1"> Nou constructor (generar)</td>
          </tr>
          <tr>
            <td class="tbltd1">&nbsp;</td>
            <td class="tbltd1">&nbsp;</td>
            <td class="tbltd1"><img src="../../../images_www/articles/73/java/editor-codereference/constructor_protected_16.png" width="16" height="16"></td>
            <td class="tbltd1">Constructor protegit </td>
          </tr>
          <tr>
            <td class="tbltd1">&nbsp;</td>
            <td class="tbltd1">&nbsp;</td>
            <td class="tbltd1"><img src="../../../images_www/articles/73/java/editor-codereference/constructor_private_16.png" width="16" height="16"></td>
            <td class="tbltd1">Constructor privat </td>
          </tr>
          <tr>
            <td class="tbltd1">&nbsp;</td>
            <td class="tbltd1">&nbsp;</td>
            <td class="tbltd1"><img src="../../../images_www/articles/73/java/editor-codereference/constructor_package_private_16.png" width="16" height="16"></td>
            <td class="tbltd1">Constructor privat de paquet </td>
          </tr>
          <tr>
            <td class="tbltd0"><img src="../../../images_www/articles/73/java/editor-codereference/field_16.png" width="16" height="16"></td>
            <td class="tbltd0">Camp</td>
            <td class="tbltd0"><img src="../../../images_www/articles/73/java/editor-codereference/field_protected_16.png" width="16" height="16"></td>
            <td class="tbltd0">Camp protegit </td>
          </tr>
          <tr>
            <td class="tbltd0">&nbsp;</td>
            <td class="tbltd0">&nbsp;</td>
            <td class="tbltd0"><img src="../../../images_www/articles/73/java/editor-codereference/field_private_16.png" width="16" height="16"></td>
            <td class="tbltd0">Camp privat </td>
          </tr>
          <tr>
            <td class="tbltd0">&nbsp;</td>
            <td class="tbltd0">&nbsp;</td>
            <td class="tbltd0"><img src="../../../images_www/articles/73/java/editor-codereference/field_package_private_16.png" alt="Icona pel camp privat paquet" width="16" height="16"></td>
            <td class="tbltd0">Camp privat paquet </td>
          </tr>
          <tr>
            <td class="tbltd1"><img src="../../../images_www/articles/73/java/editor-codereference/field_static_16.png" width="16" height="16"></td>
            <td class="tbltd1">Camp est&agrave;tic </td>
            <td class="tbltd1"><img src="../../../images_www/articles/73/java/editor-codereference/field_static_protected_16.png" width="16" height="16"></td>
            <td class="tbltd1">Camp est&agrave;tic protegit </td>
          </tr>
          <tr>
            <td class="tbltd1">&nbsp;</td>
            <td class="tbltd1">&nbsp;</td>
            <td class="tbltd1"><img src="../../../images_www/articles/73/java/editor-codereference/field_static_private_16.png" width="16" height="16"></td>
            <td class="tbltd1">Camp est&agrave;tic privat </td>
          </tr>
          <tr>
            <td class="tbltd1">&nbsp;</td>
            <td class="tbltd1">&nbsp;</td>
            <td class="tbltd1"><img src="../../../images_www/articles/73/java/editor-codereference/field_static_package_private_16.png" width="16" height="16"></td>
            <td class="tbltd1">Camp est&agrave;tic privat paquet </td>
          </tr>
          <tr>
            <td class="tbltd0"><img src="../../../images_www/articles/73/java/editor-codereference/interface.png" width="16" height="16"></td>
            <td class="tbltd0">Interf&iacute;cie</td>
            <td class="tbltd0">&nbsp;</td>
            <td class="tbltd0">&nbsp;</td>
          </tr>
          <tr>
            <td class="tbltd1"><img src="../../../images_www/articles/73/java/editor-codereference/javakw_16.png" width="16" height="16"></td>
            <td class="tbltd1">Paraula Java </td>
            <td class="tbltd1">&nbsp;</td>
            <td class="tbltd1">&nbsp;</td>
          </tr>
          <tr>
            <td class="tbltd0"><img src="../../../images_www/articles/73/java/editor-codereference/method_16.png" width="16" height="16"></td>
            <td class="tbltd0">M&egrave;tode</td>
            <td class="tbltd0"><img src="../../../images_www/articles/73/java/editor-codereference/method_protected_16.png" width="16" height="16"></td>
            <td class="tbltd0">M&egrave;tode protegit </td>
          </tr>
          <tr>
            <td class="tbltd0">&nbsp;</td>
            <td class="tbltd0">&nbsp;</td>
            <td class="tbltd0"><img src="../../../images_www/articles/73/java/editor-codereference/method_private_16.png" width="16" height="16"></td>
            <td class="tbltd0">M&egrave;tode privat </td>
          </tr>
          <tr>
            <td class="tbltd0">&nbsp;</td>
            <td class="tbltd0">&nbsp;</td>
            <td class="tbltd0"><img src="../../../images_www/articles/73/java/editor-codereference/method_package_private_16.png" width="16" height="16"></td>
            <td class="tbltd0">M&egrave;tode privat paquet </td>
          </tr>
          <tr>
            <td class="tbltd1"><img src="../../../images_www/articles/73/java/editor-codereference/method_static_16.png" width="16" height="16"></td>
            <td class="tbltd1">M&egrave;tode est&agrave;tic </td>
            <td class="tbltd1"><img src="../../../images_www/articles/73/java/editor-codereference/method_static_protected_16.png" width="16" height="16"></td>
            <td class="tbltd1">M&egrave;tode est&agrave;tic protegit </td>
          </tr>
          <tr>
            <td class="tbltd1">&nbsp;</td>
            <td class="tbltd1">&nbsp;</td>
            <td class="tbltd1"><img src="../../../images_www/articles/73/java/editor-codereference/method_static_private_16.png" width="16" height="16"></td>
            <td class="tbltd1">M&egrave;tode est&agrave;tic privat </td>
          </tr>
          <tr>
            <td class="tbltd1">&nbsp;</td>
            <td class="tbltd1">&nbsp;</td>
            <td class="tbltd1"><img src="../../../images_www/articles/73/java/editor-codereference/method_static_package_private_16.png" width="16" height="16"></td>
            <td class="tbltd1">M&egrave;tode est&agrave;tic privat paquet </td>
          </tr>
          <tr>
            <td class="tbltd0"><img src="../../../images_www/articles/73/java/editor-codereference/localVariable.png" width="16" height="16"></td>
            <td class="tbltd0">Variable local </td>
            <td class="tbltd0">&nbsp;</td>
            <td class="tbltd0">&nbsp;</td>
          </tr>
          <tr>
            <td class="tbltd1"><img src="../../../images_www/articles/73/java/editor-codereference/attribute_16.png" width="16" height="16"></td>
            <td class="tbltd1">Atribut</td>
            <td class="tbltd1">&nbsp;</td>
            <td class="tbltd1">&nbsp;</td>
          </tr>
    </table>
	<script type="text/javascript">
           <!--
          compactMenu('collapsableList', true, '&plusmn; ');
        -->
      </script>
</body>
</html>