<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<!--
  Copyright 2010, Oracle Inc. 
  All Rights Reserved.
-->

<html>
<head>
<link rel="stylesheet" type="text/css" href="../../../netbeans.css">
<link rel="stylesheet" type="text/css" media="print" href="../../../print.css">
<link rel="shortcut icon" href="https://netbeans.org/favicon.ico" type="image/x-icon" >
<title>Instru&ccedil;&otilde;es de instala&ccedil;&atilde;o do NetBeans IDE 7.0</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" >
<meta name="description" content="Installation Instructions for NetBeans IDE 7.0 Beta">
<meta name="keywords" content="NetBeans, IDE, free, open source, install notes, developer, installer, NetBeans, NetBeans IDE, NetBeans installer, NetBeans development environment" >
<style type="text/css">
<!--
.style2 {color: #000000}
-->
</style>
</head>
<body>
<a name="top"></a>
<h1>Instru&ccedil;&otilde;es de instala&ccedil;&atilde;o do NetBeans IDE 7.0</h1>
<div class="articledate" style="margin-left: 0px;">&Uacute;ltima atualiza&ccedil;&atilde;o: <!-- #BeginDate format:Am1 -->15 de abril de 2011<!-- #EndDate --> </div>
<p>Este documento descreve como instalar o IDE NetBeans 7.0 em seu sistema. Consulte as Notas de Vers&atilde;o do NetBeans IDE 7.0 para obter informa&ccedil;&otilde;es sobre <a href="relnotes.html#system_requirements">os sistemas operacionais suportados e sobre as configura&ccedil;&otilde;es de hardware</a> para o IDE. Para saber mais sobre os novos recursos inclu&iacute;dos nessa vers&atilde;o do IDE, consulte a p&aacute;gina <a href="index.html">Informa&ccedil;&otilde;es da vers&atilde;o 7.0 do NetBeans IDE</a>.</p>

<h2>Conte&uacute;do</h2>
<ul>
<li><a href="#requiredsoftware" title="Software necess&aacute;rio">Software necess&aacute;rio</a></li>
<li><a href="#downloadoptions" title="Op&ccedil;&otilde;es de download do instalador">Op&ccedil;&otilde;es de download do instalador</a></li>
<li><a href="#customizeinstall" title="Personalizando sua instala&ccedil;&atilde;o">Personalizando sua instala&ccedil;&atilde;o</a></li>
<li><a href="#startdownload" title="Iniciando o download">Iniciando o download</a></li>
<li><a href="#installation" title="Instalando o software">Instalando o software</a><div>
<ul>
<li><a href="#install_windows">Microsoft Windows, Solaris OS e Linux </a></li>
<li><a href="#install_mac">Mac OS X</a> </li>
<li><a href="#install_zip">Pacote independente de plataforma</a> </li>
</ul>
</div></li>
<li><a href="#uninstallation" title="Desinstalando o software">Desinstalando o software</a><div>
<ul>
<li><a href="#uninstall_windows">Microsoft Windows</a></li>
<li><a href="#uninstall_sollinux">Solaris OS, Linux</a></li>
<li><a href="#uninstall_mac">Mac OS X</a></li>
</ul>
</div></li>
<li><a href="#upgrading">Atualiza&ccedil;&atilde;o e suporte a v&aacute;rias instala&ccedil;&otilde;es</a></li>
<li><a href="#troubleshooting" title="Solu&ccedil;&atilde;o de problemas">Solu&ccedil;&atilde;o de problemas</a><a href="#troubleshooting" title=""></a></li>
<li><a href="#moreinformation" title="Mais informa&ccedil;&otilde;es">Mais informa&ccedil;&otilde;es</a><a href="#moreinformation" title=""></a></li>
</ul>
<h2><a name="requiredsoftware" id="requiredsoftware"></a>Software necess&aacute;rio</h2>
<p>&Eacute; necess&aacute;rio ter o Java SE Development Kit (JDK) 6, atualiza&ccedil;&atilde;o 24, ou posterior para instalar o NetBeans IDE. A vers&atilde;o 7.0 do IDE n&atilde;o pode ser instalada utilizando o JDK 5.0. &Eacute; poss&iacute;vel efetuar o download da atualiza&ccedil;&atilde;o mais recente do JDK 6 em <a href="http://www.oracle.com/technetwork/java/javase/downloads/index.html" target="_blank">http://www.oracle.com/technetwork/java/javase/downloads</a>.</p>
<p> Os conjuntos PHP<!--, Ruby--> e C/C++ NetBeans somente requerem que o Java Runtime Environment (JRE) 6 seja instalado e executado. No entanto, se tiver a inten&ccedil;&atilde;o de utilizar qualquer recurso Java, o JDK 6 ser&aacute; necess&aacute;rio. </p>
<p align="center"><a href="#top">in&iacute;cio</a></p>
<h2><a name="downloadoptions" id="downloadoptions"></a>Op&ccedil;&otilde;es de download do Instalador</h2>
<p>Na <a href="https://netbeans.org/downloads/" target="_blank">p&aacute;gina de download</a> do NetBeans IDE, voc&ecirc; pode adquirir um dos diversos instaladores, cada um contendo o IDE b&aacute;sico e as ferramentas adicionais.  </p>
<p>Os seguintes instaladores est&atilde;o dispon&iacute;veis: </p>
<ul>
   <li><b>Java SE</b>. Oferece suporte a todos os recursos de desenvolvimento padr&atilde;o Java SE, bem como &agrave; plataforma de desenvolvimento NetBeans RCP.</li>
   
   <li><b>Java EE</b>. Fornece ferramentas para o desenvolvimento de aplicativos Java SE e Java EE, assim como o suporte para a plataforma de desenvolvimento NetBeans RCP. Esta op&ccedil;&atilde;o de download inclui tamb&eacute;m o GlassFish Server Open Source Edition 3.1 e o software Apache Tomcat 7.0.11. </li>
   <!--<li><b>Ruby</b>. Provides tools for Ruby development and supports Rails and JRuby. Also contains GlassFish Server Open Source Edition 3.1b36.</li>-->
   <li><b>C/C++</b>. Oferece suporte para o desenvolvimento nas linguagens C, C++, Fortran e Assembly. </li>
   <li><b>PHP</b>. Fornece ferramentas para o desenvolvimento PHP 5.x e o suporte para o Zend e Symfony Framework.</li>
   <li><b>Tudo. </b> Trata-se de uma op&ccedil;&atilde;o de download completo que cont&eacute;m todos os execut&aacute;veis e tecnologias dispon&iacute;veis para o NetBeans IDE.  </li>
</ul>
<p align="center"><a href="#top">in&iacute;cio</a></p>
<h2><a name="customizeinstall"></a>Personalizando sua instala&ccedil;&atilde;o</h2>
<p>Se voc&ecirc; fez o download da op&ccedil;&atilde;o &quot;Tudo&quot;, pode escolher exatamente as ferramentas e os tempos de execu&ccedil;&atilde;o para a instala&ccedil;&atilde;o. Clique em Personalizar na p&aacute;gina de boas-vindas do instalador e selecione os recursos que deseja utilizar. Para obter mais informa&ccedil;&otilde;es, consulte <a href="#installation" title="Instalando o software">Instalando o software</a>.</p>
<p>Se voc&ecirc; deseja adicionar funcionalidade a sua configura&ccedil;&atilde;o do NetBeans IDE, utilize o NetBeans Plugin Manager. Por exemplo, suponhamos que voc&ecirc; come&ccedil;ou baixando e instalando o pacote PHP. Em seguida, voc&ecirc; decidiu que deseja experimentar a funcionalidade C/C++. Para fazer isso, acesse o NetBeans Plugin Manager no IDE (selecione Ferramentas &gt; Plug-ins) e adicione o pacote C/C++ &agrave; instala&ccedil;&atilde;o existente.</p>
<p>H&aacute; diversas notas importantes sobre a instala&ccedil;&atilde;o e a configura&ccedil;&atilde;o de alguns recursos do NetBeans IDE: </p>
<ol>
  <li>O Apache Tomcat 7.0.11 est&aacute; inclu&iacute;do nas op&ccedil;&otilde;es de download &quot;Java EE&quot; e &quot;Tudo&quot;, mas n&atilde;o est&aacute; instalado por padr&atilde;o nessas op&ccedil;&otilde;es.  Para instalar o Apache Tomcat, selecione abaixo a op&ccedil;&atilde;o apropriada:
  <ul> 
  <li>no download do &quot;Java EE&quot;, inicie o instalador e selecione a caixa de verifica&ccedil;&atilde;o Apache Tomcat 7.0.11 na p&aacute;gina de boas-vindas;</li>
  <li>na op&ccedil;&atilde;o de download &quot;Tudo&quot;, inicie o instalador e selecione Apache Tomcat 7.0.11 na caixa de di&aacute;logo Instala&ccedil;&atilde;o personalizada.</li>
  </ul></li>

  <li>Para o desenvolvimento de C/C++ (aplic&aacute;vel aos downloads &quot;C/C++&quot; e &quot;Tudo&quot;), &eacute; necess&aacute;rio, al&eacute;m do mais, instalar os compiladores e as ferramentas. Para obter mais informa&ccedil;&otilde;es, consulte <a href="cpp-setup-instructions.html">Configurando o NetBeans IDE para C/C++/Fortran</a>. </li>
  <li>Para Mac OS X, &eacute; poss&iacute;vel personalizar a instala&ccedil;&atilde;o do NetBeans IDE na op&ccedil;&atilde;o download &quot;Tudo&quot;. A instala&ccedil;&atilde;o do IDE nas op&ccedil;&otilde;es de download &quot;Java SE&quot;, &quot;Java EE&quot;, &quot;C/C++&quot; e &quot;PHP&quot; n&atilde;o pode ser personalizada. </li>
  <li>Tamb&eacute;m &eacute; poss&iacute;vel fazer o download <a href="#install_zip">de um arquivo zip independente da plataforma</a> e executar o arquivo execut&aacute;vel do NetBeans IDE. Observe que o GlassFish Server Open Source e o Apache Tomcat est&atilde;o dispon&iacute;veis somente com instaladores espec&iacute;ficos da plataforma. </li>
</ol>
<p align="center"><a href="#top">in&iacute;cio</a></p>
<h2><a name="startdownload" id="startdownload"></a>Iniciando o download</h2>

<ol>
<li>V&aacute; para <a href="https://netbeans.org/downloads/" target="_blank"> <strong>https://netbeans.org/downloads/</strong></a></li>
<li>Na parte superior direita da p&aacute;gina, selecione a linguagem e a plataforma na lista suspensa. Tamb&eacute;m &eacute; poss&iacute;vel optar por fazer o download e utilizar somente o arquivo zip independente da plataforma. </li>
<li>Clique no bot&atilde;o Download para selecionar a op&ccedil;&atilde;o de download que deseja instalar.</li>
<li>Salve o arquivo do instalador no sistema.</li>
</ol>
<p align="center"><a href="#top">superior</a></p>
<h2><a name="installation"></a>Instalando o software</h2>

<p>Siga as instru&ccedil;&otilde;es nesta se&ccedil;&atilde;o para instalar o IDE no sistema. Estas instru&ccedil;&otilde;es de instala&ccedil;&atilde;o aplicam-se a todas as plataformas compat&iacute;veis. Para obter uma lista das plataformas compat&iacute;veis e dos requisitos do sistema, consulte as <a href="relnotes.html#system_requirements">notas de vers&atilde;o</a>. </p>
<h3><a name="install_windows" id="install_windows">Microsoft Windows, Solaris OS e Linux </a></h3>
<p><b>Para instalar o software:</b></p>
  <ol>
    <li>ap&oacute;s concluir o download, execute o instalador. 
   <ul>
    <li>Para Windows, o arquivo execut&aacute;vel do instalador tem a extens&atilde;o <tt>.exe</tt>. Clique duas vezes no arquivo do instalador para execut&aacute;-lo. </li>
    <li>Nas plataformas Solaris e Linux, o arquivo do instalador tem a extens&atilde;o <tt>.sh</tt>. Para essas plataformas, &eacute; preciso executar os arquivos do instalador com o seguinte comando: <tt> chmod +x &lt;<i>installer-file-name</i>&gt;</tt></li>
   </ul>
  </li>
    <li>Se tiver optado pela op&ccedil;&atilde;o de download &quot;Tudo&quot;, voc&ecirc; pode personalizar a sua instala&ccedil;&atilde;o. Execute as seguintes etapas na p&aacute;gina de boas-vindas do assistente de instala&ccedil;&atilde;o:
      <ol type="a">
         <li>clique em Personalizar.</li>
         <li>Na caixa de di&aacute;logo Personalizar a instala&ccedil;&atilde;o, fa&ccedil;a suas sele&ccedil;&otilde;es.</li>
         <li>Clique em OK.</li>
      </ol>
    </li>
     <li>Clique em Avan&ccedil;ar na p&aacute;gina de boas-vindas do assistente de instala&ccedil;&atilde;o.</li>
     <li>Na p&aacute;gina Contrato de Licen&ccedil;a, leia o contrato de licen&ccedil;a, clique na caixa de sele&ccedil;&atilde;o para aceitar e clique em Avan&ccedil;ar.</li>
	 <li>Na p&aacute;gina Contrato de licen&ccedil;a do JUnit, decida se deseja instalar o JUnit, clique na op&ccedil;&atilde;o apropriada e clique em Avan&ccedil;ar.</li>
     <li>Na p&aacute;gina de instala&ccedil;&atilde;o do IDE NetBeans, proceda da seguinte maneira:
       <ol type="a">
      <li>aceite o diret&oacute;rio padr&atilde;o de instala&ccedil;&atilde;o do IDE NetBeans ou especifique outro diret&oacute;rio.
         <p><b>Nota:</b> o diret&oacute;rio de instala&ccedil;&atilde;o dever&aacute; estar vazio e o perfil de usu&aacute;rio que estiver sendo utilizado para executar o instalador dever&aacute; ter permiss&otilde;es de leitura/grava&ccedil;&atilde;o para esse diret&oacute;rio.</p></li>
      <li>Aceite a instala&ccedil;&atilde;o padr&atilde;o do JDK para utilizar com o NetBeans IDE ou selecione uma instala&ccedil;&atilde;o diferente na lista suspensa. Se o assistente de instala&ccedil;&atilde;o n&atilde;o encontrou uma instala&ccedil;&atilde;o JDK compat&iacute;vel para ser utilizada com o NetBeans IDE, o JDK n&atilde;o est&aacute; instalado no local padr&atilde;o. Nesse caso, especifique o caminho do JDK instalado e clique em Avan&ccedil;ar ou cancele a instala&ccedil;&atilde;o atual. Ap&oacute;s a instala&ccedil;&atilde;o da vers&atilde;o necess&aacute;ria do JDK, voc&ecirc; pode reiniciar a instala&ccedil;&atilde;o.</li>
       </ol></li>
   <li>Se a p&aacute;gina de instala&ccedil;&atilde;o do GlassFish Server Open Source Edition 3.1 for aberta, aceite o diret&oacute;rio padr&atilde;o de instala&ccedil;&atilde;o ou especifique outro local de instala&ccedil;&atilde;o. </li>
   <li>Se estiver instalando o Apache Tomcat, em sua p&aacute;gina de instala&ccedil;&atilde;o, aceite o diret&oacute;rio padr&atilde;o de instala&ccedil;&atilde;o ou especifique outro local de instala&ccedil;&atilde;o. Clique em Pr&oacute;ximo. </li>
   <li>Na p&aacute;gina Resumo, verifique se a lista de componentes a serem instalados est&aacute; correta e se voc&ecirc; tem espa&ccedil;o suficiente no sistema para a instala&ccedil;&atilde;o.</li>
   <li>Clique em Instalar para iniciar a instala&ccedil;&atilde;o.</li>
   <li>Na p&aacute;gina Configura&ccedil;&atilde;o conclu&iacute;da, forne&ccedil;a os dados de utiliza&ccedil;&atilde;o an&ocirc;nimos, se desejado, e clique em Finalizar.</li>
  </ol>
<p class="notes"><b>Nota:</b> se voc&ecirc; encontrar problemas ap&oacute;s concluir instala&ccedil;&atilde;o do software com &ecirc;xito, consulte <a href="#troubleshooting">Solu&ccedil;&atilde;o de problemas</a> para obter descri&ccedil;&otilde;es e solu&ccedil;&otilde;es para as quest&otilde;es n&atilde;o-resolvidas que poder&atilde;o afetar o processo de instala&ccedil;&atilde;o. </p>
<h3><a name="install_mac" id="install_mac">Mac OS X</a></h3>
<p><b>Para instalar o software:</b></p>
<ol>
  <li>Ap&oacute;s concluir o download, execute o instalador. O arquivo do instalador tem a extens&atilde;o <tt>.dmg</tt>. </li>
  <li>Clique no &iacute;cone de pacote no painel exibido. A extens&atilde;o do pacote &eacute; <tt> .mpkg </tt>. O assistente de instala&ccedil;&atilde;o &eacute; iniciado.</li>
  <li>Na p&aacute;gina de boas-vindas do assistente de instala&ccedil;&atilde;o, clique em Continuar.</li>
  <li>Leia o contrato de licen&ccedil;a e clique em Continuar. Clique em Aceitar na janela suspensa para aceitar a licen&ccedil;a.</li>
  
  <li>Na p&aacute;gina Selecionar um destino, selecione o drive e clique em Continuar. </li>
  <li>Se tiver optado pela op&ccedil;&atilde;o de download &quot;Tudo&quot;, voc&ecirc; pode personalizar a sua instala&ccedil;&atilde;o. Pressione o bot&atilde;o Personalizar no lado esquerdo inferior da janela do assistente de instala&ccedil;&atilde;o, na &uacute;ltima janela do assistente de instala&ccedil;&atilde;o. A &aacute;rvore de produtos &eacute; exibida.  </li>
  <li>Selecione os produtos que voc&ecirc; deseja instalar.</li>
  <li>Para iniciar a instala&ccedil;&atilde;o, digite o nome do administrador e a senha no sistema e clique em OK.</li>
</ol>

<h3><a name="install_zip" id="install_zip">Pacote independente de plataforma</a></h3>
<p><b>Para executar o software:</b></p>
<ol>
  <li>ap&oacute;s o download do arquivo ZIP independente da plataforma, extraia-o em qualquer pasta do sistema. </li>
  <li>Execute o arquivo execut&aacute;vel localizado no diret&oacute;rio <tt>netbeans/bin</tt>. </li>
  <li>Aceite o Contrato de Licen&ccedil;a.  </li>
  <li>Na p&aacute;gina Contrato de licen&ccedil;a do JUnit, decida se deseja instalar o JUnit, clique na op&ccedil;&atilde;o apropriada e clique em Avan&ccedil;ar. A instala&ccedil;&atilde;o do NetBeans IDE se inicia. </li>
</ol>
<p><span class="notes"><b>Nota:</b> se n&atilde;o for poss&iacute;vel encontrar a instala&ccedil;&atilde;o do JDK compat&iacute;vel, talvez seja necess&aacute;rio adicionar manualmente o caminho ao diret&oacute;rio de instala&ccedil;&atilde;o do JDK, adotando o seguinte procedimento:</span></p>
<ol type="a">
  <li>abra o arquivo <tt>netbeans.conf</tt> localizado no diret&oacute;rio <tt>netbeans/etc</tt> em um editor de texto.</li>
  <li>Insira a localiza&ccedil;&atilde;o da instala&ccedil;&atilde;o do JDK compat&iacute;vel para a op&ccedil;&atilde;o <tt>netbeans_jdkhome</tt>. A localiza&ccedil;&atilde;o padr&atilde;o no Windows &eacute; <tt>C:\Program Files\Java\jdk1.6.0_24</tt>.</li>
  <li>Salve o arquivo <tt>netbeans.conf</tt> e execute o arquivo execut&aacute;vel no diret&oacute;rio <tt>netbeans/bin</tt>.</li>
</ol>

<p><span class="notes"><b>Nota</b>: o GlassFish Server Open Source Edition e o Apache Tomcat somente est&atilde;o dispon&iacute;veis com instaladores espec&iacute;ficos da plataforma.</span></p> 
<p><span class="notes"><b>Nota</b>: para utilizar o GlassFish Server Open Source Edition e/ou Apache Tomcat que j&aacute; est&atilde;o instalados na m&aacute;quina, no NetBeans IDE, clique em <tt>Servidores</tt> no menu <tt>Ferramentas</tt>. Isso exibe o Assistente para adicionar inst&acirc;ncia de servidor que ajuda a registrar uma inst&acirc;ncia do servidor Web necess&aacute;rio no NetBeans IDE. </span></p>

<p align="center"><a href="#top">in&iacute;cio</a></p>
<h2><a name="uninstallation">Desinstalando o software</a></h2>
<p>Siga as instru&ccedil;&otilde;es nesta se&ccedil;&atilde;o para desinstalar o IDE de seu sistema. Estas instru&ccedil;&otilde;es de desinstala&ccedil;&atilde;o aplicam-se a todas as plataformas compat&iacute;veis. Para obter uma lista das plataformas compat&iacute;veis, consulte as <a href="relnotes.html">notas de vers&atilde;o</a>.</p>
<div>
<h3><a name="uninstall_windows">Microsoft Windows</a></h3>
<p>Se necess&aacute;rio, voc&ecirc; pode desinstalar o NetBeans IDE, o GlassFish Server Open Source 3.1 e o Apache Tomcat utilizando os seguintes procedimentos.</p>
<p><b>Para desinstalar o IDE</b>:</p>
<ol>
  <li>Feche o IDE.  </li>
  <li>No Painel de controle, selecione Adicionar ou remover programas e ent&atilde;o selecione IDE NetBeans 7.0 e clique em Remover.</li>
  <li>Para desinstalar o GlassFish, o Tomcat e o IDE ao mesmo tempo, na p&aacute;gina Resumo assegure-se de que as vers&otilde;es listadas s&atilde;o as corretas e as caixas apropriadas est&atilde;o marcadas.</li>
  <li>Marque a caixa de verifica&ccedil;&atilde;o no diret&oacute;rio do usu&aacute;rio do NetBeans se desejar remov&ecirc;-lo junto com o IDE e clique em Desinstalar. </li>
  <li>Na p&aacute;gina Resumo, clique em Desinstalar.  </li>
  <li>Quando a desinstala&ccedil;&atilde;o for conclu&iacute;da, clique em Concluir.</li>
</ol>
<p><b>Para desinstalar o GlassFish Server Open Source Edition 3.1: </b></p>
<ol>
  <li>Feche o IDE.</li>
  <li>No Painel de controle, selecione Adicionar ou remover programas e, em seguida, selecione GlassFish Server Open Source Edition 3.1 e clique em Remover.</li>
</ol>
<p><b>Para desinstalar o Apache Tomcat: </b></p>

<ol>
  <li>Feche o IDE.</li>
  <li>No Painel de controle, selecione Adicionar ou remover programas e, em seguida, selecione Apache Tomcat 7.0.11 e clique em Remover.</li>
</ol>
</div>
<div>
<h3><a name="uninstall_sollinux">Solaris OS, Linux</a></h3>
<p>Se necess&aacute;rio, voc&ecirc; pode desinstalar o NetBeans IDE, o GlassFish Server Open Source 3.1 e o Apache Tomcat utilizando os seguintes procedimentos.</p>
<p><b>Para desinstalar o IDE</b>:</p>

<ol>
  <li>feche o IDE.</li>
  <li>No diret&oacute;rio de instala&ccedil;&atilde;o do IDE, execute o arquivo <tt>uninstall.sh.</tt> </li>
  <li>Para desinstalar o GlassFish, o Tomcat e o IDE ao mesmo tempo, na p&aacute;gina Resumo assegure-se de que as vers&otilde;es listadas s&atilde;o as corretas e as caixas apropriadas est&atilde;o marcadas. </li>
  <li>Na p&aacute;gina Resumo, clique em Desinstalar. 
  </li>
  <li>Quando a desinstala&ccedil;&atilde;o for conclu&iacute;da, clique em Concluir.</li>
</ol>
<p><b>Para desinstalar o GlassFish Server Open Source Edition 3.1 </b>:</p>
<ol>
  <li>Feche o IDE.</li>
  <li>Localize o diret&oacute;rio de instala&ccedil;&atilde;o do servidor de aplica&ccedil;&otilde;es.
  <p class="notes"><b>Nota:</b> o local padr&atilde;o de instala&ccedil;&atilde;o ser&aacute; diferente, dependendo do tipo de instala&ccedil;&atilde;o e da plataforma. A tabela a seguir exibe o diret&oacute;rio padr&atilde;o de instala&ccedil;&atilde;o do servidor de aplicativos para v&aacute;rias plataformas.</p>

  <table>
    <tbody>
        <tr class="tblheader">
            <th width="107">Plataforma</th>
            <th width="130">Instalando como...</th>
			<th width="264">Instala&ccedil;&atilde;o do GlassFish 3.1</th>
        </tr>
        <tr class="tbltd0">
          <td>Windows</td>
          <td>usu&aacute;rio com direitos de administrador</td>
          <td><tt>%ProgramFiles%\glassfish-3.1</tt></td>
        </tr>
        <tr class="tbltd1">
          <td>Windows</td>
          <td>usu&aacute;rio</td>
          <td><tt>%USERPROFILE%\glassfish-3.1</tt></td>
        </tr>
        <tr class="tbltd0">
            <td>Solaris&nbsp;OS&nbsp;</td>
            <td>raiz</td>
			 <td><tt>/opt/glassfish-3.1</tt></td>
        </tr>
        <tr class="tbltd1">

            <td>Solaris OS, Linux</td>
            <td valign="top">usu&aacute;rio</td>
			<td valign="top"><tt>~/glassfish-3.1</tt></td>
        </tr>
        <tr class="tbltd0">
            <td>Linux</td>
            <td>raiz</td>
			<td><tt>/usr/local/glassfish-3.1</tt></td>
        </tr>
    </tbody>
</table>
  </li>
  <li>No diret&oacute;rio de instala&ccedil;&atilde;o do servidor de aplica&ccedil;&otilde;es, execute o arquivo <tt>uninstall.sh</tt>.</li>

  <li>Na p&aacute;gina Resumo, clique em Desinstalar.
  </li>
  <li>Quando a desinstala&ccedil;&atilde;o for conclu&iacute;da, clique em Concluir.</li>
</ol>
<p><b>Para desinstalar o Apache Tomcat: </b></p>
<ol>
  <li>Feche o IDE.</li>

  <li>Localize o diret&oacute;rio de instala&ccedil;&atilde;o do Apache Tomcat.  
    <p class="notes"><b>Nota:</b> o local padr&atilde;o de instala&ccedil;&atilde;o varia dependendo do tipo de instala&ccedil;&atilde;o e da plataforma. A tabela a seguir exibe o diret&oacute;rio padr&atilde;o de instala&ccedil;&atilde;o do servidor de aplicativos em diferentes plataformas.</p>

  <table>
    <tbody>
        <tr class="tblheader">
            <th width="107">Plataforma</th>
            <th width="130">Instalando como...</th>
			<th width="496">Instala&ccedil;&atilde;o do Apache Tomcat 7.0.11</th>
        </tr>
        <tr class="tbltd0">
          <td>Windows</td>
          <td>usu&aacute;rio com direitos de administrador</td>
          <td><tt>%ProgramFiles%\Apache Software Foundation\Apache Tomcat 7.0.11</tt></td>
        </tr>
        <tr class="tbltd1">
          <td>Windows</td>
          <td>usu&aacute;rio</td>
          <td><tt>%USERPROFILE%\Apache Software Foundation\Apache Tomcat 7.0.11</tt></td>
        </tr>
        <tr class="tbltd0">
            <td>Solaris&nbsp;OS&nbsp;</td>
            <td>raiz</td>
			 <td><tt>/opt/apache-tomcat-7.0.11</tt></td>
        </tr>
        <tr class="tbltd1">

            <td>Solaris OS, Linux</td>
            <td valign="top">usu&aacute;rio</td>
			<td valign="top"><tt>~/apache-tomcat-7.0.11</tt></td>
        </tr>
        <tr class="tbltd0">
            <td>Linux</td>
            <td>raiz</td>
			<td><tt>/usr/local/apache-tomcat-7.0.11</tt></td>
        </tr>
    </tbody>
</table>
  </li>
  
  <li>No diret&oacute;rio de instala&ccedil;&atilde;o do servidor de aplica&ccedil;&otilde;es, execute o arquivo <tt>uninstall.sh</tt>.  </li>
  <li>Na p&aacute;gina Resumo, clique em Desinstalar. </li>
  <li>Quando a desinstala&ccedil;&atilde;o for conclu&iacute;da, clique em Concluir</li>
</ol>
</div>

<div>
<h3><a name="uninstall_mac" id="uninstall_mac">Mac OS X</a></h3>
<p><b>Para desinstalar o IDE e o servidor de aplicativos</b>:</p>
<ol>
  <li>feche o software.</li>
  <li>Arraste as pastas ou arquivos de programas para a Lixeira. Observe que o local padr&atilde;o do IDE e do servidor de aplica&ccedil;&otilde;es &eacute; <tt>/Applications/NetBeans/</tt>.  </li>
</ol>
</div>

<div>
<h3><a name="uninstall_zip" id="uninstall_zip">Pacote independente de plataforma</a></h3>
<p>Para desinstalar os arquivos do IDE, siga as etapas descritas na se&ccedil;&atilde;o <a href="#clean">Limpeza ap&oacute;s instala&ccedil;&otilde;es incompletas</a> deste documento. </p>
</div>

<p align="center"><a href="#top">in&iacute;cio</a></p>

<h2><a name="upgrading"></a>Atualiza&ccedil;&atilde;o e suporte a v&aacute;rias instala&ccedil;&otilde;es</h2>
<p>V&aacute;rias instala&ccedil;&otilde;es do NetBeans IDE 5.x e 6.x podem coexistir com o NetBeans IDE 7.0 no mesmo sistema. Voc&ecirc; n&atilde;o precisa desinstalar as vers&otilde;es anteriores para instalar ou executar o NetBeans IDE 7.0. </p>
<p>Se j&aacute; tiver um NetBeans IDE instalado, ter&aacute; a op&ccedil;&atilde;o de importar ou n&atilde;o as configura&ccedil;&otilde;es de usu&aacute;rio do diret&oacute;rio existente ao executar o NetBeans 7.0 pela primeira vez.</p>
<p><span class="notes"><b>Nota</b>: atualiza&ccedil;&otilde;es de vers&atilde;o incremental do IDE n&atilde;o podem ser executadas neste momento. Para atualizar para a vers&atilde;o mais recente, &eacute; preciso efetuar o download do instalador mais recente.</span></p>
<p align="center"><a href="#top">in&iacute;cio</a></p>
<h2><a name="troubleshooting" id="troubleshooting"></a>Solu&ccedil;&atilde;o de problemas</h2>
<div>
<h3>Sobre o diret&oacute;rio de trabalho do instalador</h3>
<p>O instalador armazena dados sobre as sess&otilde;es de instala&ccedil;&atilde;o no diret&oacute;rio de trabalho do instalador. Exemplos desses dados s&atilde;o a lista de componentes instalados no sistema, as mensagens do registro de instala&ccedil;&atilde;o e os dados de registro. </p>

<p>O local padr&atilde;o do diret&oacute;rio de trabalho do instalador &eacute; <tt>%USERPROFILE%\.nbi</tt> no Windows e <tt>~/.nbi</tt> em outras plataformas. O subdiret&oacute;rio do registro cont&eacute;m os arquivos de registro de instala&ccedil;&atilde;o. </p>
</div>
<div>
<h3><a name="clean"></a>Limpeza ap&oacute;s instala&ccedil;&otilde;es incompletas</h3>
<p>Ap&oacute;s instala&ccedil;&otilde;es incompletas ou malsucedidas, talvez seja necess&aacute;rio limpar o sistema das instala&ccedil;&otilde;es anteriores. </p>
<p><b>Para Microsoft Windows, Solaris OS e Linux:</b></p>
<ol>

  <li>exclua o diret&oacute;rio de trabalho do instalador.</li>
  <li>Exclua os diret&oacute;rios de instala&ccedil;&atilde;o do IDE e do servidor de aplica&ccedil;&otilde;es GlassFish.</li>
  <li>Na plataforma Windows, exclua todas as entradas do registro menos a <tt>nbi*</tt> de todas as chaves de registro: <tt>HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall</tt> <tt>HKEY_CURRENT_USER\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall</tt> </li>

</ol>
<p><b>Para Mac OS X:</b></p>
<ul>
  <li>arraste as pastas ou arquivos de programas para a Lixeira. </li>
</ul>
</div>
<div>
<h3>Desabilitando alguns produtos de software antes da instala&ccedil;&atilde;o</h3>
<p>&Eacute; melhor desabilitar o firewall, o antiv&iacute;rus e os aplicativos de monitoramento antes de iniciar a instala&ccedil;&atilde;o. Alguns desses aplicativos podem evitar que os componentes do IDE sejam configurados corretamente durante o processo de instala&ccedil;&atilde;o. </p>
<p>Por exemplo, se voc&ecirc; possuir o aplicativo Logitech Process Monitor (<tt>LVPrcSrv.exe</tt>) no sistema, desative-o antes da instala&ccedil;&atilde;o. </p>

</div>
<p align="center"><a href="#top">in&iacute;cio</a></p>
<h2><a name="moreinformation"></a>Mais informa&ccedil;&otilde;es</h2>

<ul>
<li><a href="index.html" target="_blank">Informa&ccedil;&otilde;es da vers&atilde;o 7.0 do NetBeans IDE</a></li>
<li><a href="relnotes.html" target="_blank">Notas de Vers&atilde;o da vers&atilde;o 7.0 do NetBeans IDE</a></li>
<li><a href="http://wiki.netbeans.org/NetBeansUserFAQ#Installation" target="_blank">FAQ de instala&ccedil;&atilde;o do NetBeans IDE</a></li>
</ul>
<div class="feedback-box"><a href="https://netbeans.org/about/contact_form.html?to=3&subject=Feedback:%20NetBeans%20IDE%207.0%20Installation%20Instructions">Envie-nos seus coment&aacute;rios</a>
</div>
<br style="clear:both;">
<p align="center"><a href="#top">in&iacute;cio</a></p>
</body>
</html>
