<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<!--
  Copyright 2009 Sun Microsystems, Inc. 
  All Rights Reserved.
-->

<html>
<head>
<link rel="stylesheet" type="text/css" href="../../../netbeans.css">
<link rel="stylesheet" type="text/css" media="print" href="../../../print.css">
<link rel="shortcut icon" href="https://netbeans.org/favicon.ico" type="image/x-icon" >
<title>Instru&ccedil;&otilde;es de instala&ccedil;&atilde;o do NetBeans IDE 6.8</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" >
<meta name="description" content="Installation instructions for  NetBeans IDE 6.8">
<meta name="keywords" content="NetBeans, IDE, free, open source, install notes, developer, installer, NetBeans, NetBeans IDE, NetBeans installer, NetBeans development environment" >
<style type="text/css">
<!--
.style2 {color: #000000}
-->
</style>
</head>
<body>
<a name="top"></a>
<h1>Instru&ccedil;&otilde;es de instala&ccedil;&atilde;o do NetBeans IDE 6.8</h1>
<div class="articledate" style="margin-left: 0px;">&Uacute;ltima atualiza&ccedil;&atilde;o: <!-- #BeginDate format:Am1 -->10 dezembro de 2009<!-- #EndDate --> </div>
<p>Este documento descreve como instalar o NetBeans IDE 6.8 em seu sistema. Consulte as Notas de Vers&atilde;o do NetBeans IDE 6.8 para obter informa&ccedil;&otilde;es sobre <a href="relnotes_pt_BR.html#system_requirements">os sistemas operacionais suportados e sobre as configura&ccedil;&otilde;es de hardware</a> para o IDE. Para saber mais sobre os novos recursos inclu&iacute;dos nesta vers&atilde;o do IDE, consulte a p&aacute;gina <a href="index_pt_BR.html">Informa&ccedil;&otilde;es da vers&atilde;o 6.8 do NetBeans IDE</a>.</p>

<h2>Conte&uacute;do</h2>
<ul>
<li><a href="#requiredsoftware" title="Software necess&aacute;rio">Software necess&aacute;rio</a></li>
<li><a href="#downloadoptions" title="Op&ccedil;&otilde;es de download do instalador">Op&ccedil;&otilde;es de download do instalador</a></li>
<li><a href="#customizeinstall" title="Personalizando sua instala&ccedil;&atilde;o">Personalizando sua instala&ccedil;&atilde;o</a></li>
<li><a href="#startdownload" title="Iniciando o download">Iniciando o download</a></li>
<li><a href="#installation" title="Instalando o software">Instalando o software</a><div>
<ul>
<li><a href="#install_windows">Microsoft Windows, Solaris OS e Linux </a></li>
<li><a href="#install_mac">Mac OS X</a> </li>
<li><a href="#install_zip">Pacote independente de plataforma</a> </li>
</ul>
</div></li>
<li><a href="#uninstallation" title="Desinstalando o software">Desinstalando o software</a></li>
<li><a href="#upgrading">Atualizando e coexistindo com vers&otilde;es anteriores</a> </li>
<li><a href="#troubleshooting" title="Solu&ccedil;&atilde;o de problemas">Solu&ccedil;&atilde;o de problemas</a><a href="#troubleshooting" title=""></a></li>
<li><a href="#moreinformation" title="Mais informa&ccedil;&otilde;es">Mais informa&ccedil;&otilde;es</a><a href="#moreinformation" title=""></a></li>
</ul>
<h2><a name="requiredsoftware" id="requiredsoftware"></a>Software necess&aacute;rio</h2>
<p>Antes de instalar o IDE, voc&ecirc; dever&aacute; instalar o <span class="style2">Java SE Development Kit (JDK) 5.0 Atualiza&ccedil;&atilde;o 19 (vers&atilde;o 1.5.0_19)  o JDK 6 Atualiza&ccedil;&atilde;o 14)</span> em seu sistema. Se n&atilde;o tiver o JDK instalado, n&atilde;o ser&aacute; poss&iacute;vel prosseguir com a instala&ccedil;&atilde;o.  &Eacute; poss&iacute;vel fazer o download da vers&atilde;o mais recente do JDK em <a href="http://java.sun.com/javase/downloads/index.jsp" target="_blank">http://java.sun.com/javase/downloads</a>.
<p>Nas op&ccedil;&otilde;es de download de PHP, Ruby e C++, voc&ecirc; pode instalar o JRE, em vez do JDK. No entanto, se tiver a inten&ccedil;&atilde;o de usar qualquer recurso Java, voc&ecirc; precisar&aacute; do JDK. </p>
<p align="center"><a href="#top">in&iacute;cio</a></p>
<h2><a name="downloadoptions" id="downloadoptions"></a>Op&ccedil;&otilde;es de download do Installer</h2>
<p>Na <a href="https://netbeans.org/downloads/6.8/index.html" target="_blank">p&aacute;gina de download</a> do NetBeans IDE  , voc&ecirc; pode adquirir um dos diversos instaladores, cada um contendo o IDE b&aacute;sico e as ferramentas adicionais.  </p>
<p>Os seguintes instaladores est&atilde;o dispon&iacute;veis: </p>
<ul>
<li><b>Java</b>. Fornece ferramentas para o desenvolvimento de aplicativos Java SE, Java EE e Java ME. Esta op&ccedil;&atilde;o de download inclui tamb&eacute;m o GlassFish v3 o software Apache Tomcat 6.0.20. </li>
<li><b>JavaFX</b>. Oferece suporte ao desenvolvimento de avan&ccedil;ados aplicativos multiplataformas JavaFX.</li>
<li><b>Java SE</b>.  Oferece suporte a todos os recursos de desenvolvimento padr&atilde;o Java SE, bem como &agrave; plataforma de desenvolvimento NetBeans RCP.</li>
<li><b>Ruby</b>.  Fornece ferramentas para desenvolvimento Ruby e oferece suporte para Rails e JRuby. Cont&eacute;m tamb&eacute;m o GlassFish v3.</li>
<li><b>PHP</b>.  Oferece ferramentas para desenvolvimento em PHP.</li>
<li><b>C/C++</b>.  Oferece suporte para o desenvolvimento nas linguagens C, C++, Fortran e Assembly. </li>

<li><b>Tudo.  </b> Trata-se de uma op&ccedil;&atilde;o de download completo que cont&eacute;m todos tempos de execu&ccedil;&atilde;o e pacotes dispon&iacute;veis do NetBeans IDE.  </li>
</ul>
<p align="center"><a href="#top">in&iacute;cio</a></p>
<h2><a name="customizeinstall"></a>Personalizando sua instala&ccedil;&atilde;o</h2>
<p>Se voc&ecirc; fez o download da op&ccedil;&atilde;o Java ou da op&ccedil;&atilde;o &quot;Tudo&quot;, pode escolher exatamente as ferramentas e os tempos de execu&ccedil;&atilde;o para a instala&ccedil;&atilde;o. Clique em Personalizar na p&aacute;gina de boas-vindas do instalador e selecione os recursos que deseja usar. Para obter mais informa&ccedil;&otilde;es, consulte <a href="#installation" title="Instalando o software">Instalando o software</a>.</p>
<p>Se voc&ecirc; deseja adicionar funcionalidade a sua configura&ccedil;&atilde;o do NetBeans IDE, use o NetBeans Plugin Manager. Por exemplo, suponhamos que voc&ecirc; iniciou baixando e instalando o pacote Ruby.  Em seguida, voc&ecirc; decidiu que deseja experimentar a funcionalidade C/C++. Para fazer isso, acesse o NetBeans Plugin Manager no IDE (selecione Ferramentas &gt; Plug-ins) e adicione o pacote C/C++ &agrave; instala&ccedil;&atilde;o existente.</p>
<p>H&aacute; diversas notas importantes sobre a instala&ccedil;&atilde;o e a configura&ccedil;&atilde;o de alguns recursos do NetBeans IDE: </p>
<ol>
  <li>O Apache Tomcat 6.0.20 est&aacute; inclu&iacute;do nas op&ccedil;&otilde;es de download &quot;Java&quot; e &quot;Tudo&quot;, mas n&atilde;o est&aacute; instalado por padr&atilde;o nessas op&ccedil;&otilde;es.  Para instalar o Apache Tomcat da op&ccedil;&atilde;o de download Java ou &quot;Tudo&quot;, inicie a instala&ccedil;&atilde;o e selecione Apache Tomcat 6.0.20 na caixa de di&aacute;logo Instala&ccedil;&atilde;o personalizada.</li>

  <li>Para o desenvolvimento de C/C++ (aplic&aacute;vel aos downloads C/C++ e &quot;Tudo&quot;), al&eacute;m disso &eacute; necess&aacute;rio instalar os compiladores e as ferramentas. Para obter mais informa&ccedil;&otilde;es, consulte <a
  href="cpp-setup-instructions_pt_BR.html">Configurando o NetBeans IDE para C/C++/Fortran</a>. </li>
  <li>Para Mac OS X, n&atilde;o &eacute; poss&iacute;vel personalizar a instala&ccedil;&atilde;o do NetBeans IDE dos downloads de Java, Ruby e &quot;Tudo&quot;. A instala&ccedil;&atilde;o do IDE dos downloads de JavaSE, PHP e C/C++ n&atilde;o pode ser personalizada. </li>
  <li><span class="style2">Tamb&eacute;m &eacute; poss&iacute;vel fazer o download <a href="#install_zip">de um arquivo zip independente da plataforma</a> e executar o arquivo execut&aacute;vel do NetBeans IDE. </span>Observe que os tempos de execu&ccedil;&atilde;o, como os servidores de aplicativos GlassFish e o Apache Tomcat, est&atilde;o dispon&iacute;veis somente com instaladores espec&iacute;ficos da plataforma. </li>
</ol>
<p align="center"><a href="#top">in&iacute;cio</a></p>
<h2><a name="startdownload" id="startdownload"></a>Iniciando o download</h2>

<ol>
<li>Acesse a <a href="https://netbeans.org/downloads/6.8/index.html" target="_blank">p&aacute;gina de download</a> do NetBeans IDE.</li>
<li>Na parte superior direita da p&aacute;gina, selecione a linguagem e a plataforma na lista suspensa. Voc&ecirc; tamb&eacute;m pode optar por fazer o download e usar somente o arquivo zip independente da plataforma. </li>
<li>Clique no bot&atilde;o Download para selecionar a op&ccedil;&atilde;o de download que deseja instalar.</li>
<li>Salve o arquivo do instalador no sistema.</li>
</ol>
<p align="center"><a href="#top">superior</a></p>
<h2><a name="installation"></a>Instalando o software</h2>

<p>Siga as instru&ccedil;&otilde;es nesta se&ccedil;&atilde;o para instalar o IDE no sistema.    Estas instru&ccedil;&otilde;es de instala&ccedil;&atilde;o aplicam-se a todas as plataformas compat&iacute;veis.    Para obter uma lista das plataformas compat&iacute;veis, consulte as <a href="relnotes_pt_BR.html">notas de vers&atilde;o</a>. </p>
<h3><a name="install_windows" id="install_windows">Microsoft Windows, Solaris OS e Linux </a></h3>
<p><b>Para instalar o software:</b></p>
  <ol>
    <li>Ap&oacute;s concluir o download, execute o instalador. 
   <ul>
    <li>Para Windows, o arquivo execut&aacute;vel do instalador tem a extens&atilde;o <tt>.exe</tt>. Clique duas vezes no arquivo do instalador para execut&aacute;-lo. </li>
    <li>Nas plataformas Solaris e Linux, o arquivo do instalador tem a extens&atilde;o <tt>.sh</tt>. Para estas plataformas, voc&ecirc; precisa executar os arquivos do instalador com o seguinte comando: <tt> chmod +x &lt;<i>installer-file-name</i>&gt;</tt></li>
   </ul>
  </li>
    <li>Para selecionar as ferramentas e os tempos de execu&ccedil;&atilde;o a serem instalados, execute as seguintes etapas na p&aacute;gina de boas-vindas do assistente de instala&ccedil;&atilde;o:
      <ol type="a">
         <li>Clique em Personalizar.</li>
         <li>Na caixa de di&aacute;logo Personalizar a instala&ccedil;&atilde;o, fa&ccedil;a suas sele&ccedil;&otilde;es:</li>
         <li>Clique em OK.</li>
       </ol>
    </li>
     <li>Na p&aacute;gina de boas-vindas do assistente de instala&ccedil;&atilde;o, clique em Avan&ccedil;ar.</li>
     <li>Na p&aacute;gina Contrato de licen&ccedil;a, leia o contrato, marque a caixa de sele&ccedil;&atilde;o para aceitar e clique em Avan&ccedil;ar.</li>
     <li>Na p&aacute;gina de instala&ccedil;&atilde;o do IDE NetBeans, proceda da seguinte maneira:
       <ol type="a">
      <li>Aceite o diret&oacute;rio padr&atilde;o de instala&ccedil;&atilde;o do IDE NetBeans ou especifique outro diret&oacute;rio.
         <p><b>Nota:</b> o diret&oacute;rio de instala&ccedil;&atilde;o dever&aacute; estar vazio e o perfil de usu&aacute;rio que estiver sendo usado para executar o instalador dever&aacute; ter permiss&otilde;es de leitura/grava&ccedil;&atilde;o para esse diret&oacute;rio.</p></li>
      <li>Aceite a instala&ccedil;&atilde;o padr&atilde;o do JDK para usar com o NetBeans IDE ou selecione uma instala&ccedil;&atilde;o diferente na lista suspensa. Se o assistente de instala&ccedil;&atilde;o n&atilde;o encontrou uma instala&ccedil;&atilde;o JDK compat&iacute;vel para ser usada com o NetBeans IDE, o JDK n&atilde;o est&aacute; instalado no local padr&atilde;o. Nesse caso, especifique o caminho do JDK instalado e clique em Avan&ccedil;ar ou cancele a instala&ccedil;&atilde;o atual. Ap&oacute;s a instala&ccedil;&atilde;o da vers&atilde;o necess&aacute;ria do JDK, voc&ecirc; pode reiniciar a instala&ccedil;&atilde;o.</li>
        </ol>
   <li>Se a p&aacute;gina de instala&ccedil;&atilde;o do GlassFish v3 for aberta, aceite o diret&oacute;rio padr&atilde;o de instala&ccedil;&atilde;o ou especifique outro local de instala&ccedil;&atilde;o.</li>
   <li>Se estiver instalando o Apache Tomcat, em sua p&aacute;gina de instala&ccedil;&atilde;o, aceite o diret&oacute;rio padr&atilde;o de instala&ccedil;&atilde;o ou especifique outro local de instala&ccedil;&atilde;o. </li>
   <li>Na p&aacute;gina Resumo, verifique se a lista de componentes a serem instalados est&aacute; correta e se voc&ecirc; tem espa&ccedil;o suficiente no sistema para a instala&ccedil;&atilde;o.</li>
   <li>Clique em Instalar para iniciar a instala&ccedil;&atilde;o.</li>
  </ol>

<p class="notes"><b>Nota:</b> se voc&ecirc; encontrar problemas ap&oacute;s concluir instala&ccedil;&atilde;o do software com &ecirc;xito, consulte <a href="#troubleshooting">Solu&ccedil;&atilde;o de problemas</a> para obter descri&ccedil;&otilde;es e solu&ccedil;&otilde;es para as quest&otilde;es n&atilde;o-resolvidas que poder&atilde;o afetar o processo de instala&ccedil;&atilde;o. </p>
<h3><a name="install_mac" id="install_mac">Mac OS X</a></h3>
<p><b>Para instalar o software:</b></p>
<ol>
  <li>Ap&oacute;s concluir o download, execute o instalador. O arquivo do instalador tem a extens&atilde;o <tt>.dmg</tt>. </li>
  <li>Clique no &iacute;cone de pacote na janela exibida. A extens&atilde;o do pacote &eacute; <tt> .mpkg </tt>. O assistente de instala&ccedil;&atilde;o &eacute; iniciado. </li>
  <li>Na p&aacute;gina de boas-vindas do assistente de instala&ccedil;&atilde;o, clique em Continuar.</li>
  <li>Leia o contrato de licen&ccedil;a e clique em Continuar.     Clique em Aceitar na janela suspensa para aceitar a licen&ccedil;a.</li>
  <li>Na p&aacute;gina Selecionar um destino. selecione o drive e clique em Continuar. </li>
  <li>Se voc&ecirc; baixou o pacote Java, Ruby ou Tudo, voc&ecirc; pode personalizar a sua instala&ccedil;&atilde;o. Pressione o bot&atilde;o Personalizar, no lado esquerdo inferior da janela do assistente de instala&ccedil;&atilde;o, na &uacute;ltima janela do assistente de instala&ccedil;&atilde;o.  A &aacute;rvore de produtos &eacute; exibida.  </li>
  <li>Selecione os produtos que voc&ecirc; deseja instalar.</li>
  <li>Digite o nome do administrador e a senha no sistema e clique em OK para iniciar a instala&ccedil;&atilde;o.</li>
</ol>

<h3><a name="install_zip" id="install_zip">Pacote independente de plataforma</a></h3>
<p><b>Para executar o software:</b></p>
<ol>
  <li>Ap&oacute;s o download do arquivo ZIP independente da plataforma, extraia-o em qualquer pasta do sistema. </li>
  <li>Execute o arquivo execut&aacute;vel localizado no diret&oacute;rio <tt>netbeans/bin</tt>. </li>
  <li>Aceite o Contrato de Licen&ccedil;a. O NetBeans IDE &eacute; iniciado.  </li>
</ol>
<p><span class="notes"><b>Nota:</b> observe que os tempos de execu&ccedil;&atilde;o, como o servidor de aplicativos GlassFish e o Apache Tomcat, est&atilde;o dispon&iacute;veis somente com instaladores espec&iacute;ficos da plataforma.</span></p>
<p><span class="notes"><b>Nota:</b> se n&atilde;o for poss&iacute;vel encontrar a instala&ccedil;&atilde;o do JDK compat&iacute;vel, talvez seja necess&aacute;rio adicionar manualmente o caminho ao diret&oacute;rio de instala&ccedil;&atilde;o do JDK:</span></p>
<ol>
  <li>Abra em um editor de texto o arquivo <tt>netbeans.conf</tt> localizado em <tt>netbeans/etc</tt>.</li>
  <li>Introduza a localiza&ccedil;&atilde;o da instala&ccedil;&atilde;o do JDK compat&iacute;vel como o valor da op&ccedil;&atilde;o <tt>netbeans_jdkhome</tt>.</li>
  <li>Salve o arquivo <tt>netbeans.conf</tt> e execute o arquivo execut&aacute;vel em <tt>netbeans/bin</tt>.</li>
</ol>
<p align="center"><a href="#top">superior</a></p>
<h2><a name="uninstallation">Desinstalando o software</a></h2>
<div>
<h3><a name="uninstall_windows">Microsoft Windows</a></h3>
<p>Se necess&aacute;rio, voc&ecirc; pode desinstalar o NetBeans IDE, o servidor de aplicativos GlassFish v3 e o Apache Tomcat usando os seguintes procedimentos.</p>
<p><b>Para desinstalar o IDE</b>:</p>
<ol>
  <li>Feche o IDE.
  </li>
  <li>No Painel de controle, selecione Adicionar ou remover programas e ent&atilde;o selecione NetBeans IDE 6.8 e clique em Remover.</li>
</ol>
<p><b>Para desinstalar o GlassFish v3:</b></p>
<ol>
  <li>Feche o IDE.</li>
  <li>No Painel de controle, selecione Adicionar ou remover programas e, ent&atilde;o, selecione GlassFish v3 e clique em Remover.</li>
</ol>
<p><b>Para desinstalar o Apache Tomcat: </b></p>

<ol>
  <li>Feche o IDE.</li>
  <li>No Painel de controle, selecione Adicionar ou remover programas e ent&atilde;o selecione Apache Tomcat 6.0.20 e clique em Remover.</li>
</ol>
</div>
<div>
<h3><a name="uninstall_sollinux">Solaris OS, Linux</a></h3>
<p>Se necess&aacute;rio, voc&ecirc; pode desinstalar o NetBeans IDE, o GlassFish v3 e o Apache Tomcat usando os seguintes procedimentos.</p>
<p><b>Para desinstalar o IDE</b>:</p>

<ol>
  <li>Feche o IDE.</li>
  <li>No diret&oacute;rio de instala&ccedil;&atilde;o do IDE, execute o arquivo <tt>uninstall.sh.</tt> </li>
  <li>Para desinstalar o GlassFish/Tomcat e o IDE ao mesmo tempo, na p&aacute;gina Resumo assegure-se de que as vers&otilde;es listadas s&atilde;o as corretas e as caixas apropriadas est&atilde;o marcadas.     </li>
  <li>Na p&aacute;gina Resumo, clique em Desinstalar. 
  </li>
  <li>Quando a desinstala&ccedil;&atilde;o for conclu&iacute;da, clique em Concluir.</li>
</ol>
<p><b>Para desinstalar o GlassFish v3 </b>:</p>
<ol>
  <li>Feche o IDE.</li>
  <li>Localize o diret&oacute;rio de instala&ccedil;&atilde;o do servidor de aplica&ccedil;&otilde;es.
  <p><b>Nota:</b> o local padr&atilde;o de instala&ccedil;&atilde;o ser&aacute; diferente, dependendo do tipo de instala&ccedil;&atilde;o e da plataforma.     A tabela a seguir exibe o diret&oacute;rio padr&atilde;o de instala&ccedil;&atilde;o do servidor de aplicativos para v&aacute;rias plataformas.</p>

  <table>
    <tbody>
        <tr class="tblheader">
            <th width="70">Plataforma</th>
            <th width="101">Instalando como...</th>
			<th width="264">Instala&ccedil;&atilde;o do GlassFish v3</th>
        </tr>
        <tr class="tbltd0">
          <td>Windows</td>
          <td>usu&aacute;rio com direitos de administrador</td>
          <td><tt>%ProgramFiles%\glassfish-v3</tt></td>
        </tr>
        <tr class="tbltd0">
          <td>Windows</td>
          <td>usu&aacute;rio</td>
          <td><tt>%USERPROFILE%\glassfish-v3</tt></td>
        </tr>
        <tr class="tbltd0">
            <td>Solaris&nbsp;OS&nbsp;</td>
            <td>raiz</td>
			 <td><tt>/opt/glassfish-v3</tt></td>
        </tr>
        <tr class="tbltd1">

            <td>SO Solaris, Linux</td>
            <td valign="top">usu&aacute;rio</td>
			<td valign="top"><tt>~/glassfish-v3</tt></td>
        </tr>
        <tr class="tbltd0">
            <td>Linux</td>
            <td>raiz</td>
			<td><tt>/usr/local/glassfish-v3</tt></td>
        </tr>
    </tbody>
</table>
  </li>
  <li>No diret&oacute;rio de instala&ccedil;&atilde;o do servidor de aplica&ccedil;&otilde;es, execute o arquivo <tt>uninstall.sh</tt>.</li>

  <li>Na p&aacute;gina Resumo, clique em Desinstalar.
  </li>
  <li>Quando a desinstala&ccedil;&atilde;o for conclu&iacute;da, clique em Concluir.</li>
</ol>
<p><b>Para desinstalar o Apache Tomcat: </b></p>
<ol>
  <li>Feche o IDE.</li>

  <li>Localize o diret&oacute;rio de instala&ccedil;&atilde;o do Apache Tomcat e execute o arquivo <tt>uninstall.sh</tt>. 
  </li>
  <li>Na p&aacute;gina Resumo, clique em Desinstalar. </li>
  <li>Quando a desinstala&ccedil;&atilde;o for conclu&iacute;da, clique em Concluir</li>
</ol>
</div>
<div>

<h3><a name="uninstall_mac" id="uninstall_mac">Mac OS X</a></h3>
<p><b>Para desinstalar o IDE e o servidor de aplica&ccedil;&otilde;es:</b></p>
<ol>
  <li>Feche o software.</li>
  <li>Arraste as pastas ou arquivos de programas para a Lixeira. Observe que o local padr&atilde;o do IDE e do servidor de aplica&ccedil;&otilde;es &eacute; <tt>/Applications/NetBeans/</tt>.  </li>
</ol>
</div>
<div>

<h3><a name="uninstall_zip" id="uninstall_zip">Pacote independente de plataforma</a></h3>
<p>Para desinstalar os arquivos do IDE, siga as etapas descritas na se&ccedil;&atilde;o <a href="#clean">Limpeza ap&oacute;s instala&ccedil;&otilde;es incompletas</a> deste documento. </p>
</div>
<p align="center"><a href="#top">in&iacute;cio</a></p>
<h2><a name="upgrading"></a>Atualizando e coexistindo com vers&otilde;es anteriores</h2>
<p>O NetBeans IDE 5.x, 6.0, 6.1, 6.5 e 6.7 podem coexistir com o NetBeans IDE 6.8 no mesmo sistema. Voc&ecirc; n&atilde;o precisa desinstalar as vers&otilde;es anteriores para instalar ou executar o NetBeans IDE 6.8. </p>
<p>Se voc&ecirc; possui o NetBeans IDE 5.x, 6.0, 6.1, 6.5 ou 6.7 instalado, ter&aacute; a op&ccedil;&atilde;o de importar ou n&atilde;o as configura&ccedil;&otilde;es de usu&aacute;rio do diret&oacute;rio existente ao executar o NetBeans 6.8 da primeira vez.</p>
<p align="center"><a href="#top">in&iacute;cio</a></p>
<h2><a name="troubleshooting" id="troubleshooting"></a>Solu&ccedil;&atilde;o de problemas</h2>
<div>
<h3>Sobre o diret&oacute;rio de trabalho do instalador</h3>
<p>O instalador armazena dados sobre as sess&otilde;es de instala&ccedil;&atilde;o no diret&oacute;rio de trabalho do instalador.   Exemplos desses dados s&atilde;o a lista de componentes instalados no sistema, as mensagens do registro de instala&ccedil;&atilde;o e os dados de registro. </p>

<p>O local padr&atilde;o do diret&oacute;rio de trabalho do instalador &eacute; <tt>%USERPROFILE%\.nbi</tt> no Windows e <tt>~/.nbi</tt> em outras plataformas.   O subdiret&oacute;rio do registro cont&eacute;m os arquivos de registro de instala&ccedil;&atilde;o. </p>
</div>
<div>
<h3><a name="clean"></a>Limpeza ap&oacute;s instala&ccedil;&otilde;es incompletas</h3>
<p>Ap&oacute;s instala&ccedil;&otilde;es incompletas ou malsucedidas, talvez seja necess&aacute;rio limpar o sistema das instala&ccedil;&otilde;es anteriores. </p>
<p><b>Para Microsoft Windows, Solaris OS e Linux:</b></p>
<ol>

  <li>Exclua o diret&oacute;rio de trabalho do instalador.</li>
  <li>Exclua os diret&oacute;rios de instala&ccedil;&atilde;o do IDE e do servidor de aplica&ccedil;&otilde;es GlassFish.</li>
  <li>Na plataforma Windows, exclua todas as entradas do registro menos a <tt>nbi*</tt> de todas as chaves de registro: <tt>HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall</tt> <tt>HKEY_CURRENT_USER\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall</tt> </li>

</ol>
<p><b>Para Mac OS X:</b></p>
<ul>
  <li>Arraste as pastas ou arquivos de programas para a Lixeira. </li>
</ul>
</div>
<div>
<h3>Desabilitando alguns produtos de software antes da instala&ccedil;&atilde;o</h3>
<p>&Eacute; melhor desabilitar o firewall, o antiv&iacute;rus e os aplicativos de monitoramento antes de iniciar a instala&ccedil;&atilde;o.  Alguns desses aplicativos podem evitar que os componentes do IDE sejam configurados corretamente durante o processo de instala&ccedil;&atilde;o. </p>
<p>Por exemplo, se voc&ecirc; possuir o aplicativo Logitech Process Monitor (<tt>LVPrcSrv.exe</tt>) no sistema, desative-o antes da instala&ccedil;&atilde;o. </p>

</div>
<p align="center"><a href="#top">in&iacute;cio</a></p>
<h2><a name="moreinformation"></a>Mais informa&ccedil;&otilde;es</h2>

<ul>
<li><a href="index_pt_BR.html">Informa&ccedil;&otilde;es da vers&atilde;o 6.8 do NetBeans IDE</a></li>
<li><a href="relnotes_pt_BR.html">Notas de Vers&atilde;o da vers&atilde;o 6.8 do NetBeans IDE</a></li>
<li><a href="http://download.netbeans.org/netbeans/6.8/">P&aacute;gina de download do NetBeans IDE</a></li>
<li><a href="http://wiki.netbeans.org/NetBeansUserFAQ#Installation" target="_blank">FAQ de instala&ccedil;&atilde;o do NetBeans IDE</a></li>
</ul>
<hr class="light">
<div class="feedback-box"><a href="https://netbeans.org/about/contact_form.html?to=3&subject=Feedback: NetBeans IDE 6.8 Installation Instructions">Envie-nos seus coment&aacute;rios</a></div>
<br style="clear:both;">
<p align="center"><a href="#top">in&iacute;cio</a></p>
</body>
</html>
