<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<!--
  Copyright 2009 Sun Microsystems, Inc. 
  All Rights Reserved.
-->

<html>
<head>
<link rel="stylesheet" type="text/css" href="../../../netbeans.css">
<link rel="stylesheet" type="text/css" media="print" href="../../../print.css">
<link rel="shortcut icon" href="https://netbeans.org/favicon.ico" type="image/x-icon" >
<title>Instruccions d'instal&middot;laci&oacute; de l'IDE NetBeans 6.8</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" >
<meta name="description" content="Installation instructions for  NetBeans IDE 6.8">
<meta name="keywords" content="NetBeans, IDE, free, open source, install notes, developer, installer, NetBeans, NetBeans IDE, NetBeans installer, NetBeans development environment" >
<style type="text/css">
<!--
.style2 {color: #000000}
-->
</style>
</head>
<body>
<a name="top"></a>
<h1>Instruccions d'instal&middot;laci&oacute; de l'IDE NetBeans 6.8</h1>
<div class="articledate" style="margin-left: 0px;">&Uacute;ltima actualitzaci&oacute;: <!-- #BeginDate format:Am1 -->3 de desembre del 2009<!-- #EndDate --> </div>
<p>Aquest document descriu com instal&middot;lar l'IDE NetBeans 6.8 al vostre sistema. Per a informaci&oacute; quant als sistemes operatius i les configuracions de maquinari suportades de l'IDE, vegeu les <a href="relnotes_ca.html">Notes del llan&ccedil;ament de l'IDE NetBeans 6.8</a>. Per aprendre les noves caracter&iacute;stiques incloses en aquest llan&ccedil;ament de l'IDE vegeu la p&agrave;gina <a href="index_ca.html">Informaci&oacute; del llan&ccedil;ament de l'IDE NetBeans 6.8</a>.</p>

<p><b>Continguts</b></p>
<ul>
<li><a href="#requiredsoftware" title="Programari necessari">Programari necessari</a></li>
<li><a href="#downloadoptions" title="Opcions de desc&agrave;rrega de l'instal&middot;lador">Opcions de desc&agrave;rrega de l'instal&middot;lador</a></li>
<li><a href="#customizeinstall" title="Personalitzaci&oacute; de la vostra instal&middot;laci&oacute;">Personalitzaci&oacute; de la vostra instal&middot;laci&oacute;</a></li>
<li><a href="#startdownload" title="Inici de la desc&agrave;rrega">Inici de la desc&agrave;rrega</a></li>
<li><a href="#installation" title="Instal&middot;laci&oacute; del programari">Instal&middot;laci&oacute; del programari</a><div>
<ul>
<li><a href="#install_windows">Microsoft Windows, Solaris OS i Linux</a></li>
<li><a href="#install_mac">Mac OS X</a> </li>
<li><a href="#install_zip">Paquet independent de plataforma</a> </li>
</ul>
</div></li>
<li><a href="#uninstallation" title="Des-intal&middot;laci&oacute; del programari">Des-intal&middot;laci&oacute; del programari</a></li>
<li><a href="#upgrading">Actualitzaci&oacute; i coexist&egrave;ncia amb versions pr&egrave;vies</a> </li>
<li><a href="#troubleshooting" title="Resoluci&oacute; de problemes">Problema</a><a href="#troubleshooting" title="Resoluci&oacute; de problemes">Resoluci&oacute;</a></li>
<li><a href="#moreinformation" title="M&eacute; informaci&oacute;">M&eacute;s inf</a><a href="#moreinformation" title="M&eacute;s informaci&oacute;">formaci&oacute;</a></li>
</ul>
<h2><a name="requiredsoftware" id="requiredsoftware"></a>Programari necessari</h2>
<p>Abans que instal&middot;leu l'IDE, ha d'estar instal&middot;lat el <span class="style2">Kit de desenvolupament Java SE (JDK) 5.0 actualitzaci&oacute; 19 (versi&oacute; 1.5.0_19) o el JDK 6 Actualitzaci&oacute; 14</span>, o una versi&oacute; m&eacute;s recent. Si no disposeu d'una instal&middot;laci&oacute; de JDK, no podeu continuar amb la instal&middot;laci&oacute;. Podeu descarregar l'&uacute;ltima versi&oacute; del JDK de <a href="http://java.sun.com/javase/downloads/index.jsp" target="_blank">http://java.sun.com/javase/downloads</a>.
<p>Per a les opcions de desc&agrave;rrega de PHP, Ruby, i C/C++, podeu instal&middot;lar el JRE enlloc del JDK. Tanmateix, si teniu plantejat utilitzar qualsevol de les caracter&iacute;stiques de Java, necessitareu descarregar el JDK. </p>
<p align="center"><a href="#top">principi</a></p>
<h2><a name="downloadoptions" id="downloadoptions"></a>Opcions de desc&agrave;rrega de l'instal&middot;lador</h2>
<p>En la <a href="https://netbeans.org/downloads/6.8/index.html?pagelang=ca" target="_blank">p&agrave;gina de desc&agrave;rrega</a> de l'IDE NetBeans, podeu obtenir un o m&eacute;s instal&middot;ladors, cadascun cont&eacute; l'IDE base i eines addicionals.  </p>
<p>Estan disponibles els seg&uuml;ents instal&middot;ladors: </p>
<ul>
<li><b>Java</b>. Proporciona eines pel desenvolupament d'aplicacions Java SE, Java EE i Java ME. Aquesta opci&oacute; de desc&agrave;rrega tamb&eacute; inclou programari GlassFish v3 i Tomcat 6.0.20 d'Apache. </li>
<li><b>JavaFX</b>. Proporciona suport pel desenvolupament d'aplicacions riques multi-plataforma JavaFX. </li>
<li><b>Java SE</b>. Proporciona totes les caracter&iacute;stiques est&agrave;ndards pel desenvolupament Java SE. Tamb&eacute; est&agrave; incl&ograve;s el suport pel desenvolupament en la plataforma RCP de NetBeans.</li>
<li><b>Ruby</b>. Proporciona eines pel desenvolupament Ruby i suporta Rails i JRuby. Tamb&eacute; cont&eacute; GlassFish v3.</li>
<li><b>PHP</b>. Proporciona eines pel desenvolupament PHP.</li>
<li><b>C/C++</b>. Suporta el desenvolupament en llenguatges C, C++, Qt, Fortran i Assemblador. </li>

<li><b>Tot </b> Aquesta &eacute;s l'opci&oacute; de desc&agrave;rrega completa, la qual cont&eacute; tots els entorns d'execuci&oacute; i packs disponibles pel IDE NetBeans.  </li>
</ul>
<p align="center"><a href="#top">principi</a></p>
<h2><a name="customizeinstall"></a>Personalitzaci&oacute; de la vostra instal&middot;laci&oacute;</h2>
<p>Si descarregueu les opcions de desc&agrave;rrega Java o &quot;Tot&quot;, podeu seleccionar exactament quines eines i entorns d'execuci&oacute; a instal&middot;lar. Cliqueu a Personalitzar a la p&agrave;gina de benvinguda de l'instal&middot;lador i seleccioneu les caracter&iacute;stiques que voleu utilitzar. Per a m&eacute;s informaci&oacute;, vegeu <a href="#installation" title="Instal&middot;laci&oacute; del programari">Instal&middot;laci&oacute; del programari</a>.</p>
<p>Si voleu afegir funcionalitats al vostre IDE NetBeans, utilitzeu el gestor de complements de NetBeans. Per exemple, assumint que heu iniciat la desc&agrave;rrega i instal&middot;laci&oacute; del Pack de Ruby. Despr&eacute;s decidiu que voleu provar la funcionalitat C/C++. Per a fer-ho, dirigiu-vos al gestor de complements de NetBeans des de l'IDE (seleccioneu Eines &gt; Complements) i afegiu el pack C/C++ a la vostra instal&middot;laci&oacute; existent.</p>
<p>Hi han diverses notes importants quant a la instal&middot;laci&oacute; i configuraci&oacute; per a algunes de les caracter&iacute;stiques de l'IDE NetBeans. </p>
<ol>
  <li>Tomcat 6.0.20 d'Apache est&agrave; incl&ograve;s en les opcions de desc&agrave;rrega &quot;Java&quot; i &quot;Tot&quot; no obstant aquest no s'instal&middot;la per defecte des de qualsevol d'aquestes opcions. Per instal&middot;lar Tomcat d'Apache des de la desc&agrave;rrega Java o &quot;Tot&quot;, executeu el instal&middot;lador i seleccioneu Tomcat 6.0.20 d'Apache en el quadre de di&agrave;leg Instal&middot;laci&oacute; personalitzada.</li>

  <li>Pel desenvolupament C/C++ (aplicable a les desc&agrave;rregues C/C++ i &quot;Tot&quot;), addicionalment necessiteu instal&middot;lar els compiladors i les eines. Per a m&eacute;s informaci&oacute;, referiu-vos a <a
  href="cpp-setup-instructions.html">Configuraci&oacute; de l'IDE NetBeans per a C/C++/Fortran</a>. </li>
  <li>Per a Mac OS X, podeu personalitzar la instal&middot;laci&oacute; de l'IDE NetBeans des de les desc&agrave;rregues Java, Ruby, i ''Tot''. La instal&middot;laci&oacute; de l'IDE des de les desc&agrave;rregues JavaSE, PHP, i C/C++ no pot ser personalitzada. </li>
  <li><span class="style2">Tamb&eacute; podeu descarregar <a href="#install_zip">un fitxer zip independent de plataforma</a> i executar el fitxer executable de l'IDE NetBeans. </span>Denoteu que els entorns d'execuci&oacute;, com els servidors d'aplicaci&oacute; GlassFish i Tomcat d'Apache, &uacute;nicament estan disponibles des dels instal&middot;ladors espec&iacute;fics de plataforma. </li>
</ol>
<p align="center"><a href="#top">principi</a></p>
<h2><a name="startdownload" id="startdownload"></a>Iniciant la desc&agrave;rrega</h2>

<ol>
<li>Aneu a la <a href="https://netbeans.org/downloads/6.8/index.html?pagelang=ca" target="_blank">p&agrave;gina de desc&agrave;rrega</a> de l'IDE NetBeans</li>
<li>En la part superior dreta de la p&agrave;gina, seleccioneu l'idioma i plataforma del llistat desplegable. Tamb&eacute; podeu triar de descarregar i utilitzar un fitxer zip independent de plataforma. </li>
<li>Cliqueu al bot&oacute; Descarregar per tal de descarregar l'opci&oacute; que voleu instal&middot;lar.</li>
<li>Deseu el fitxer de l'instal&middot;lador al vostre sistema.</li>
</ol>
<p align="center"><a href="#top">principi</a></p>
<h2><a name="installation"></a>Instal&middot;laci&oacute; del programari</h2>

<p>Seguiu les instruccions en aquesta secci&oacute; per instal&middot;lar l'IDE al vostre sistema. Aquestes instruccions d'instal&middot;laci&oacute; s'apliquen a totes les plataformes suportades. Per al llistat de plataformes suportades, vegeu les <a href="relnotes_ca.html">notes de la versi&oacute;</a>. </p>
<h3><a name="install_windows" id="install_windows">Microsoft Windows, Solaris OS i Linux</a></h3>
<p><b>Instal&middot;lar el programari</b></p>
<ol>
<li>Despr&eacute;s que es finalitzi la desc&agrave;rrega, executeu l'instal&middot;lador. 
<ul>
<li>Per a Windows, el fitxer executable de l'instal&middot;lador t&eacute; l'extensi&oacute; <tt>.exe</tt> Clique dos cops al fitxer de l'instal&middot;lador per a executa'l. </li>

<li>Per a plataformes Solaris i Linux, el fitxer de l'instal&middot;lador t&eacute; l'extensi&oacute; <tt>.sh</tt> Per a aquestes plataformes, necessiteu que el fitxer de l'insta&middot;lador sigui executable mitjan&ccedil;ant la seg&uuml;ent comanda: <tt> chmod +x &lt;<i>nom-fitxer-intal&middot;lador</i>&gt;</tt></li>
</ul>
</li>
<li>Per triar les eines i els entorns d'execuci&oacute; a instal&middot;lar, realitzeu els seg&uuml;ents passos en la p&agrave;gina de benvinguda de l'assistent d'instal&middot;laci&oacute;:
  <ol type="a">
<li>Cliqueu a Personalitzar.</li>
<li>En el quadre de di&agrave;leg de personalitzaci&oacute; de la instal&middot;laci&oacute;, feu les seg&uuml;ents seleccions.</li>
<li>Cliqueu a Acceptar.</li>
</ol>
</li>
<li>A la p&agrave;gina de benvinguda de l'assistent d'instal&middot;laci&oacute;, Cliqueu a Seg&uuml;ent.</li>
<li>A la p&agrave;gina d'acceptaci&oacute; dels acords dels termes de llic&egrave;ncia, seleccioneu l'acceptaci&oacute;, i cliqueu a Seg&uuml;ent.</li>
<li>A la p&agrave;gina d'instal&middot;laci&oacute; de NetBeans, feu el seg&uuml;ent:
<ol type="a">
<li>Accepteu el directori predeterminat d'instal&middot;laci&oacute; pel IDE NetBeans o b&eacute; especifiqueu un altre directori. <b>Nota:</b> El directori d'instal&middot;laci&oacute; ha d'estar buit, i el perfil del usuari que esteu utilitzant ha de tindre permisos de lectura/escriptura per aquest directori.</li>
<li>Accepteu la instal&middot;laci&oacute; del JDK predeterminat per a utilitzar amb NetBeans, o b&eacute; seleccioneu una instal&middot;laci&oacute; diferent des del llistat desplegable. Si l'assistent d'instal&middot;laci&oacute; no va trobar cap instal&middot;laci&oacute; de JDK compatible per a utilitzar amb l'IDE NetBeans, el vostre JDK no est&agrave; instal&middot;lat a la localitzaci&oacute; predeterminada. En aquest cas, especifiqueu la ruta a un JDK instal&middot;lat o cancel&middot;leu la instal&middot;laci&oacute; actual, instal&middot;leu la versi&oacute; del JDK necess&agrave;ria, i reinicieu la instal&middot;laci&oacute;.</li>
<li>Cliqueu a Seg&uuml;ent.</li>
</ol>
<li>Si s'obre la p&agrave;gina d'instal&middot;laci&oacute; de GlassFish v3, accepteu el directori d'instal&middot;laci&oacute; predeterminat o b&eacute; especifiqueu una altra localitzaci&oacute; d'instal&middot;laci&oacute;.</li>
<li>Si esteu instal&middot;lant Tomcat d'Apache, en la seva p&agrave;gina d'instal&middot;laci&oacute;, accepteu el directori predeterminat d'instal&middot;laci&oacute; o b&eacute; especifiqueu una altra localitzaci&oacute; d'instal&middot;laci&oacute;. </li>
<li>En la p&agrave;gina del resum, verifiqueu que el llistat de components a ser instal&middot;lats siguin correctes i que tingueu l'espai adequat en el vostre sistema per a la instal&middot;laci&oacute;.</li>
<li>Cliqueu a Instal&middot;lar per a comen&ccedil;ar la instal&middot;laci&oacute;.</li>
<p class="notes"><b>Nota:</b> Si us trobeu amb problemes durant la completaci&oacute; de la instal&middot;laci&oacute;, vegeu la <a href="#troubleshooting">Resoluci&oacute; de problemes</a> per a descripcions i solucions suggerides per a incid&egrave;ncies sense resoldre que poden afectar al proc&eacute;s d'instal&middot;laci&oacute;. </p>
<h3><a name="install_mac" id="install_mac">Mac OS X</a></h3>
<p><b>Instal&middot;lar programari</b></p>
<ol>
  <li>Despr&eacute;s que es finalitzi la desc&agrave;rrega, executeu l'instal&middot;lador. El fitxer d'instal&middot;laci&oacute; t&eacute; l'extensi&oacute; <tt>.dmg</tt>. </li>
  <li>Al panell que s'obre cliqueu a la icona del paquet. El paquet t&eacute; l'extensi&oacute; <tt>.mpkg</tt>. L'assistent d'instal&middot;laci&oacute; s'inicia.</li>
  <li>A la p&agrave;gina de benvinguda de l'assistent d'instal&middot;laci&oacute;, cliqueu a Continuar.</li>
  <li>Reviseu els acords de llic&egrave;ncia i cliqueu a Continuar. Cliqueu Acceptar a la finestra emergent per a acceptar la llic&egrave;ncia.</li>
  <li>A la p&agrave;gina de Selecci&oacute; d'una destinaci&oacute;, seleccioneu la unitat i cliqueu a Continuar. </li>
  <li>Si heu descarregat el paquet Tot, Java o Ruby, podeu personalitzar la instal&middot;laci&oacute;. En l'&uacute;ltim panell de l'assistent d'instal&middot;laci&oacute;, premeu al bot&oacute; Personalitzar de la part inferior esquerra del panell. Es mostra l'arbre de productes.  </li>
  <li>Seleccioneu el producte que voleu instal&middot;lar.</li>
  <li>Introdu&iuml;u el nom i la contrasenya de l'administrador pel vostre sistema i cliqueu a Acceptar per a comen&ccedil;ar la instal&middot;laci&oacute;.</li>
</ol>

<h3><a name="install_zip" id="install_zip">Paquet independent de plataforma</a></h3>
<p><b>Executar el programari</b></p>
<ol>
  <li>Despr&eacute;s que es finalitzi la desc&agrave;rrega del fitxer zip independent de plataforma, extraieu-ho a a qualsevol carpeta del vostre sistema. </li>
  <li>Executeu el fitxer executable localitzat al directori <tt>netbeans/bin</tt>. </li>
  <li>Accepteu l'acord de llic&egrave;ncia. El IDE NetBeans s'inicia.  </li>
</ol>
<p><span class="notes"><b>Nota:</b> Denoteu que els entorns d'execuci&oacute;, com el servidor d'aplicacions GlassFish i Tomcat d'Apache, estan &uacute;nicament disponibles per a instal&middot;ladors espec&iacute;fics de plataforma.</span></p>
<p><span class="notes"><b>Nota:</b> Si no es pot trobar la instal&middot;laci&oacute; del JDK compatible, potser haureu d'afegir manualment la ruta al directori de la instal&middot;laci&oacute; del JDK:</span></p>
<ol>
  <li>Obriu el fitxer <tt>netbeans.conf</tt> localitzat a <tt>netbeans/etc</tt> en un editor de text.</li>
  <li>Introdu&iuml;u la localitzaci&oacute; de la instal&middot;laci&oacute; del JDK compatible al valor de l'opci&oacute; <tt>netbeans_jdkhome</tt>.</li>
  <li>Deseu el fitxer <tt>netbeans.conf</tt> i executeu el fitxer executable de <tt>netbeans/bin</tt>.</li>
</ol>
<p align="center"><a href="#top">principi</a></p>
<h2><a name="uninstallation">Desinstal&middot;laci&oacute; del programari</a></h2>
<div>
<h3><a name="uninstall_windows">Microsoft Windows</a></h3>
<p>Si &eacute;s necessari, podeu desinstal&middot;lar l'IDE NetBeans, GlassFish v3, i Tomcat d'Apache mitjan&ccedil;ant els seg&uuml;ents procediments.</p>
<p><b>Desinstal&middot;lar l'IDE</b>:</p>
<ol>
  <li>Atureu l'IDE.
  </li>
  <li>Des del panell de control, Seleccioneu Afegir o Eliminar programes, Despr&eacute;s seleccioneu l'IDE NetBeans 6.8 i cliqueu a Eliminar.</li>
</ol>
<p><b>Desinstal&middot;lar GlassFish v3: </b></p>
<ol>
  <li>Atureu l'IDE.</li>
  <li>Des del panell de control, seleccioneu Afegir o eliminar programes, despr&eacute;s seleccioneu GlassFish v3 i cliqueu a Eliminar.</li>
</ol>
<p><b>Desinstal&middot;lat Tomcat d'Apache: </b></p>

<ol>
  <li>Atureu l'IDE.</li>
  <li>Des del panell de control, seleccioneu Afegir o eliminar programes, despr&eacute;s seleccioneu Tomcat 6.0.20 d'Apache i cliqueu a Eliminar.</li>
</ol>
</div>
<div>
<h3><a name="uninstall_sollinux">Sistema Operatiu Solaris, Linux</a></h3>
<p>Si &eacute;s necessari, podeu desinstal&middot;lar l'IDE NetBeans, GlassFish v3, i Tomcat d'Apache mitjan&ccedil;ant els seg&uuml;ents procediments.</p>
<p><b>Desinstal&middot;lar l'IDE</b>:</p>

<ol>
  <li>Atureu l'IDE.</li>
  <li>En el directori d'instal&middot;laci&oacute; de l'IDE, executeu el fitxer <tt>uninstall.sh</tt>. </li>
  <li>Per desinstal&middot;lar GlassFish/Tomcat juntament amb l'IDE, a la p&agrave;gina de resum assegureu-vos que estiguin llistades les versions correctes i marqueu les caselles apropiades. </li>
  <li>A la p&agrave;gina de resum, cliqueu a desinstal&middot;lar. 
  </li>
  <li>Despr&eacute;s que es finalitzi la desinstal&middot;laci&oacute;, cliqueu a Finalitzar.</li>
</ol>
<p><b>Desinstal&middot;lar GlassFish v3 </b>:</p>
<ol>
  <li>Atureu l'IDE.</li>
  <li>Localitzeu el directori d'instal&middot;laci&oacute; del servidor d'aplicacions.
  <p><b>Nota:</b> La localitzaci&oacute; predeterminada d'instal&middot;laci&oacute; &eacute;s diferent depenent del tipus d'instal&middot;laci&oacute; i plataforma. La seg&uuml;ent taula mostra el directori predeterminat d'instal&middot;laci&oacute; del servidor d'aplicacions en diverses plataformes.</p>

  <table>
    <tbody>
        <tr class="tblheader">
            <th width="70">Plataforma</th>
            <th width="101">Instal&middot;lat com...</th>
			<th width="264">Instal&middot;laci&oacute; de GlassFish v3</th>
        </tr>
        <tr class="tbltd0">
          <td>Windows</td>
          <td>usuari amb permisos d'administraci&oacute;</td>
          <td><tt>%ProgramFiles%\glassfish-v3</tt></td>
        </tr>
        <tr class="tbltd0">
          <td>Windows</td>
          <td>usuari</td>
          <td><tt>%USERPROFILE%\glassfish-v3</tt></td>
        </tr>
        <tr class="tbltd0">
            <td>Sistema Operatiu Solaris</td>
            <td>root</td>
			 <td><tt>/opt/glassfish-v3</tt></td>
        </tr>
        <tr class="tbltd1">

            <td>Sistema Operatiu Solaris, Linux</td>
            <td valign="top">usuari</td>
			<td valign="top"><tt>~/glassfish-v3</tt></td>
        </tr>
        <tr class="tbltd0">
            <td>Linux</td>
            <td>root</td>
			<td><tt>/usr/local/glassfish-v3</tt></td>
        </tr>
    </tbody>
</table>
  </li>
  <li>En el directori d'instal&middot;laci&oacute; del servidor d'aplicacions, executeu el fitxer <tt>uninstall.sh</tt>.</li>

  <li>A la p&agrave;gina de resum, cliqueu a desinstal&middot;lar.
  </li>
  <li>Despr&eacute;s que finalitzi la desinstal&middot;laci&oacute;, cliqueu a Finalitzar.</li>
</ol>
<p><b>Desinstal&middot;lar Tomcat d'Apache: </b></p>
<ol>
  <li>Atureu l'IDE.</li>

  <li>Localitzeu el directori d'instal&middot;laci&oacute; de Tomcat d'Apache i executeu el fitxer <tt>uninstall.sh</tt>. 
  </li>
  <li>A la p&agrave;gina de resum, cliqueu a desinstal&middot;lar. </li>
  <li>Despr&eacute;s que finalitzi la desinstal&middot;laci&oacute;, cliqueu a Finalitzar.</li>
</ol>
</div>
<div>

<h3><a name="uninstall_mac" id="uninstall_mac">Mac OS X</a></h3>
<p><b>Desinstal&middot;lar l'IDE i el servidor d'aplicacions:</b></p>
<ol>
  <li>Atureu el programari.</li>
  <li>Arrossegueu les carpetes o fitxers del programa cap a la paperera. Denoteu que la localitzaci&oacute; predeterminada de l'IDE i el servidor d'aplicacions &eacute;s <tt>/Applications/NetBeans/</tt>.  </li>
</ol>
</div>
<div>

<h3><a name="uninstall_zip" id="uninstall_zip">Paquet independent de plataforma</a></h3>
<p>Per a desinstal&middot;lar els fitxers de l'IDE, seguiu els passos descrits en la secci&oacute; <a href="#clean">Neteja despr&eacute;s d'una instal&middot;laci&oacute; incompleta</a> d'aquest document. </p>
</div>
<p align="center"><a href="#top">principi</a></p>
<h2><a name="upgrading"></a>Actualitzaci&oacute; i coexist&egrave;ncia de versions pr&egrave;vies</h2>
<p>Els IDEs NetBeans 5.x, 6.0, 6.1, 6.5 i 6.7 poden coexistir en el mateix sistema amb l'IDE NetBeans 6.8. No teniu que desinstal&middot;lar les versions pr&egrave;vies en ordre d'instal&middot;lar o executar l'IDE NetBeans 6.8. </p>
<p>Si teniu instal&middot;lats l'IDE NetBeans 5.x, 6.0, 6.1, 6.5 o 6.7 se us permetr&agrave; triar si voleu o no importar les prefer&egrave;ncies d'usuari des del directori d'usuari existent on executeu l'IDE NetBeans 6.8 per primer cop.</p>
<p align="center"><a href="#top">principi</a></p>
<h2><a name="troubleshooting" id="troubleshooting"></a>Resoluci&oacute; de problemes</h2>
<div>
<h3>Quant al directori de treball de l'instal&middot;lador</h3>
<p>L'instal&middot;lador emmagatzema dades quant a les sessions d'instal&middot;laci&oacute; en el directori de treball de l'instal&middot;lador. Exemples d'aquestes dades s&oacute;n el llistat de components instal&middot;lats al vostre sistema, missatges de registre d'instal&middot;laci&oacute;, i dades de registre. </p>

<p>La localitzaci&oacute; predeterminada pel directori de treball de l'instal&middot;lador &eacute;s <tt>%USERPROFILE%\.nbi</tt> en Windows i <tt>~/.nbi</tt> en altres plataformes. El sub-directori de registre cont&eacute; els fitxers de registre de la instal&middot;laci&oacute;. </p>
</div>
<div>
<h3><a name="clean"></a>Neteja despr&eacute;s d'una instal&middot;laci&oacute; incompleta</h3>
<p>Despr&eacute;s d'una instal&middot;laci&oacute; incompleta o insatisfact&ograve;ria, potser haureu de netejar el vostre sistema d'instal&middot;lacions pr&egrave;vies. </p>
<p><b>Per a Microsoft Windows, Solaris, i Linux:</b></p>
<ol>

  <li>Elimineu el directori de treball de l'instal&middot;lador.</li>
  <li>Elimineu els directoris d'instal&middot;laci&oacute; de l'IDE i del servidor d'aplicacions de GlassFish.</li>
  <li>En la plataforma Windows, elimineu totes les entrades al registre <tt>nbi*</tt> des de les seg&uuml;ents claus de registre: <tt>HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall</tt> <tt>HKEY_CURRENT_USER\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall</tt> </li>

</ol>
<p><b>Per Mac OS X:</b></p>
<ul>
  <li>Arrossegueu les carpetes o fitxers de programa a la paperera. </li>
</ul>
</div>
<div>
<h3>Deshabilitar alguns programes abans de la instal&middot;laci&oacute;</h3>
<p>&Eacute;s millor deshabilitar el talla focs, l'antivirus i les aplicacions de monitoritzaci&oacute; abans que inicieu la instal&middot;laci&oacute;. Algunes d'aquestes aplicacions poden impedir que els components de l'IDE siguin configurats correctament durant el proc&eacute;s d'instal&middot;laci&oacute;. </p>
<p>Per exemple, Si teniu l'aplicaci&oacute; de monitoritzaci&oacute; de processos de Logitech (<tt>LVPrcSrv.exe</tt>) executant-se al vostre sistema, atureu-la abans de la instal&middot;laci&oacute;. </p>

</div>
<p align="center"><a href="#top">principi</a></p>
<h2><a name="moreinformation"></a>M&eacute;s informaci&oacute;</h2>

<ul>
<li><a href="index_ca.html">Informaci&oacute; del llan&ccedil;ament de l'IDE NetBeans 6.8</a></li>
<li><a href="relnotes_ca.html">Notes de la versi&oacute; de l'IDE NetBeans 6.8</a></li>
<li><a href="http://download.netbeans.org/netbeans/6.8/">P&agrave;gina de desc&agrave;rrega de l'IDE NetBeans</a></li>
<li><a href="http://wiki.netbeans.org/NetBeansUserFAQ#Installation" target="_blank">Preguntes m&eacute;s freq&uuml;ents en la instal&middot;laci&oacute; de l'IDE NetBeans</a></li>
</ul>
<hr class="light">
<div class="feedback-box"><a href="https://netbeans.org/about/contact_form.html?to=3&subject=Feedback: NetBeans IDE 6.8 Installation Instructions">Envia'ns la vostra opini&oacute;</a></div>
<br style="clear:both;">
<p align="center"><a href="#top">principi</a></p>
</body>
</html>
