<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<!--
  Copyright 2009 Sun Microsystems, Inc. 
  All Rights Reserved.
-->

<html>
<head>
<link rel="stylesheet" type="text/css" href="../../../netbeans.css">
<link rel="stylesheet" type="text/css" media="print" href="../../../print.css">
<link rel="shortcut icon" href="https://netbeans.org/favicon.ico" type="image/x-icon" >
<title>NetBeans IDE 6.8  &ndash; Installationsanweisungen</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" >
<meta name="description" content="Installation instructions for  NetBeans IDE 6.8">
<meta name="keywords" content="NetBeans, IDE, free, open source, install notes, developer, installer, NetBeans, NetBeans IDE, NetBeans installer, NetBeans development environment" >
<style type="text/css">
<!--
.style2 {color: #000000}
-->
</style>
</head>
<body>
<a name="top"></a>
<h1>NetBeans IDE 6.8  &ndash; Installationsanweisungen</h1>
<div class="articledate" style="margin-left: 0px;">Letzte Aktualisierung: <!-- #BeginDate format:Am1 -->7. Dezember 2009<!-- #EndDate --> </div>
<p>Dieses Dokument erl&auml;utert die Installation von NetBeans IDE 6.8 auf Ihrem System. Informationen zu <a href="relnotes.html#system_requirements">unterst&uuml;tzten Betriebssystemen und Hardwarekonfigurationen</a> f&uuml;r die IDE finden Sie in den Versionshinweisen zu NetBeans IDE 6.8. Informationen zu den neuen Merkmalen dieser IDE-Version finden Sie auf der Seite <a href="index_de.html">NetBeans IDE 6.8  &ndash; Versionsinformationen</a>.</p>

<p><b>Inhalt</b></p>
<ul>
<li><a href="#requiredsoftware" title="Erforderliche Software">Erforderliche Software</a></li>
<li><a href="#downloadoptions" title="Optionen zum Herunterladen des Installationsprogramms">Optionen zum Herunterladen des Installationsprogramms</a></li>
<li><a href="#customizeinstall" title="Anpassen Ihrer Installation">Anpassen Ihrer Installation</a></li>
<li><a href="#startdownload" title="Starten des Herunterladens">Starten des Herunterladens</a></li>
<li><a href="#installation" title="Installieren der Software">Installieren der Software</a><div>
<ul>
<li><a href="#install_windows">Microsoft Windows, Solaris OS und Linux</a></li>
<li><a href="#install_mac">Mac OS X</a> </li>
<li><a href="#install_zip">Plattformunabh&auml;ngiges Paket</a> </li>
</ul>
</div></li>
<li><a href="#uninstallation" title="Deinstallieren der Software">Deinstallieren der Software</a></li>
<li><a href="#upgrading">Aktualisieren und Koexistenz mit fr&uuml;heren Versionen</a> </li>
<li><a href="#troubleshooting" title="Fehlerbehebung">Probleme</a><a href="#troubleshooting" title="Fehlerbehebung">beheben</a></li>
<li><a href="#moreinformation" title="Weitere Informationen">Weitere Informationen</a><a href="#moreinformation" title="Weitere Informationen"></a></li>
</ul>
<h2><a name="requiredsoftware" id="requiredsoftware"></a>Erforderliche Software</h2>
<p>Bevor Sie die IDE installieren, muss das <span class="style2">Java SE Development Kit (JDK) 5.0 Update 19 (Version 1.5.0_19) oder JDK 6 Update 14</span> oder neuer auf Ihrem System installiert sein. Wenn Sie nicht &uuml;ber JDK-Installation verf&uuml;gen, k&ouml;nnen Sie nicht mit der Installation fortfahren. Sie k&ouml;nnen die neueste JDK-Version unter <a href="http://java.sun.com/javase/downloads/index.jsp" target="_blank">http://java.sun.com/javase/downloads</a> herunterladen.
<p>Bei den Download-Optionen f&uuml;r PHP, Ruby und C/C++ k&ouml;nnen Sie JRE anstelle von JDK installieren. Wenn Sie jedoch die Nutzung von Java-Merkmalen planen, ben&ouml;tigen Sie JDK. </p>
<p align="center"><a href="#top">Oben</a></p>
<h2><a name="downloadoptions" id="downloadoptions"></a>Optionen zum Herunterladen des Installationsprogramms</h2>
<p>Auf der <a href="https://netbeans.org/downloads/6.8/index.html?pagelang=de" target="_blank">Download-Seite</a> f&uuml;r NetBeans IDE k&ouml;nnen Sie eines von mehreren Installationsprogrammen herunterladen. Jedes Installationsprogramm enth&auml;lt die Basis-IDE und weitere Tools.  </p>
<p>Folgende Installationsprogramme stehen zur Verf&uuml;gung: </p>
<ul>
<li><b>Java</b>. Bietet Tools zur Entwicklung von Anwendungen mit Java SE, Java EE und Java ME. Diese Download-Option umfasst auch GlassFish v3- und Apache Tomcat 6.0.20-Software. </li>
<li><b>JavaFX</b>. Bietet Unterst&uuml;tzung f&uuml;r die umfassende JavaFX-Multi-Plattform-Anwendungsentwicklung. </li>
<li><b>Java SE</b>. Bietet alle Standardmerkmale zur Java SE-Entwicklung. Unterst&uuml;tzung f&uuml;r NetBeans Platform RCP-Entwicklung ist ebenfalls enthalten.</li>
<li><b>Ruby</b>. Bietet Tools f&uuml;r die Ruby-Entwicklung und unterst&uuml;tzt Rails und JRuby. Enth&auml;lt au&szlig;erdem GlassFish v3.</li>
<li><b>PHP</b>. Bietet Tools zur PHP-Entwicklung.</li>
<li><b>C/C++</b>. Unterst&uuml;tzt die Entwicklung in den Sprachen C, C++, Qt, Fortran und Assembly. </li>

<li><b>Alle </b> Dies ist eine Option zum vollst&auml;ndigen Herunterladen. Sie umfasst alle verf&uuml;gbaren Laufzeitversionen und Pakete f&uuml;r die NetBeans-IDE.  </li>
</ul>
<p align="center"><a href="#top">Oben</a></p>
<h2><a name="customizeinstall"></a>Anpassen Ihrer Installation</h2>
<p>Wenn Sie die Optionen Java oder &quot;Alle&quot; herunterladen, k&ouml;nnen Sie genau ausw&auml;hlen, welche Tools und Laufzeitversionen installiert werden sollen. Klicken Sie auf der Startseite des Installationsprogramms auf die Anpassungsoption und w&auml;hlen Sie die gew&uuml;nschten Merkmale aus. Weitere Informationen finden Sie unter <a href="#installation" title="Installieren der Software">Installieren der Software</a>.</p>
<p>Wenn Sie Ihrer NetBeans IDE-Konfiguration weitere Funktionen hinzuf&uuml;gen m&ouml;chten, verwenden Sie den NetBeans Plugin Manager. Gehen wir z. B. davon aus, dass Sie mit dem Herunterladen und dem Installieren des Ruby-Pakets beginnen. Anschlie&szlig;end k&ouml;nnen Sie sich auch daf&uuml;r entscheiden, die C/C++-Funktionen zu testen. Rufen Sie hierzu von der IDE aus den NetBeans Plugin Manager auf (w&auml;hlen Sie Tools &gt; Plugins) und f&uuml;gen Sie das C/C++-Paket in die vorhandene Installation ein.</p>
<p>Es gibt mehrere wichtige Hinweise zur Installation und Konfiguration einiger NetBeans IDE-Merkmale: </p>
<ol>
  <li>Apache Tomcat 6.0.20 ist in den Download-Optionen &quot;Java&quot; und &quot;All&quot; enthalten. Diese Option wird jedoch nicht standardm&auml;&szlig;ig installiert. Wenn Sie Apache Tomcat beim Herunterladen von Java oder &quot;Alle&quot; installieren m&ouml;chten, starten Sie das Installationsprogramm, und w&auml;hlen Sie im Dialogfeld zur Anpassung der Installation Apache Tomcat 6.0.20 aus.</li>

  <li>F&uuml;r die Entwicklung mit C/C++ (f&uuml;r die Downloads C/C++ und &quot;Alle&quot;) m&uuml;ssen Sie au&szlig;erdem Compiler und Tools installieren. Weitere Informationen finden Sie unter <a
  href="cpp-setup-instructions.html">Konfigurieren von NetBeans IDE f&uuml;r C/C++/Fortran</a>. </li>
  <li>Unter Mac OS X k&ouml;nnen Sie die NetBeans IDE-Installation &uuml;ber die Downloads Java, Ruby und &quot;Alle&quot; anpassen. Die IDE-Installation &uuml;ber die Downloads JavaSE, PHP und C/C++ kann nicht angepasst werden. </li>
  <li><span class="style2">Dar&uuml;ber hinaus k&ouml;nnen Sie eine <a href="#install_zip">plattformunabh&auml;ngige Zip-Datei</a> herunterladen und die ausf&uuml;hrbare NetBeans IDE starten. </span>Beachten Sie, dass Laufzeitdateien wie GlassFish-Anwendungs-Server und Apache Tomcat nur zusammen mit plattformspezifischen Installationsprogrammen zur Verf&uuml;gung stehen. </li>
</ol>
<p align="center"><a href="#top">Oben</a></p>
<h2><a name="startdownload" id="startdownload"></a>Starten des Herunterladens</h2>

<ol>
<li>Rufen Sie die NetBeans IDE-<a href="https://netbeans.org/downloads/6.8/index.html?pagelang=de" target="_blank">Download-Seite</a> auf.</li>
<li>W&auml;hlen Sie im Listenfeld rechts oben auf der Seite die Sprache und die Plattform aus. Sie k&ouml;nnen auch die plattformunabh&auml;ngige ZIP-Datei herunterladen und verwenden. </li>
<li>Klicken Sie auf die Schaltfl&auml;che zum Herunterladen der gew&uuml;nschten Option.</li>
<li>Speichern Sie die Installationsdatei in Ihrem System.</li>
</ol>
<p align="center"><a href="#top">Oben</a></p>
<h2><a name="installation"></a>Installieren der Software</h2>

<p>Befolgen Sie die Anweisungen in diesem Abschnitt, um die IDE auf Ihrem System zu installieren. Diese Installationsanweisungen gelten f&uuml;r alle unterst&uuml;tzten Plattformen. Eine Liste der unterst&uuml;tzten Plattformen finden Sie in den <a href="relnotes_de.html">Versionshinweisen</a>. </p>
<h3><a name="install_windows" id="install_windows">Microsoft Windows, Solaris OS und Linux</a></h3>
<p><b>So installieren Sie die Software:</b></p>
<ol>
<li>Starten Sie nach Abschluss des Herunterladens das Installationsprogramm. 
<ul>
<li>Bei Windows hat dieses Programm die Erweiterung <tt>.exe</tt>. Doppelklicken Sie auf das Installationsprogramm, um dieses auszuf&uuml;hren. </li>

<li>Bei Solaris und Linux hat das Installationsprogramm die Erweiterung <tt>.sh</tt>. Bei diesen Plattformen m&uuml;ssen Sie die Installationsdateien ausf&uuml;hrbar machen, indem Sie den folgenden Befehl eingeben: <tt> chmod +x &lt;<i>Name der Installationsdatei</i>&gt;</tt></li>
</ul>
</li>
<li>F&uuml;hren Sie auf der Begr&uuml;&szlig;ungsseite des Installationsassistenten die folgenden Schritte aus, um die zu installierenden Laufzeitdateien und Tools auszuw&auml;hlen:
  <ol type="a">
<li>Klicken Sie auf &quot;Anpassen&quot;.</li>
<li>Treffen Sie im Dialogfeld zur Anpassung der Installation die gew&uuml;nschte Auswahl.</li>
<li>Klicken Sie auf &quot;OK&quot;.</li>
</ol>
</li>
<li>Klicken Sie auf der Begr&uuml;&szlig;ungsseite des Installationsassistenten auf &quot;Weiter&quot;.</li>
<li>Pr&uuml;fen Sie auf der Seite der Lizenzvereinbarung die Bedingungen, w&auml;hlen Sie die Option zum Akzeptieren der Bedingungen aus, und klicken Sie auf &quot;Weiter&quot;.</li>
<li>Gehen Sie auf der Seite zur NetBeans IDE-Installation wie folgt vor:
<ol type="a">
<li>Akzeptieren Sie das standardm&auml;&szlig;ige Installationsverzeichnis f&uuml;r die NetBeans-IDE oder geben Sie ein anderes Verzeichnis an. <b>Hinweis:</b> Das Installationsverzeichnis muss leer sein und die Benutzerprofile, die Sie zur Ausf&uuml;hrung des Installationsprogramms verwenden werden, m&uuml;ssen &uuml;ber die Schreib- und Leseberechtigung f&uuml;r dieses Verzeichnis verf&uuml;gen.</li>
<li>Akzeptieren Sie die standardm&auml;&szlig;ige JDK-Installation f&uuml;r die NetBeans-IDE oder w&auml;hlen Sie im Listenfeld eine andere Installation aus. Konnte der Installationsassistent keine kompatible JDK-Installation f&uuml;r die NetBeans-IDE finden, wird das JDK nicht am Standardort installiert. Geben Sie in diesem Fall den Pfad zu einem installierten JDK an oder brechen Sie die aktuelle Installation ab. Installieren Sie dann die erforderliche JDK-Version und starten Sie diese Installation erneut.</li>
<li>Klicken Sie auf &quot;Weiter&quot;</li>
</ol>
<li>Wird die Seite zur GlassFish v3-Installation ge&ouml;ffnet, akzeptieren Sie das standardm&auml;&szlig;ige Installationsverzeichnis oder geben Sie einen anderen Installationsort an.</li>
<li>Wenn Sie Apache Tomcat installieren, akzeptieren Sie auf dessen Installationsseite das standardm&auml;&szlig;ige Installationsverzeichnis oder geben Sie einen anderen Installationsort an. </li>
<li>Pr&uuml;fen Sie auf der Zusammenfassungsseite, ob die Liste der zu installierenden Komponenten korrekt ist und ob Sie &uuml;ber angemessenen Speicherplatz auf Ihrem System verf&uuml;gen.</li>
<li>Klicken Sie auf &quot;Installieren&quot;, um mit der Installation zu beginnen.</li>
<p class="notes"><b>Hinweis:</b> Kann die Installation aufgrund von Problemen nicht erfolgreich abgeschlossen werden, finden Sie im Abschnitt <a href="#troubleshooting">Fehlerbehebung</a> Beschreibungen und empfohlene Abhilfema&szlig;nahmen f&uuml;r nicht behobene Probleme, die die Installation beeintr&auml;chtigen k&ouml;nnen. </p>
<h3><a name="install_mac" id="install_mac">Mac OS X</a></h3>
<p><b>So installieren Sie die Software:</b></p>
<ol>
  <li>Starten Sie nach Abschluss des Herunterladens das Installationsprogramm. Die Installationsdatei hat die Erweiterung <tt>.dmg</tt>. </li>
  <li>Klicken Sie im neu ge&ouml;ffneten Fenster auf das Paketsymbol. Das Paket hat die Erweiterung  <tt>.mpkg</tt>. Der Installationsassistent wird gestartet.</li>
  <li>Klicken Sie auf der Begr&uuml;&szlig;ungsseite des Installationsassistenten auf &quot;Weiter&quot;.</li>
  <li>Pr&uuml;fen Sie die Lizenzvereinbarung, und klicken Sie auf &quot;Weiter&quot;. Klicken Sie im Popup-Fenster auf &quot;Akzeptieren&quot;, um die Lizenz zu akzeptieren.</li>
  <li>W&auml;hlen Sie auf der Seite zum Ausw&auml;hlen eines Ziels ein Laufwerk aus, und klicken Sie auf &quot;Weiter&quot;. </li>
  <li>Wenn Sie das Paket &quot;Alle&quot;, &quot;Java&quot; oder &quot;Ruby&quot; heruntergeladen haben, k&ouml;nnen Sie Ihre Installation abbrechen. Klicken Sie im letzten Fenster des Installationsassistenten links auf die Schaltfl&auml;che &quot;Anpassen&quot;. Ein Produktbaum wird angezeigt.  </li>
  <li>W&auml;hlen Sie die zu installierenden Produkte aus.</li>
  <li>Geben Sie den Namen und das Kennwort des Administrators Ihres Systems ein und klicken Sie auf &quot;OK&quot;, um mit der Installation zu beginnen.</li>
</ol>

<h3><a name="install_zip" id="install_zip">Plattformunabh&auml;ngiges Paket</a></h3>
<p><b>So f&uuml;hren Sie die Software aus:</b></p>
<ol>
  <li>Haben Sie die plattformunabh&auml;ngige ZIP-Datei heruntergeladen, entpacken Sie diese in einem Ordner auf Ihrem System. </li>
  <li>Starten Sie die ausf&uuml;hrbare Datei im Verzeichnis <tt>netbeans/bin</tt>. </li>
  <li>Akzeptieren Sie die Lizenzvereinbarung. Die NetBeans-IDE wird gestartet.  </li>
</ol>
<p><span class="notes"><b>Hinweis:</b> Beachten Sie, dass Laufzeitdateien, wie GlassFish-Anwendungs-Server und Apache Tomcat nur zusammen mit plattformspezifischen Installationsprogrammen zur Verf&uuml;gung stehen.</span></p>
<p><span class="notes"><b>Hinweis:</b> Kann die kompatible JDK-Installation nicht gefunden werden, m&uuml;ssen Sie ggf. den Pfad zum JDK-Installationsverzeichnis manuell hinzuf&uuml;gen:</span></p>
<ol>
  <li>&Ouml;ffnen Sie die Datei <tt>netbeans.conf</tt> im Ordner <tt>netbeans/etc</tt> mit einem Texteditor.</li>
  <li>Geben Sie den Pfad der kompatiblen JDK-Installation als Wert der Option <tt>netbeans_jdkhome</tt> ein.</li>
  <li>Speichern Sie die Datei <tt>netbeans.conf</tt> und starten Sie die ausf&uuml;hrbare Datei unter <tt>netbeans/bin</tt>.</li>
</ol>
<p align="center"><a href="#top">Oben</a></p>
<h2><a name="uninstallation">Deinstallieren der Software</a></h2>
<div>
<h3><a name="uninstall_windows">Microsoft Windows</a></h3>
<p>Bei Bedarf k&ouml;nnen Sie die NetBeans-IDE, GlassFish v3 und Apache Tomcat mit den folgenden Verfahren starten:</p>
<p><b>So deinstallieren Sie die IDE</b>:</p>
<ol>
  <li>Fahren Sie die IDE herunter.
  </li>
  <li>W&auml;hlen Sie in der Systemsteuerung die Option &quot;Software&quot; aus. W&auml;hlen Sie dann NetBeans IDE 6.8 und klicken Sie auf &quot;Entfernen&quot;:</li>
</ol>
<p><b>So deinstallieren Sie GlassFish v3: </b></p>
<ol>
  <li>Fahren Sie die IDE herunter.</li>
  <li>W&auml;hlen Sie in der Systemsteuerung die Option &quot;Software&quot; aus. W&auml;hlen Sie dann GlassFish v3 aus, und klicken Sie auf &quot;Entfernen&quot;.</li>
</ol>
<p><b>So deinstallieren Sie Apache Tomcat: </b></p>

<ol>
  <li>Fahren Sie die IDE herunter.</li>
  <li>W&auml;hlen Sie in der Systemsteuerung die Option &quot;Software&quot; aus. W&auml;hlen Sie dann Apache Tomcat 6.0.20 aus, und klicken Sie auf &quot;Entfernen&quot;.</li>
</ol>
</div>
<div>
<h3><a name="uninstall_sollinux">Solaris OS, Linux</a></h3>
<p>Bei Bedarf k&ouml;nnen Sie die NetBeans-IDE, GlassFish v3 und Apache Tomcat mit den folgenden Verfahren starten:</p>
<p><b>So deinstallieren Sie die IDE</b>:</p>

<ol>
  <li>Fahren Sie die IDE herunter.</li>
  <li>Starten Sie im Installationsverzeichnis der IDE die Datei <tt>uninstall.sh</tt>. </li>
  <li>Wenn Sie GlassFish/Tomcat zusammen mit der IDE deinstallieren m&ouml;chten, stellen Sie sicher, dass Sie auf der &Uuml;bersichtsseite die richtigen Versionen sehen. W&auml;hlen Sie au&szlig;erdem die richtigen Optionen aus. </li>
  <li>Klicken Sie auf der &Uuml;bersichtsseite auf &quot;Deinstallieren&quot;. 
  </li>
  <li>Klicken Sie nach Abschluss der Deinstallation auf &quot;Fertigstellen&quot;.</li>
</ol>
<p><b>So deinstallieren Sie GlassFish v3 </b>:</p>
<ol>
  <li>Fahren Sie die IDE herunter.</li>
  <li>Suchen Sie nach dem Installationsverzeichnis des Anwendungs-Servers.
  <p><b>Hinweis:</b> Der standardm&auml;&szlig;ige Installationspfad variiert je nach Art der Installation und der Plattform. In der folgenden Tabelle werden die standardm&auml;&szlig;igen Installationsverzeichnisse f&uuml;r den Anwendungs-Server auf verschiedenen Plattformen angegeben.</p>

  <table>
    <tbody>
        <tr class="tblheader">
            <th width="70">Plattform</th>
            <th width="101">Installieren als...</th>
			<th width="264">GlassFish v3-Installation</th>
        </tr>
        <tr class="tbltd0">
          <td>Windows</td>
          <td>Benutzer mit Administratorrechten</td>
          <td><tt>%ProgramFiles%\glassfish-v3</tt></td>
        </tr>
        <tr class="tbltd0">
          <td>Windows</td>
          <td>Benutzer</td>
          <td><tt>%USERPROFILE%\glassfish-v3</tt></td>
        </tr>
        <tr class="tbltd0">
            <td>Solaris&nbsp;OS&nbsp;</td>
            <td>root</td>
			 <td><tt>/opt/glassfish-v3</tt></td>
        </tr>
        <tr class="tbltd1">

            <td>Solaris&nbsp;OS, Linux</td>
            <td valign="top">Benutzer</td>
			<td valign="top"><tt>~/glassfish-v3</tt></td>
        </tr>
        <tr class="tbltd0">
            <td>Linux</td>
            <td>root</td>
			<td><tt>/usr/local/glassfish-v3</tt></td>
        </tr>
    </tbody>
</table>
  </li>
  <li>Starten Sie im Installationsverzeichnis des Anwendungs-Servers die Datei <tt>uninstall.sh</tt>.</li>

  <li>Klicken Sie auf der &Uuml;bersichtsseite auf &quot;Deinstallieren&quot;.
  </li>
  <li>Klicken Sie nach Abschluss der Deinstallation auf &quot;Fertigstellen&quot;.</li>
</ol>
<p><b>So deinstallieren Sie Apache Tomcat: </b></p>
<ol>
  <li>Fahren Sie die IDE herunter.</li>

  <li>Suchen Sie nach dem Installationsverzeichnis von Apache Tomcat und starten Sie die Datei <tt>uninstall.sh</tt>. 
  </li>
  <li>Klicken Sie auf der &Uuml;bersichtsseite auf &quot;Deinstallieren&quot;. </li>
  <li>Klicken Sie nach Abschluss der Deinstallation auf &quot;Fertig stellen&quot;.</li>
</ol>
</div>
<div>

<h3><a name="uninstall_mac" id="uninstall_mac">Mac OS X</a></h3>
<p><b>So deinstallieren Sie die IDE und den Anwendungs-Server:</b></p>
<ol>
  <li>Fahren Sie die Software herunter.</li>
  <li>Ziehen Sie die Programmordner oder die Dateien auf den Papierkorb. Beachten Sie, dass der standardm&auml;&szlig;ige Installationspfad f&uuml;r die IDE und den Anwendungs-Server <tt>/Applications/NetBeans/</tt> lautet.  </li>
</ol>
</div>
<div>

<h3><a name="uninstall_zip" id="uninstall_zip">Plattformunabh&auml;ngiges Paket</a></h3>
<p>Wenn Sie die IDE-Dateien deinstallieren m&ouml;chten, befolgen Sie die Anweisungen im Abschnitt <a href="#clean">Aufr&auml;umen nach unvollst&auml;ndigen Installationen</a> in diesem Dokument. </p>
</div>
<p align="center"><a href="#top">Oben</a></p>
<h2><a name="upgrading"></a>Aktualisieren und Koexistenz mit fr&uuml;heren Versionen</h2>
<p>NetBeans IDE 5.x, 6.0, 6.1, 6.5 und 6.7 k&ouml;nnen zusammen mit NetBeans IDE 6.8 auf dem gleichen System installiert werden. Sie m&uuml;ssen die fr&uuml;heren Versionen nicht deinstallieren, um NetBeans IDE 6.8 installieren oder ausf&uuml;hren zu k&ouml;nnen. </p>
<p>Haben Sie NetBeans IDE 5.x, 6.0, 6.1, 6.5 oder 6.7 installiert, k&ouml;nnen Sie ausw&auml;hlen, ob die Benutzereinstellungen aus dem vorhandenen Verzeichnis importiert werden sollen, wenn Sie NetBeans IDE 6.8 zum ersten Mal ausf&uuml;hren.</p>
<p align="center"><a href="#top">Oben</a></p>
<h2><a name="troubleshooting" id="troubleshooting"></a>Fehlerbehebung</h2>
<div>
<h3>Informationen zum Arbeitsverzeichnis des Installationsprogramms</h3>
<p>Das Installationsprogramm speichert Daten zu den Installationssitzungen in seinem Arbeitsverzeichnis. Beispiele zu diesen Daten sind z. B. die Liste der auf Ihrem System installierten Komponenten, Installationsprotokolle und Registrierungsdateien. </p>

<p>Der Standardpfad f&uuml;r das Installations-Arbeitsverzeichnis lautet <tt>%USERPROFILE%\.nbi</tt> f&uuml;r Windows und <tt>~/.nbi</tt> f&uuml;r andere Plattformen. Das Protokoll-Unterverzeichnis enth&auml;lt die Protokolldateien der Installation. </p>
</div>
<div>
<h3><a name="clean"></a>Aufr&auml;umen nach unvollst&auml;ndigen Installationen</h3>
<p>Nach einer unvollst&auml;ndigen oder nicht erfolgreichen Installation m&uuml;ssen Sie ggf. fr&uuml;here Installationen von Ihrem System entfernen. </p>
<p><b>F&uuml;r Microsoft Windows, Solaris OS und Linux:</b></p>
<ol>

  <li>L&ouml;schen Sie das Arbeitsverzeichnis des Installationsprogramms.</li>
  <li>L&ouml;schen Sie die Installationsverzeichnisse der IDE und des GlassFish-Anwendungs-Servers.</li>
  <li>L&ouml;schen Sie auf der Windows-Plattform alle <tt>nbi*</tt>-Registrierungseintr&auml;ge aus den folgenden Registrierungsschl&uuml;sseln: <tt>HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall</tt> <tt>HKEY_CURRENT_USER\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall</tt> </li>

</ol>
<p><b>F&uuml;r Mac OS X:</b></p>
<ul>
  <li>Ziehen Sie die Programmordner oder die Dateien auf den Papierkorb. </li>
</ul>
</div>
<div>
<h3>Deaktivieren bestimmter Software vor der Installation</h3>
<p>Es wird empfohlen, Firewall-, Virenschutz- und &Uuml;berwachungsanwendungen vor der Installation zu deaktivieren. Einige dieser Anwendungen k&ouml;nnen verhindern, dass IDE-Komponenten w&auml;hrend der Installation korrekt konfiguriert werden. </p>
<p>Wird auf Ihrem System z. B. die Anwendung Logitech Process Monitor <tt>LVPrcSrv.exe</tt>) ausgef&uuml;hrt, deaktivieren Sie diese vor der Installation. </p>

</div>
<p align="center"><a href="#top">Oben</a></p>
<h2><a name="moreinformation"></a>Weitere Informationen</h2>

<ul>
<li><a href="index_de.html">NetBeans IDE 6.8 &ndash; Versionsinformationen</a></li>
<li><a href="relnotes_de.html">NetBeans IDE 6.8  &ndash; Versionshinweise</a></li>
<li><a href="http://download.netbeans.org/netbeans/6.8/">NetBeans IDE &ndash; Download-Seite</a></li>
<li><a href="http://wiki.netbeans.org/NetBeansUserFAQ#Installation" target="_blank">NetBeans IDE &ndash; Fragen zur Installation</a></li>
</ul>
<hr class="light">
<div class="feedback-box"><a href="https://netbeans.org/about/contact_form.html?to=3&subject=Feedback: NetBeans IDE 6.8 Installation Instructions">Senden Sie uns Ihr Feedback</a></div>
<br style="clear:both;">
<p align="center"><a href="#top">Oben</a></p>
</body>
</html>
