<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<!--
  Copyright 2009 Sun Microsystems, Inc. 
  All Rights Reserved.
-->

<html>
<head>
<link rel="stylesheet" type="text/css" href="../../../netbeans.css">
<link rel="stylesheet" type="text/css" media="print" href="../../../print.css">
<link rel="shortcut icon" href="https://netbeans.org/favicon.ico" type="image/x-icon" >
<title>Instrucciones de instalaci&oacute;n de NetBeans IDE 6.8 </title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" >
<meta name="description" content="Installation instructions for  NetBeans IDE 6.8">
<meta name="keywords" content="NetBeans, IDE, free, open source, install notes, developer, installer, NetBeans, NetBeans IDE, NetBeans installer, NetBeans development environment" >
<style type="text/css">
<!--
.style2 {color: #000000}
-->
</style>
</head>
<body>
<a name="top"></a>
<h1>Instrucciones de instalaci&oacute;n de NetBeans IDE 6.8 </h1>
<div class="articledate" style="margin-left: 0px;">&Uacute;ltima actualizaci&oacute;n: <!-- #BeginDate format:Am1 -->7 de diciembre de 2009 <!-- #EndDate --> </div>
<p>Este documento describe c&oacute;mo instalar NetBeans IDE 6.8 en el sistema. Consulte las Notas de la versi&oacute;n de IDE de NetBeans 6.8 para obtener informaci&oacute;n sobre <a href="relnotes.html#system_requirements">los sistemas operativos y configuraciones de hardware compatibles</a> con el IDE. Para obtener informaci&oacute;n sobre las nuevas funciones incluidas en esta versi&oacute;n del IDE, consulte la p&aacute;ginas <a href="index_es.html">Informaci&oacute;n de la versi&oacute;n de NetBeans IDE 6.8 </a>.</p>

<p><b>Contenido</b></p>
<ul>
<li><a href="#requiredsoftware" title="Requisitos de software">Requisitos de software</a></li>
<li><a href="#downloadoptions" title="Opciones de descarga del instalador">Opciones de descarga del instalador</a></li>
<li><a href="#customizeinstall" title="Personalizaci&oacute;n de la instalaci&oacute;n">Personalizaci&oacute;n de la instalaci&oacute;n</a></li>
<li><a href="#startdownload" title="Inicio de la descarga">Inicio de la descarga</a></li>
<li><a href="#installation" title="Instalaci&oacute;n del software">Instalaci&oacute;n del software</a><div>
<ul>
<li><a href="#install_windows">Microsoft Windows, Solaris OS y Linux</a></li>
<li><a href="#install_mac">Mac OS X</a> </li>
<li><a href="#install_zip">Paquete independiente de la plataforma</a> </li>
</ul>
</div></li>
<li><a href="#uninstallation" title="Desinstalaci&oacute;n del software">Desinstalaci&oacute;n del software</a></li>
<li><a href="#upgrading">Actualizaci&oacute;n y coexistencia con versiones anteriores</a> </li>
<li><a href="#troubleshooting" title="Resoluci&oacute;n de problemas">Resoluci&oacute;n de</a><a href="#troubleshooting" title="Resoluci&oacute;n de problemas">problemas</a></li>
<li><a href="#moreinformation" title="M&aacute;s informaci&oacute;n">M&aacute;s in</a><a href="#moreinformation" title="M&aacute;s informaci&oacute;n">formaci&oacute;n</a></li>
</ul>
<h2><a name="requiredsoftware" id="requiredsoftware"></a>Requisitos de software</h2>
<p>Antes de instalar el IDE, debe tener instalado en el sistema la <span class="style2">actualizaci&oacute;n 19 de Java SE Development Kit (JDK) (versi&oacute;n 1.5.0_19) o la actualizaci&oacute;n 14 de JDK 6</span> o posterior. Si no tiene una instalaci&oacute;n de JDK, no puede continuar con la instalaci&oacute;n. Puede descargar la versi&oacute;n m&aacute;s reciente de JDK en <a href="http://java.sun.com/javase/downloads/index.jsp" target="_blank">http://java.sun.com/javase/downloads</a>.
<p>Para las opciones de descarga de PHP, Ruby y C/C++ puede instalar JRE en lugar de JDK. Sin embargo, si piensa usar cualquiera de las funciones de Java, necesitar&aacute; JDK. </p>
<p align="center"><a href="#top">inicio</a></p>
<h2><a name="downloadoptions" id="downloadoptions"></a>Opciones de descarga del instalador</h2>
<p>En <a href="https://netbeans.org/downloads/6.8/index.html?pagelang=es" target="_blank">la p&aacute;gina de descarga</a> de NetBeans IDE puede obtener uno de los diversos instaladores, cada uno de los cuales contiene el IDE b&aacute;sico y herramientas adicionales.  </p>
<p>Los siguientes instaladores est&aacute;n disponibles:  </p>
<ul>
<li><b>Java</b>. Proporciona herramientas para desarrollar aplicaciones de Java SE, Java EE y Java ME. Esta opci&oacute;n de descarga tambi&eacute;n incluye el software GlassFish v3 y Apache Tomcat 6.0.20. </li>
<li><b>JavaFX</b>. Proporciona compatibilidad para el desarrollo de aplicaciones multiplataforma de JavaFX. </li>
<li><b>Java SE</b>. Proporciona todas las caracter&iacute;sticas est&aacute;ndar para el desarrollo de Java SE. Tambi&eacute;n se incluye la compatibilidad con el desarrollo de RCP de la plataforma NetBeans.</li>
<li><b>Ruby</b>. Proporciona herramientas para el desarrollo de Ruby y es compatible con Rails y JRuby. Tambi&eacute;n contiene GlassFish v3.</li>
<li><b>PHP</b>. Proporciona herramientas para el desarrollo de PHP.</li>
<li><b>C/C++</b>. Es compatible con el desarrollo en los lenguajes C, C++, Qt, Fortran y Assembly. </li>

<li><b>All (Todo). </b> Es una opci&oacute;n de descarga completa que contiene todos los tiempos de ejecuci&oacute;n y los paquetes disponibles para NetBeans IDE.  </li>
</ul>
<p align="center"><a href="#top">inicio</a></p>
<h2><a name="customizeinstall"></a>Personalizaci&oacute;n de la instalaci&oacute;n</h2>
<p>Si realiza la descarga mediante las opciones Java o &quot;All&quot; (Todo), puede seleccionar qu&eacute; herramientas y tiempos de ejecuci&oacute;n que desea instalar. Haga clic en Personalizar en la p&aacute;gina de bienvenida del instalador y seleccione las caracter&iacute;sticas que desee usar. Para obtener m&aacute;s informaci&oacute;n, consulte <a href="#installation" title="Instalaci&oacute;n del software">Instalaci&oacute;n del software</a>.</p>
<p>Si desea agregar funciones a la configuraci&oacute;n del NetBeans IDE, utilice NetBeans Plugin Manager. Por ejemplo, suponga que descarga e instala el paquete de Ruby. A continuaci&oacute;n, decide que desea probar las funciones de C/C++. Para ello, hay que acceder a NetBeans Plugin Manager desde el IDE (seleccione Herramientas &gt; Plugins) y agregar el paquete C/C++ a la instalaci&oacute;n existente. </p>
<p>Hay varias notas importantes sobre la instalaci&oacute;n y la configuraci&oacute;n de algunas funciones de NetBeans IDE: </p>
<ol>
  <li>Apache Tomcat 6.0.20 se incluye en las opciones de descarga &quot;Java&quot; y &quot;All&quot; (Todo), pero no se instala de forma predeterminada con ninguna de ellas. Para instalar Apache Tomcat a partir de estas descargas, inicie el instalador y seleccione Apache Tomcat 6.0.20 en el cuadro de di&aacute;logo Personalizar la instalaci&oacute;n.</li>

  <li>Para el desarrollo de C/C++, aplicable a los tipos de descarga &quot;C/C++&quot; y &quot;All&quot; (Todo), deber&aacute; instalar adem&aacute;s compiladores y herramientas. Para obtener m&aacute;s informaci&oacute;n, consulte <a
  href="cpp-setup-instructions.html">Configuraci&oacute;n de NetBeans IDE para C/C++/Fortran</a>.  </li>
  <li>En Mac OS X, puede personalizar la instalaci&oacute;n de NetBeans IDE en las opciones de descarga de Java, Ruby, y &quot;All&quot; (Todo). Esta posibilidad no est&aacute; disponible en las descargas JavaSE, PHP y C/C++. </li>
  <li><span class="style2">Tambi&eacute;n puede descargar <a href="#install_zip">un archivo comprimido independiente de la plataforma</a> y ejecutar el archivo ejecutable de NetBeans IDE. </span>Tenga en cuenta que los tiempos de ejecuci&oacute;n, como los servidores de aplicaciones de GlassFish y Apache Tomcat, s&oacute;lo est&aacute;n disponibles con instaladores para plataformas espec&iacute;ficas. </li>
</ol>
<p align="center"><a href="#top">inicio</a></p>
<h2><a name="startdownload" id="startdownload"></a>Inicio de la descarga </h2>

<ol>
<li>Vaya a la <a href="https://netbeans.org/downloads/6.8/index.html?pagelang=es" target="_blank">p&aacute;gina de descargas</a> de NetBeans IDE.</li>
<li>En la parte superior derecha de la p&aacute;gina, seleccione el idioma y la plataforma en la lista desplegable. Tambi&eacute;n puede optar por descargar y utilizar el archivo zip independiente de la plataforma. </li>
<li>Haga clic en el bot&oacute;n Download (Descargar) de la opci&oacute;n de descarga que desee instalar.</li>
<li>Guarde el archivo del instalador en el sistema. </li>
</ol>
<p align="center"><a href="#top">inicio</a></p>
<h2><a name="installation"></a>Instalaci&oacute;n del software</h2>

<p>Siga las instrucciones que aparecen en esta secci&oacute;n para instalar el IDE en el sistema. Estas instrucciones de instalaci&oacute;n se aplican a todas las plataformas compatibles. Para obtener la lista de las plataformas compatibles, consulte las <a href="relnotes_es.html">notas de la versi&oacute;n</a>. </p>
<h3><a name="install_windows" id="install_windows">Microsoft Windows, Solaris OS y Linux</a></h3>
<p><b>Para instalar el software:</b></p>
<ol>
<li>Una vez finalizada la descarga, ejecute el instalador. 
<ul>
<li>El archivo del instalador de Windows tiene la extensi&oacute;n <tt>.exe</tt>. Haga doble clic en &eacute;l para ejecutarlo. </li>

<li>El archivo del instalador de las plataformas Solaris y Linux tiene la extensi&oacute;n <tt>.sh</tt>. En estas plataformas debe convertir los archivos del instalador en ejecutables mediante el siguiente comando: <tt> chmod +x &lt;<i>nombre-archivo-instalador</i>&gt;</tt></li>
</ul>
</li>
<li>Para seleccionar las herramientas y tiempos de ejecuci&oacute;n que se van a instalar, siga estos pasos en la p&aacute;gina de bienvenida del asistente de instalaci&oacute;n:
  <ol type="a">
<li>Haga clic en Personalizar.</li>
<li>En el cuadro de di&aacute;logo Personalizar la instalaci&oacute;n, realice las selecciones.</li>
<li>Haga clic en Aceptar. </li>
</ol>
</li>
<li>En la p&aacute;gina de bienvenida del asistente para la instalaci&oacute;n, haga clic en Siguiente.</li>
<li>En la p&aacute;gina del contrato de licencia, revise el contrato, marque la casilla de aceptaci&oacute;n y haga clic en Siguiente.</li>
<li>En la p&aacute;gina de instalaci&oacute;n de NetBeans IDE, siga estos pasos: 
<ol type="a">
<li>Acepte el directorio de instalaci&oacute;n predeterminado de NetBeans IDE o especifique otro directorio. <b>Nota:</b> el directorio de instalaci&oacute;n debe estar vac&iacute;o y el perfil de usuario que utilice para ejecutar el instalador debe disponer de permisos de lectura/escritura en dicho directorio.</li>
<li>Acepte la instalaci&oacute;n de JDK predeterminada para usarlo con NetBeans IDE o seleccione una instalaci&oacute;n diferente en la lista desplegable. Si el asistente de instalaci&oacute;n no encuentra una instalaci&oacute;n de JDK compatible para usar con NetBeans IDE, no se instalar&aacute; en la ubicaci&oacute;n predeterminada. En este caso, especifique la ruta de un JDK instalado o cancele la instalaci&oacute;n actual, instale la versi&oacute;n de JDK requerida y reinicie esta instalaci&oacute;n.</li>
<li>Haga clic en Siguiente.</li>
</ol>
<li>Si se abre la p&aacute;gina de instalaci&oacute;n de GlassFish v3, acepte el directorio de instalaci&oacute;n predeterminado o especifique otra ubicaci&oacute;n para la instalaci&oacute;n.</li>
<li>Si va a instalar Apache Tomcat: en la p&aacute;gina de instalaci&oacute;n, acepte el directorio de instalaci&oacute;n predeterminado o especifique otra ubicaci&oacute;n para la instalaci&oacute;n. </li>
<li>En la p&aacute;gina de resumen, compruebe que la lista de componentes que se van a instalar es correcta y que dispone de espacio suficiente en el sistema para la instalaci&oacute;n.</li>
<li>Haga clic en Instalar para comenzar la instalaci&oacute;n.</li>
<p class="notes"><b>Nota:</b> si surgen problemas para instalar el software correctamente, consulte <a href="#troubleshooting">Resoluci&oacute;n de problemas</a> para obtener descripciones y sugerencias para solucionar problemas no resueltos que pueden afectar al proceso de instalaci&oacute;n. </p>
<h3><a name="install_mac" id="install_mac">Mac OS X</a></h3>
<p><b>Para instalar el software:</b></p>
<ol>
  <li>Una vez finalizada la descarga, ejecute el instalador. La extensi&oacute;n del archivo del instalador es <tt>.dmg</tt>. </li>
  <li>En los paneles que se abren, haga clic en el icono del paquete. La extensi&oacute;n del paquete es <tt>.mpkg</tt>. El asistente de instalaci&oacute;n comienza.</li>
  <li>En la p&aacute;gina de bienvenida del asistente para la instalaci&oacute;n, haga clic en Continuar.</li>
  <li>Revise el contrato de licencia y haga clic en Continuar. Haga clic en Aceptar en la ventana emergente para aceptar la licencia.</li>
  <li>En la p&aacute;gina de selecci&oacute;n de destino, elija la unidad y haga clic en Continuar. </li>
  <li>Si ha descargado los paquetes de &quot;All&quot; (Todo), Java o Ruby, puede personalizar la instalaci&oacute;n. En el &uacute;ltimo panel del asistente de instalaci&oacute;n, pulse el bot&oacute;n Personalizar de la parte inferior izquierda del panel. Aparece el &aacute;rbol de productos.  </li>
  <li>Seleccione los productos que desea instalar.</li>
  <li>Especifique el nombre y la contrase&ntilde;a del administrador del sistema y haga clic en Aceptar para comenzar la instalaci&oacute;n.</li>
</ol>

<h3><a name="install_zip" id="install_zip">Paquete independiente de la plataforma</a></h3>
<p><b>Para ejecutar el software:</b></p>
<ol>
  <li>Cuando finalice la descarga del archivo ZIP independiente de la plataforma, extr&aacute;igalo a cualquier carpeta del sistema. </li>
  <li>Ejecute el archivo ejecutable ubicado en el directorio <tt>netbeans/bin</tt>. </li>
  <li>Acepte el contrato de licencia. NetBeans IDE se inicia.  </li>
</ol>
<p><span class="notes"><b>Nota:</b> tenga en cuenta que los tiempos de ejecuci&oacute;n, como el servidor de aplicaciones de GlassFish y Apache Tomcat, s&oacute;lo est&aacute;n disponibles con instaladores para plataformas espec&iacute;ficas.</span></p>
<p><span class="notes"><b>Nota:</b> si no puede encontrar la instalaci&oacute;n de JDK compatible, quiz&aacute; deba agregar la ruta del directorio de instalaci&oacute;n de JDK de forma manual:</span></p>
<ol>
  <li>Abra el archivo <tt>netbeans.conf</tt> que se encuentra en <tt>netbeans/etc</tt> en un editor de texto.</li>
  <li>Introduzca la ubicaci&oacute;n de la instalaci&oacute;n de JDK compatible como valor de la opci&oacute;n <tt>netbeans_jdkhome</tt>.</li>
  <li>Guarde el archivo <tt>netbeans.conf</tt> y ejecute el archivo ejecutable de <tt>netbeans/bin</tt>.</li>
</ol>
<p align="center"><a href="#top">inicio</a></p>
<h2><a name="uninstallation">Desinstalaci&oacute;n del software</a></h2>
<div>
<h3><a name="uninstall_windows">Microsoft Windows</a></h3>
<p>Si es necesario, puede desinstalar NetBeans IDE, GlassFish v3 y Apache Tomcat mediante los siguientes procedimientos.</p>
<p><b>Para desinstalar el IDE</b>:</p>
<ol>
  <li>Ci&eacute;rrelo.
  </li>
  <li>En el Panel de control, seleccione Agregar o quitar programas, NetBeans IDE 6.8 y haga clic en Quitar.</li>
</ol>
<p><b>Para desinstalar GlassFish v3: </b></p>
<ol>
  <li>Cierre el IDE.</li>
  <li>En el Panel de control, seleccione Agregar o quitar programas, GlassFish v3 y haga clic en Quitar.</li>
</ol>
<p><b>Para desinstalar Apache Tomcat: </b></p>

<ol>
  <li>Cierre el IDE.</li>
  <li>En el Panel de control, seleccione Agregar o quitar programas, Apache Tomcat 6.0.20 y haga clic en Quitar. </li>
</ol>
</div>
<div>
<h3><a name="uninstall_sollinux">Solaris OS, Linux</a></h3>
<p>Si es necesario, puede desinstalar NetBeans IDE, GlassFish v3 y Apache Tomcat mediante los siguientes procedimientos.</p>
<p><b>Para desinstalar el IDE</b>:</p>

<ol>
  <li>Ci&eacute;rrelo.</li>
  <li>En el directorio de instalaci&oacute;n del IDE, ejecute el archivo <tt>uninstall.sh</tt>. </li>
  <li>Para desinstalar GlassFish/Tomcat junto con el IDE, aseg&uacute;rese de que aparecen las versiones correctas en la p&aacute;gina de resumen y marque las casillas de verificaci&oacute;n correspondientes. </li>
  <li>En la p&aacute;gina Resumen, haga clic en Desinstalar. 
  </li>
  <li>Cuando finalice la desinstalaci&oacute;n, haga clic en Terminar.</li>
</ol>
<p><b>Para desinstalar GlassFish v3</b>:</p>
<ol>
  <li>Cierre el IDE.</li>
  <li>Busque el directorio de instalaci&oacute;n del servidor de aplicaciones.
  <p><b>Nota:</b> la ubicaci&oacute;n de instalaci&oacute;n predeterminada es diferente en funci&oacute;n del tipo de instalaci&oacute;n y de la plataforma. La tabla siguiente muestra el directorio de instalaci&oacute;n del servidor de aplicaciones predeterminado en las distintas plataformas.</p>

  <table>
    <tbody>
        <tr class="tblheader">
            <th width="70">Plataforma</th>
            <th width="101">Instalar como...</th>
			<th width="264">Instalaci&oacute;n de GlassFish v3</th>
        </tr>
        <tr class="tbltd0">
          <td>Windows</td>
          <td>usuario con derechos de administrador</td>
          <td><tt>%Archivosdeprograma%\glassfish-v3</tt></td>
        </tr>
        <tr class="tbltd0">
          <td>Windows</td>
          <td>usuario</td>
          <td><tt>%PERFILUSUARIO%\glassfish-v3</tt></td>
        </tr>
        <tr class="tbltd0">
            <td>Solaris&nbsp;OS&nbsp;</td>
            <td>ra&iacute;z</td>
			 <td><tt>/opt/glassfish-v3</tt></td>
        </tr>
        <tr class="tbltd1">

            <td>Solaris&nbsp;OS, Linux</td>
            <td valign="top">usuario</td>
			<td valign="top"><tt>~/glassfish-v3</tt></td>
        </tr>
        <tr class="tbltd0">
            <td>Linux</td>
            <td>ra&iacute;z</td>
			<td><tt>/usr/local/glassfish-v3</tt></td>
        </tr>
    </tbody>
</table>
  </li>
  <li>En el directorio de instalaci&oacute;n del servidor de aplicaciones, ejecute el archivo <tt>uninstall.sh</tt>.</li>

  <li>En la p&aacute;gina Resumen, haga clic en Desinstalar.
  </li>
  <li>Cuando finalice la desinstalaci&oacute;n, haga clic en Terminar.</li>
</ol>
<p><b>Para desinstalar Apache Tomcat: </b></p>
<ol>
  <li>Cierre el IDE.</li>

  <li>Busque el directorio de instalaci&oacute;n de Apache Tomcat y ejecute el archivo <tt>uninstall.sh</tt>. 
  </li>
  <li>En la p&aacute;gina Resumen, haga clic en Desinstalar. </li>
  <li>Cuando finalice la desinstalaci&oacute;n, haga clic en Terminar.</li>
</ol>
</div>
<div>

<h3><a name="uninstall_mac" id="uninstall_mac">Mac OS X</a></h3>
<p><b>Para desinstalar el IDE y el servidor de aplicaciones:</b></p>
<ol>
  <li>Cierre el software.</li>
  <li>Arrastre las carpetas o los archivos del programa a la Papelera. Tenga en cuenta que la ubicaci&oacute;n predeterminada del IDE y del servidor de aplicaciones es <tt>/Aplicaciones/NetBeans/</tt>.  </li>
</ol>
</div>
<div>

<h3><a name="uninstall_zip" id="uninstall_zip">Paquete independiente de la plataforma</a></h3>
<p>Para desinstalar los archivos del IDE, siga los pasos que se describen en la secci&oacute;n <a href="#clean">Limpieza tras instalaciones incompletas</a> de este documento. </p>
</div>
<p align="center"><a href="#top">inicio</a></p>
<h2><a name="upgrading"></a>Actualizaci&oacute;n y coexistencia con versiones anteriores</h2>
<p>NetBeans IDE 5.x, 6.0, 6.1, 6.5 y 6.7 pueden coexistir con NetBeans IDE 6.8 en el mismo sistema. No es necesario desinstalar las versiones anteriores para instalar NetBeans IDE 6.8. </p>
<p>Si tiene instalados NetBeans IDE 5.x, 6.0, 6.1, 6.5 o 6.7, podr&aacute; seleccionar entre importar o no la configuraci&oacute;n de usuario del directorio de usuario existente al ejecutar NetBeans IDE 6.8 por vez primera.</p>
<p align="center"><a href="#top">inicio</a></p>
<h2><a name="troubleshooting" id="troubleshooting"></a>Resoluci&oacute;n de problemas</h2>
<div>
<h3>Acerca del directorio de trabajo del instalador</h3>
<p>El programa de instalaci&oacute;n almacena datos sobre las sesiones de instalaci&oacute;n en el directorio de trabajo del instalador. Ejemplos de estos datos son la lista de componentes instalados en el sistema, los mensajes de registro de la instalaci&oacute;n y los datos de registro. </p>

<p>La ubicaci&oacute;n predeterminada del directorio de trabajo del instalador es <tt>%PERFILUSUARIO%\.nbi</tt> en Windows y <tt>~/.nbi</tt> en las dem&aacute;s plataformas. El subdirectorio de registro contiene los archivos de registro de la instalaci&oacute;n. </p>
</div>
<div>
<h3><a name="clean"></a>Limpieza tras instalaciones incompletas</h3>
<p>Tras una instalaci&oacute;n incompleta o incorrecta, quiz&aacute; deba limpiar el sistema de instalaciones anteriores. </p>
<p><b>En Microsoft Windows, Solaris SO y Linux:</b></p>
<ol>

  <li>Elimine el directorio de trabajo del instalador.</li>
  <li>Elimine los directorios de instalaci&oacute;n del IDE y del servidor de aplicaciones GlassFish.</li>
  <li>En Windows, elimine todas las entradas del registro que contengan <tt>nbi*</tt> de las siguientes claves de registro: <tt>HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall</tt> <tt>HKEY_CURRENT_USER\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall</tt> </li>

</ol>
<p><b>En Mac OS X:</b></p>
<ul>
  <li>Arrastre las carpetas o los archivos del programa a la Papelera. </li>
</ul>
</div>
<div>
<h3>Deshabilitar software espec&iacute;fico antes de la instalaci&oacute;n</h3>
<p>Es recomendable deshabilitar servidores de seguridad, antivirus y aplicaciones de supervisi&oacute;n antes de iniciar la instalaci&oacute;n. Algunas de estas aplicaciones pueden evitar que los componentes del IDE se configuren correctamente durante el proceso de instalaci&oacute;n. </p>
<p>Por ejemplo, si la aplicaci&oacute;n Logitech Process Monitor (<tt>LVPrcSrv.exe</tt>) se est&aacute; ejecutando en el sistema, debe desactivarla antes de la instalaci&oacute;n. </p>

</div>
<p align="center"><a href="#top">inicio</a></p>
<h2><a name="moreinformation"></a>M&aacute;s informaci&oacute;n</h2>

<ul>
<li><a href="index_es.html">Informaci&oacute;n de la versi&oacute;n de NetBeans IDE 6.8 </a></li>
<li><a href="relnotes_es.html">Notas de la versi&oacute;n de NetBeans IDE 6.8 </a></li>
<li><a href="http://download.netbeans.org/netbeans/6.8/">P&aacute;gina de descarga de NetBeans IDE</a></li>
<li><a href="http://wiki.netbeans.org/NetBeansUserFAQ#Installation" target="_blank">Preguntas frecuentes de instalaci&oacute;n de NetBeans IDE</a></li>
</ul>
<hr class="light">
<div class="feedback-box"><a href="https://netbeans.org/about/contact_form.html?to=3&subject=Feedback: NetBeans IDE 6.8 Installation Instructions">Env&iacute;enos sus comentarios</a></div>
<br style="clear:both;">
<p align="center"><a href="#top">inicio</a></p>
</body>
</html>
