<html>
<head>
<title>Bolsas para Inovadores do NetBeans: Detalhes</title>
<link rel="stylesheet" type="text/css" href="../netbeans.css">
<meta name="description" content="NetBeans Innovator Grants details">
</head>

<body>

<h1 style="color:#333333;text-decoration:none;">Bolsas para Inovadores do NetBeans: Detalhes</h1>

<ul type="square">
 <li><a href="./index.html#grantdeadlines">Prazos</a></li>    
 <li><a href="./index.html">Vis&atilde;o geral</a></li>
 <li><a href="./grant-submission-form.html">Formul&aacute;rio de submiss&atilde;o</a></li>
 <li><a href="./innovators-grant-proposal.pdf">Informa&ccedil;&otilde;es Legais: Chamadas de Propostas para Bolsas para Inovadores NetBeans (pdf)</a></li>
 <li><a href="./grantfaqs.html">Perguntas frequentes</a></li>
</ul>
<H2>Regras e Diretrizes </H2>

<p>Para competir pela bolsa &eacute; preciso submenter uma proposta completa de sua id&eacute;ia ou projeto. Aqui est&atilde;o as regras de diretrizes: <br>
<p>
<ul>
<li>O projeto proposto precisa ser um trabalho novo e original. Voc&ecirc; pode usar ou estender c&oacute;digo-fonte aberto exstinte, incluindo c&oacute;digo do Projeto NetBeans, mas ser&aacute; necess&aacute;rio propor um novo trabalho, que voc&ecirc; ir&aacute; implementar uma vez a bolsa seja aprovada. </li><BR>
<li>Todo o c&oacute;digo desenvolvido soba a bolsa precisa ser um c&oacute;digo-fonte aberto sob uma licen&ccedil;a de c&oacute;digo-fonte aberto OSI aprovada, e precisa ser mantido compat&iacute;vel com as licen&ccedil;as do Projeto NetBeans (GPL e CDDL); </li><BR>
<li>O desenvolvedor ou membros da equipe precisam estar registrados como <a href="https://netbeans.org/community/index.html">membros da Comunidade NetBeans</a>. Tamb&eacute;m, o desenvolvedor ou membros da equipe precisam assinar o <a href="http://www.sun.com/software/opensource/sca.pdf">Contrato de Contribuidor da Sun</a>, j&aacute; espera-se que todas as entradas ser&atilde;o contribui&ccedil;&otilde;es para o NetBeans. Isso protege todos os contribuidores do NetBeans ao conceder direito autoral e propriedade conjunta. (Para obter mais detalhes sobre o CC e como <a href="http://wiki.netbeans.org/wiki/view/FaqHowDoIFileACA">envi&aacute;-lo</a>, consulte <a href="http://wiki.netbeans.org/wiki/view/NetBeansUserFAQ#section-NetBeansUserFAQ-ContributorAgreement">a FAQ do Contrato do Contribuidor</a>) ; </li><BR>
<li>A proposta precisa incluir detalhes suficientes sobre o projeto, para que o painel de julgadores possam ter confian&ccedil;a que o projeto &eacute; fact&iacute;vel e que o desenvolvedor tenha condi&ccedil;&otilde;es de implement&aacute;-lo. As informa&ccedil;&otilde;es esperadas incluem: <BR>
<ol>
<li>Vis&atilde;o geral do projeto. </li>
<li>Discuss&atilde;o sobre as vantagens e dos benef&iacute;cos para o projeto e comunidade do NetBeans.  </li>
<li>Discuss&atilde;o sobre os projetos de c&oacute;digo-aberto complementares ou compatativos que possam se benefiar do trabalho feito. </li>
<li>Discuss&atilde;o t&eacute;cnica sobre como o projeto ser&aacute; implementado. </li>
<li>Marcos propostos para o projeto, os detalhes do que ser&aacute; feito e quando. Os marcos precisam cobrir a conclus&atilde;o de 60%, 80% e 100% do projeto, e ser&atilde;o usados durante o per&iacute;odo da bolsa para manter o acompanhamento da evolu&ccedil;&atilde;o do projeto. </li>
<li>Possibilidades de extens&atilde;o do projeto, os detalhes de como o projeto poderia evoluir al&eacute;m do plano proposto original. O trabalho extra a ser considerado para uma bolsa de recursos extras se o projeto proposto for completado. </li>
<li>Garantia de que o desenvolvedor &eacute; capaz de entregar o projeto dentro do prazo poposto: suporte da comunidade ou universidade, endosso JUG local, capacidade t&eacute;cnica, etc. </li>
</ol>
</li>
<li>Esta &eacute; uma bolsa para um trabalho de c&oacute;digo-fonte aberto e n&atilde;o um concurso, e uma vez aceito h&aacute; a expectativa de conclus&atilde;o, portanto o projeto precisa ser implementado com c&oacute;digo-fonter aberto -- ter um reposit&oacute;rio p&uacute;blico para hospedar todo o c&oacute;digo-fonte aberto e listas de correio p&uacute;blicas onde as decis&otilde;es de desenvolvimento s&atilde;o feitas em grau m&iacute;nimo. Os projeto pode ter sua pr&oacute;pria infraestrtutura ou ser hospedado em sites como o java.net, netbeans.org, sourceforge.net ou outros. A hospedagem nesses outros sites populares, torna f&aacute;cil usar a infraestrutura dispon&iacute;vel e popular, reduzindo o impacto no tempo que ser&aacute; necess&aacute;rio para organizar o projeto e formular uma proposta. Esse requisito ir&aacute; ajudar a comunidade e bolsistas do NetBeans ao ajudar a assegurar que o projeto ser&aacute; completado atrav&eacute;s de abertura e colabora&ccedil;&atilde;o. </li>
<li>Um plano de backup ou conting&ecirc;ncia dever&aacute; existir. N&oacute;s vivemos no mundo real e as coisas podem dar errado. Assegurar que nosso c&oacute;digo seja mantido em um reposit&oacute;rio p&uacute;blico que tenha backup, tal como o java.net ou sourceforge.net, ajuda a proteger seu investimento. Lembre-se tamb&eacute;m que seu hardware pode falhar. Mas uma vez iniciado, caso seu computador venha a falhar, voc&ecirc; poderia reiniciar rapidamente do ponto que estava para estar no prazo. Isso significa que voc&ecirc; precisa de um backup ou estar seguro que poderia comprar ou pedir emprestado outro computador.</li>
</ul>

<H2>Pronto para iniciar?</H2>
Basta preencher o <a href="./grant-submission-form.html">formul&aacute;rio de submiss&atilde;o</a>. Quanto mais detalhada sua entrada e qu&atilde;o mais de perto voc&ecirc; segue as diretrizes (a lista acima), melhores suas chances. Boa sorte! <br>
<p><BR>
</body>
</html>

