<html>
<head>
<title>FAQs da Bolsa para Iniovadores do NetBeans </title>
<link rel="stylesheet" type="text/css" href="../netbeans.css">
<meta name="NetBeans Innovation Grant FAQs" content="FAQs for NetBeans Innovation Grant">
</head>

<body>

<h1 style="color:#333333;text-decoration:none;">FAQs da Bolsa para Iniovadores do NetBeans </h1>

                <h2>Perguntas Frequentes</h2>
                <ul>
                    <li><a href="#who_reviews">Quem rev&ecirc; as submiss&otilde;es?</a></li>
                    <li><a href="#when">Acabei de submeter minha proposta, quando algu&eacute;m vai me dar alguma not&iacute;cia?</a></li>
                    <li><a href="#winner_list">Os ganhadores ser&atilde;o anunciados em algum lugar?</a></li>
                    <li><a href="#num_submission">H&aacute; um limite para o n&uacute;mero de submiss&otilde;es que posso enviar?</a></li>
                    <li><a href="#team_size">Minha equipe pode ter quantos membros?</a></li>
                    <li><a href="#project_ideas">Voc&ecirc; tem alguma sugest&atilde;o para projetos?</a></li>
                    <li><a href="#project_done">Posso submeter um projeto que j&aacute; foi desenvolvido?</a></li>
                    <li><a href="#project_closed">Posso submeter um projeto de c&oacute;digo-fonte fechado?</a></li>
                    <li><a href="#why_sca">Porque tenho que assinar o Contrato de Contribuidor da Sun?</a></li>
                    <li><a href="#company">Minha empresa pode participar na submiss&atilde;o de propostas?</a></li>
                    <li><a href="#question">E se minha pergunta n&atilde;o for aqui respondida?</a></li>
                </ul>
 <p> Caso suas perguntas n&atilde;o foram aqui respondidas, mande as mesmas para&nbsp;netgrants@netbeans.org.<br>

<a name="who_reviews"></a>
        <h4>Quem rev&ecirc; as submiss&otilde;es?</h4>
        <p>Um painel de ju&iacute;zes, composto por membros da Comunidade NetBeans e representantes da Sun ir&atilde;o julgar rodas as submiss&otilde;es. As decis&otilde;es dos ju&iacute;zes s&atilde;o finais. A lista de ju&iacute;zes ser&aacute; publicada ap&oacute;s o termino do per&iacute;odo de submiss&atilde;o.  </p>
        
<a name="when"></a>
        <h4>Acabei de submeter minha proposta, quando algu&eacute;m vai me dar alguma not&iacute;cia?</h4>
        <p>Ap&oacute;s sua proposta ter sido recebida, voc&ecirc; ser&aacute; notificado de que foi recebida, portanto, voc&ecirc; saber&aacute; que sua submiss&atilde;o ser&aacute; avaliada. Voc&ecirc; somente ser&aacute; notificado sobre o processo de sele&ccedil;&atilde;o ap&oacute;s os ju&iacute;zes chegarem a decis&atilde;o final. A crit&eacute;rio dos ju&iacute;zes, este poder&atilde;o contat&aacute;-lo para pequenos esclarecimentos sobre a proposta durante o processo. </p>
      
<a name="winner_list"></a>
        <h4>Os ganhadores ser&atilde;o anunciados em algum lugar?</h4>
        <p>Todos os gangadores ser&atilde;o notificados por e-mail e a informa&ccedil;&atilde;o ser&aacute; postada aqui neste site. </p>
       
<a name="num_submission"></a>
        <h4>H&aacute; um limite para o n&uacute;mero de submiss&otilde;es que posso enviar?</h4>
        <p>N&atilde;o. Voc&ecirc; pode submeter qualquer n&uacute;mero de porpostas e poder&aacute; participar de m&uacute;ltiplas equipes. O ju&iacute;zes decidir&atilde;o se conceder&atilde;o bolsas para uma ou mais de suas propostas.</p>
      
<a name="team_size"></a>
        <h4>Minha equipe pode ter quantos membros?</h4>
        <p>N&atilde;o h&aacute; um limite, mas o valor da bolsa assume um tamanho de euipe de 5 a 10 desenvolvedores. Caso queira ter uma equipe maior, sem problemas. Lembre-se apenas que o l&iacute;der da equipe &eacute; respons&aacute;vel por dividir a bolsa entre os participantes.</p>
       
<a name="project_ideas"></a>
        <h4>Voc&ecirc; tem alguma sugest&atilde;o para projetos?</h4>
        <p>Sim. O NetBeans Dream Team tem diversas id&eacute;ias de projeto em seu <a href="http://wiki.netbeans.org/GrantProjectIdeas">wiki</a>.</p>
    
<a name="project_done"></a>
        <h4>Posso submeter um projeto que j&aacute; foi desenvolvido?</h4>
        <p>N&atilde;o. Isso &eacute; uma bolsa, ou seja, uma quantidade de dinheiro dada para um projeto a ser desenvolvido e n&atilde;o um pr&ecirc;mio por um trabalho feito no passado. Voc&ecirc; pode propor funcionalidade adicional, algum trabalho de expans&atilde;o ou qualquer novo desenvolvimento, adicional ao seu projeto existente.</p>
      
<a name="project_closed"></a>
        <h4>Posso submeter um projeto de c&oacute;digo-fonte fechado?</h4>
        <p>N&atilde;o. Todo o trabalho feito sob uma bolsa precisa ser um projeto de c&oacute;digo-fonte aberto e, ser licenciado sob licen&ccedil;as compat&iacute;veis do NetBeans, e at&eacute; ser desenvolvido no ambiente aberto (reposit&oacute;rio aberto, listas de correio abertas). Se o seu projeto &eacute; de alguma forma dependente de um projeto de c&oacute;digo-fonte fechado (por exemplo, um m&oacute;dulo para acessar um sistema de controle de vers&atilde;o de c&oacute;digo-fonte fechado), isso &eacute; v&aacute;lido, desde que o c&oacute;digo que voc&ecirc; desenvolva sob a bolsa seja de c&oacute;digo-fonte aberto.</p>
        
<a name="why_sca"></a>
        <h4>Porque tenho que assinar o Contrato de Contribuidor da Sun?</h4>
        <p>Essa &eacute; uma bosa que visa aprimorar o projeto NetBeans. Somente o c&oacute;digo contribu&iacute;do sob um CCS pode ser adicionado ao NetBeans. Todo o c&oacute;digo contribu&iacute;do sob esta bolsa precisa ser contribu&iacute;do sob um CCS. Mesmo que ache que seu c&oacute;digo n&atilde;o ser&aacute; de uso imeditato para o NetBeans, o CCS&eacute; necess&aacute;rio, porque ele poder&aacute; ser de uso no futuro. Tamb&eacute;m, o CCS permite que voc&ecirc; contribua no futuro com o NetBeans, portanto, como um membro da Comunidade NetBeans, sua assinatura do CCS ir&aacute; permitir sua maior participa&ccedil;&atilde;o.</p>
       
<a name="company"></a>
        <h4>Minha empresa pode participar na submiss&atilde;o de propostas?</h4>
        <p>Embora sua equipe possa ter m&uacute;ltiplos desenvolvedores de uma mesma empresa, as bolsas somente ser&atilde;o para o indiv&iacute;duo que seja o Contato do Projeto e n&atilde;o para uma empresa. Para obter os detalhes jur&iacute;dicos, fa&ccedil;a o download e imprima a <a href="./innovators-grant-proposal.pdf"><b>Informa&ccedil;&atilde;o Jur&iacute;dica: Cahamada para Propostas de Bosla para Inovador do NetBeans</b> (pdf)</a></p>
        
<a name="question"></a>
        <h4>E se minha pergunta n&atilde;o for aqui respondida?</h4>
        <p>Caso sua pergunta n&atilde;o seja aqui respondida, mande a mesma para netgrants@netbeans.org. </p>
<p><br>

</body>
</html>