<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Concurso para Bolsa para Inovador do NetBeans</title>
  <link rel="stylesheet" type="text/css" href="../netbeans.css">
  <meta name="description" content="NetBeans Innovator Grants details">
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <link rel="stylesheet" type="text/css" href="/features.css">
</head>
<body>
<h1>Concurso para Bolsa para Inovador do NetBeans</h1>
<br>
<h2>Os projetos dos sonhos se tornam realidade - Os ganhadores do concurso para bolsa para inovadores s&atilde;o anunciados!<br>
</h2>
29 de setembro de 2008<br>
<br>
Ap&oacute;s oito meses e mais de 170 propostas de projetos submetidas, n&oacute;s apresentamos os ganhadores Concurso para Bolsa para Inovador do NetBeans!<br>
<br>
Iniciado em Fevereiro de 2008, o Concurso para Bolsa para Inovador do NetBeans faz parte da iniciativa da Sun Microsystems em conceder 1 milh&atilde;o de d&oacute;lares para os desenvolvedores mundiais de c&oacute;digo-fonte aberto, para que trabalhem em seu projeto favorito patrcionado pela Sun. <br>
<br>
Ser pago para desenvolver um projeto dos sonhos ou em uma id&eacute;ia que poderia ser de uso por outros desenvolvedores? A resposta da comunidade NetBeans foi imediata! Um painel de expertos do NetBeans Dream Team recebeu a incumb&ecirc;ncia de avaliar as melhores propostas. 20 projetos foram selecionados e seus desenvolvedores receberam a atribui&ccedil;&atilde;o de mentores do NetBeans Dream Team e da Equipe de Engenharia do NetBeans. Ap&oacute;s meses de desenvolvimento e feedback, 13 projetos foram completados, revisados pelo painel e aprovados para a concess&atilde;o da bolsa.<br>
<br>
Os projetos ganhadores:<br>
<br>
<div style="float: left; width: 50%;"><b>Projetos grandes<br>
<br>
</b>
<ul>
  <li><a href="http://code.google.com/p/cashforward">CashForward</a>, Bill Snyder ($11,500)</li>
  <li><a href="http://code.google.com/p/cubeon">Cube&deg;n</a>, Anuradha Gunasekara ($11,500)</li>
  <li><a href="http://javaspaces-netbeans.googlecode.com">JavaSpaces</a>, Magdalena Dukielska ($11,500)</li>
  <li><a href="http://code.google.com/p/ivybeans">IvyBeans</a>, Laurent For&ecirc;t ($11,500)</li>
  <li><a href="http://nbproject.dev.java.net">NB Project</a>, Alessandro Dourado ($11,500)</li>
  <li><a href="https://netbeans-spot.dev.java.net">NetBeans Spot/Sun SPOT Plugin</a>, Thiago Galbiatti Vespa ($11,500)</li>
  <li><a href="http://wiki.netbeans.org/Scala">Scala Support</a>, Hong Wei Deng ($11,500)</li>
</ul>
</div>
<div style="float: left; width: 50%;"><b>Projetos pequenos<br>
<br>
</b>
<ul>
  <li><a href="http://monoh.dev.java.net">MONOH</a>, Carlos Oliveira ($2,000)</li>
  <li><a href="https://numberedbookmarks.dev.java.net">Numbered Bookmarks</a>, Samitha Jayasundara ($2,000)</li>
  <li><a href="http://code.google.com/p/netbeans-pdfviewer">PDFViewer</a>, ZhenYa Zou ($2,000)</li>
  <li><a href="http://code.google.com/p/pl-sql-editor">PL/SQL Editor</a>, Alexandre Soumbatov ($2,000)</li>
  <li><a href="https://darkstarmobile.dev.java.net">Project Darkstar Tools and Mobility Support</a>, Karel Herink ($2,000)</li>
  <li><a href="http://wiki.netbeans.org/ResourceBundleEditor">Resource Bundle Editor</a>, Denis Stepanov ($2,000) </li>
</ul>
</div>
<p>&nbsp; </p>
<p>Quatro projetos foram selecionados por alcan&ccedil;arem alto padr&atilde;o de qualidade, usabilidade e que demonstraram potencial para crescimento futuro.<br>
</p>
<div style="float: left; width: 50%;">
<p><b>Pr&ecirc;mio para Medalhsitas de Ouro</b></p>
<ul>
  <li><a href="http://wiki.netbeans.org/Scala">Scala Support</a> ($11,000)</li>
  <li><a href="http://code.google.com/p/cubeon">Cube&deg;n</a> ($11,000)</li>
</ul>
</div>
<div style="float: left; width: 50%;">
<p><b>Pr&ecirc;mio para Medalhistas de Prata</b></p>
<ul>
  <li><a href="http://code.google.com/p/ivybeans">IvyBeans</a> ($5,000)</li>
  <li><a href="http://code.google.com/p/pl-sql-editor">PL/SQL Editor</a> ($5,000)</li>
</ul>
</div>
<p><br>
</p>
<p><br>
</p>
<p><br>
</p>
<br style="font-weight: bold; font-style: italic;">
<span style="font-weight: bold; font-style: italic;">A equipe e a comunidade NetBeans parabenizam todos os desenvolvedores por seu destacado trabalho!</span><br>
<br>
Leia o <a
 href="http://www.sun.com/aboutsun/pr/2008-09/sunflash.20080929.4.xml">Anuncio Oficial</a> da Sun Microsystems.<br>
<br>
Ou&ccedil;a uma <a
 href="http://netbeans.tv/interviews/Interview-with-Innovator-Grants-Award-Winners-390/">entrevista por podcast</a> com os desenvolvedores ganhadores, Anuradha Gunasekara (Cube&deg;n) e Hong Wei Deng (Scala Support).<br>
<br>
Leia as entrevistas com desenvolvedores ganhadores <a
 href="http://www.sun.com/aboutsun/media/features/2008-0924/qa_foret.jsp">Lorent Foret</a> (IvyBeans) e&nbsp; <a
 href="http://www.sun.com/aboutsun/media/features/2008-0924/qa_soumbatov.jsp">Alexandre Soumbatov</a> (PL/SQL Editor). <br>
<br>
Saiba mais sobre os <a href="projects.html">20 projetos</a> selecionados para a Bolsa para Inovador do NetBeans, e obtenha as informa&ccedil;&otilde;es detalhadas de planejamento e status para projetos individuais <span
 style="text-decoration: underline;"></span><a
 href="http://wiki.netbeans.org/GrantProjectsStatus">aqui</a>.<br>
<br>
<h2>Uma mensagem de Jiri Kovalsky, Gerente T&eacute;cnico da Comunidade NetBeans</h2>
<p> </p>
<p>Permita-me congratular todos os projetos ganhadores e especialmente os que receberam as medlahas de Ouro e Prata, j&aacute; que considero que esles verdadeiramente merecem o pr&ecirc;mio! Muito obrigado por seus excelente trabalho. <br>
</p>
<p>Tamb&eacute;m desejo expressar meu agadecimento ao NetBeans Dream Team, cuja ajuda foi essencial para o sucesso do Concurso para a Bolsa para Inovador do NetBeans.</p>
<p>Novamente, obrigado a todos por fazer com que esse sonho se tornasse realidade!</p>
<p>Ou&ccedil;a a <a
 href="http://www.netbeans.tv/podcasts/Jirka-Kovalksy-on-NetBeans-Innovators-Grants-387/">entrevista por podcast</a> com Jiri Kovalsky.
</p>
<h2>Cita&ccedil;&otilde;es sobre os projetos Medalha de Ouro e Prata por membros do NetBeans Dream Team e da Equipe de Engenharia do NetBeans</h2>
<h4>Sobre o Scala Language Support, Pr&ecirc;mio de Medalhista de Ouro</h4>
<p><i>&quot;O Scala Language Support &eacute; uma contribui&ccedil;&atilde;o bastante complexa que fornece ao NetBeans IDE tudo que &eacute; necess&aacute;rio para desenvolver um aplicativo na linguagem de programa&ccedil;&atilde;o Scala&quot;.</i></p>
<p align="right"><b><i>Tomas Zezula</i>, Engenheiro de Software da Infraestrutura Java</b></p>
<hr>
<h4>Sobre o Cube&deg;n, Pr&ecirc;mio de Medalhista de Ouro</h4>
<p><i>&quot;O Cube&deg;n traz o desenvolvimento focado em tarefa para o NetBeans 6.5. Ele &eacute; pesadamente influenciado pelo popular plug-in, Eclipse Mylyn, que alguns dizem ser o tremendo recurso do Eclipse. A primeira vers&atilde;o vem com suporte para o rastreador de quest&otilde;es Jira e h&aacute; planos futuros para suportar o IssueZilla, Bugzilla e o XPlanner. Qualquer pessoa interessada neste plug-in &eacute; encorajada a instalar o mesmo e fornecer feedback para o desenvolvedor&quot;.</i></p>
<p align="right"><b><i>Ryan de Laplante</i>, Membro do NetBeans Dream Team</b></p>
<hr>
<h4>Sobre o ivyBeans, Pr&ecirc;mio de Medalhista de Prata</h4>
<p><i>&quot;O IvyBeans traz o gerenciamento da depend&ecirc;ncia simples e r&aacute;pido para projetos NetBeans com base no Ant. Ele realmente simplifica a tarefa de juntar um aplicativo a partir de reposit&oacute;rios de bibliotecas existentes. Isso &eacute; especialmente &uacute;til ao usar bibliotecas existentes de c&oacute;digo-fonte aberto, mas pode simplificar a tarefa da mesma forma para qualquer projeto comercial. Encontre uma biblioteca, adicione-a ao seu projeto, e com ele todas as depend&ecirc;ncias est&atilde;o imediatamente dispon&iacute;veis para seu projeto sem qualquer outra configura&ccedil;&atilde;o de projeto por parte do desenvolvedor. O que mais voc&ecirc; poderia pedir?&quot;.</i></p>
<p align="right"><b><i>Wade Chandler</i>, membro do NetBeans Dream Team</b></p>
<hr>
<h4>Sobre o PL/SQL Editor, Pr&ecirc;mio de Medalhista de Prata</h4>
<p><i>&quot;O PL/SQL Editor &eacute; um m&oacute;dulo pequeno mas com bons recursos que torna poss&iacute;vel para que os que suportam a Oracle tenham um bom n&iacute;vel de suporte para sintaxe PL/SQL e o gerenciamento de objetos populares debtro de seu Java IDE favorito&quot;.</i></p>
<p align="right"><b><i>Masoud Kalali</i>, membro do NetBeans Dream Team</b></p>
<br>
<p><i>&quot;O PL/SQL Editor traz o desenvolvimento do banco de dados Oracle para o NetBeans. &Eacute; f&aacute;cil de usar e parece fornecer uma melhor experi&ecirc;ncia para os usu&aacute;rios Oracle dentro do NetBeans IDE. Ele ainda tem muito a evoluir, mas com o trabalho progredindo, use este projeto para tornar o desenvolvimento Oracle no NetBeans uma moleza. Ele parece muito promissor, e estou mirando adiante para seu futuro&quot;.</i></p>
<p align="right"><b><i>Wade Chandler</i>, membro do NetBeans Dream Team</b></p>
</body>
</html>
