<html>
<head>
<title>Bolsa para Inovador do NetBeans - uma vis&atilde;o geral</title>
<link rel="stylesheet" type="text/css" href="../netbeans.css">
<meta name="description" content="NetBeans Innovator Grants details">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>

<body>
<link rel="stylesheet" type="text/css" HREF="/features.css">
<h1>Bolsa para Inovador do NetBeans - Vis&atilde;o geral</h1>

<h2>Ganhadores anunciados!</h2>

<p>Os ganhadores foram anunciados. <a href="index.html"> Leia mais...</a>

<br style="clear:both;"><br><p>
<div style="float:right; margin:0 15px 0 15px;"><a href="http://www2.sys-con.com/webinararchive.cfm?pid=wc_02-18-08_souza&registered=on"><img src="../images_www/collateral/60/BrunoSouza_168x140.jpg" width="168" height="140"></a><br><em>Bruno Souza explica como<br>tornar seu sonho realidade</em></div>
<p>Deseja tornar seu projeto dos sonhos uma realidade? Voc&ecirc; veio ao lugar certo. Os Sonhos da realidade: a Bolsa para Inovador do Netbeans, ir&aacute; ajud&aacute;-lo a trazer suas id&eacute;ias para avisa e ir&aacute; atrbuir dinheiro real para projetos dos sonhos, para ajud&aacute;-los a se tornar realidade! 
<p>A Bolsa para Inovador do NetBeans faz parte da iniciativa da Sun Microsystems de oferecer 1 milh&atilde;o de d&oacute;lares para desenvolvedores de c&oacute;digo-fonte aberto ao redor do mundo, para que trabalhem em seu projeto favorito patrocinado pela Sun. Liderado pela Comunidade NetBeans e pelo NetBeans Dream Team, a Bolsa para Inovador do NetBeans ir&aacute; ajud&aacute;-lo a tornar suas ide&iacute;as em projetos reais.
<br>
<ul type="square">
 <li><a href="./index.html#grantdeadlines">Prazos</a></li>    
 <li><a href="./grantdetails.html">Detalhes da submiss&atilde;o</a></li>
  <li><a href="./grant-submission-form.html">Formul&aacute;rio de submiss&atilde;o</a></li>
 <li><a href="./innovators-grant-proposal.pdf">Informa&ccedil;&otilde;es Legais: Chamadas de Propostas para Bolsas para Inovadores NetBeans (pdf)</a></li>
 <li><a href="./grantfaqs.html">Perguntas frequentes</a></li>
</ul>
<br>


<H2>Vis&atilde;o geral</H2>
<p>
A Bolsa para Inovador do NetBeans &eacute; um processo para fornecer bolsas para desenvolvedores ou equipes de desenvolvedores para trabalhar um projeto de c&oacute;digo-fonte aberto. Um total de 10 projetos grandes ser&aacute; escolhido e ser&aacute; concedida uma bolsa de 11.500 d&oacute;lares. Outros 10 projetos menores ser&atilde;o escolhidos e ser&aacute; concedida uma bolsa de 2.000 d&oacute;lares. As bolsas somente ser&atilde;o concedidas na conclus&atilde;o real do projeto. Projetos que obtenham a excel&ecirc;ncia podem receber dois pr&ecirc;mios de ouro poss&iacute;vei de 11.000 d&oacute;lares ou dois pr&ecirc;mios parta poss&iacute;veis de 5.000 d&oacute;lares. <br>
<p>Voc&ecirc; pode submenter uma proposta de projeto -- suas id&eacute;ias de como aprimorar o Projeto Netbeans -- e um painel de expertos ir&aacute; atribuir para as melhoes propostas uma bolsa em dinheiro. Ap&oacute;s voc&ecirc; ter uma bolsa aprovada, sabe que receber&aacute; o dinheiro quando completar o projeto. Voc&ecirc; pode trabalhar em um m&oacute;dulo, desenvolver um aplicativo sobre a Plataforma Netbeans, corrigir bugs no NetBeans IDE ou at&eacute; trabalhar em documenta&ccedil;&atilde;o ou tradu&ccedil;&atilde;o faltante. Seja o que voc&ecirc; considera que seja necess&aacute;rio para aumentar a ado&ccedil;&atilde;o do Netbeans e empurrar o Projeto NetBeans para seu pr&oacute;ximo n&iacute;vel. E receber&aacute; dinheiro de verdade -- ao menos 11.500 ou 2.000 d&oacute;lares! -- para trabalhar em seu projeto dos sonhos de c&oacute;digo-fonte aberto! <br>
<p>Venha trabalhar em um excelente projeto -- seu projeto, suas id&eacute;ias -- e seja pago para faz&ecirc;-lo. O NetBeans &eacute; um projeto de c&oacute;digo-fonte aberto com base no Java, que inclui um IDE cheio de recursos e uma forte plataforma extens&iacute;vel para criar aplicativos de desktop. H&aacute; diversos projetos e id&eacute;ias interessantes que voc&ecirc; pode desenvolver sobre o NetBeans, e n&oacute;s queremos saber o que tem em mente. Voc&ecirc; tem uma grande id&eacute;ia que ir&aacute; ajudar outros desenvolvedores a serem mais produtivos? Voc&ecirc; deseja ter a chance de criar a pr&oacute;xima gera&ccedil;&atilde;o inovadora no desenvolvimento de software? Voc&ecirc; deseja tornar ainda mais f&aacute;cil o desenvolvimento de aplicativos de desktop? N&atilde;o seria &oacute;timo ser pago para trabalhar em seu pr&oacute;prio projeto? Esta &eacute; a sua chance, submenta suas propostas para os Sonhos de Realidade: a Bolsa para Inovador do NetBeans.<br>
<p>

</body>
</html>

