<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
    <head>
        <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
        <title> Informa&ccedil;&otilde;es sobre o IDE NetBeans 6.0</title>
        <meta name="DESCRIPTION" content="Features, Demos, Tutorials, and Release Dates for the NetBeans IDE 6.0 Release">
        <link rel="stylesheet" type="text/css" href="../../../netbeans.css">
    </head>
    
    <body>
        
        <a name="top"></a>
        <h1> Informa&ccedil;&otilde;es sobre o IDE NetBeans 6.0</h1>
        <p>
            O IDE NetBeans &eacute; um ambiente de desenvolvimento integrado (IDE), modular e baseado em padr&otilde;es, escrito na linguagem de programa&ccedil;&atilde;o Java.    O projeto NetBeans consiste em um <a href="../../../features/index_pt_BR.html">IDE de c&oacute;digo-fonte aberto</a> e em uma <a href="../../../features/platform/index_pt_BR.html">plataforma de aplicativo</a>, utilizado como uma estrutura gen&eacute;rica para construir qualquer tipo de aplicativo.
        </p>
        <p>
            O objetivo do IDE NetBeans 6.0 &eacute; aprimorar a produtividade do desenvolvedor por meio de um editor mais r&aacute;pido e inteligente e &agrave; integra&ccedil;&atilde;o de todos os produtos NetBeans em um &uacute;nico IDE.                        Baixe, confira e conte-nos sua opini&atilde;o.                        O lan&ccedil;amento do IDE NetBeans 6.0 est&aacute; programado para novembro de 2007 (consulte o <a href="../roadmap.html">roteiro</a>).  
        </p>
        
        <h2>Como obter o IDE NetBeans 6.0</h2>
        
        <p>
            Baixe o IDE NetBeans 6.0, experimente-o e conte-nos sua opini&atilde;o.
        </p>
        
        <p>
            <a href="../../../downloads/index.html"><img src="../../../images_www/v6/frontpage-download-button.gif" border="0"></a>
        </p>
        
        <p>Voc&ecirc; tamb&eacute;m pode fazer baixar as <a href="http://bits.netbeans.org/download/6.0/nightly/">instala&ccedil;&otilde;es di&aacute;rias</a> do IDE NetBeans 6.0.
            
            <b>Nota:</b> as instala&ccedil;&otilde;es di&aacute;rias ainda est&atilde;o sendo desenvolvidas e podem conter erros que causar a perda de dados. 
        </p>
        <p>
            A maior parte do c&oacute;digo do IDE NetBeans 6.0 est&aacute; dispon&iacute;vel sob licen&ccedil;a dupla, que consiste na <a href="https://netbeans.org/cddl-gplv2.html">Licen&ccedil;a de Desenvolvimento e Distribui&ccedil;&atilde;o Comum (CDDL) v1.0 e na Licen&ccedil;a P&uacute;blica Geral GNU (GPL) v2</a>.  Consulte <a href="https://netbeans.org/about/legal/code_dependency_matrix.html">detalhes sobre componentes do NetBeans</a> e as licen&ccedil;as que os protegem.
        </p>
        <h2>Documenta&ccedil;&atilde;o</h2>
        <p>Use os documentos a seguir iniciar o NetBeans 6.0.  </p>
        
        <ul>
            <li><a href="./relnotes_pt_BR.html">Notas da vers&atilde;o</a></li>  
            <li><a href="./install_pt_BR.html">Instru&ccedil;&otilde;es de instala&ccedil;&atilde;o</a></li>
            <li><a href="https://netbeans.org/kb/archive/index.html">Tutoriais, guias e artigos t&eacute;cnicos</a></li>
            <!--<li><a href="../../../kb/60/flash.html">Demonstra&ccedil;&otilde;es em Flash</a></li>-->
            <li><a href="../../magazine/">NetBeans Magazine!</a></li>
        </ul>
        
        <h2>Novidades do IDE NetBeans 6.0</h2>
        
        <p>A seguir temos um resumo dos novos recursos mais interessantes do IDE NetBeans 6.0. 
            Voc&ecirc; tamb&eacute;m pode visitar a <a href="http://wiki.netbeans.org/wiki/view/NewAndNoteWorthy">p&aacute;gina New and Noteworthy</a> para obter uma lista detalhada das altera&ccedil;&otilde;es feitas desde a vers&atilde;o 5.5.1.</p>
        
        <h3>Aprimoramentos do editor</h3>
        <table border="0" cellspacing="5">
            <tbody>
                <tr>
                    <td valign="top">
                        <ul>
                            <li><b>Recursos autocompletar c&oacute;digo mais inteligente.</b> O editor do NetBeans &eacute; mais r&aacute;pido e mais inteligente, completando palavras-chave, campos e vari&aacute;veis.   Ele tamb&eacute;m relaciona as op&ccedil;&otilde;es mais l&oacute;gicas na parte superior e permite ver as op&ccedil;&otilde;es completas na parte inferior</li>
                        </ul>
                    </td>
                    <td align="center" valign="top"><img src="../../../images_www/screenshots/6.0/code-completion4.jpg" border="1" alt="captura de tela de uma janela sendo movida com a a&ccedil;&atilde;o de arrastar e soltar"> </td>
                </tr>
                <tr>
                    <td valign="top">
                        <ul>
                            <li><b>Realce.</b> Voc&ecirc; pode considerar o recurso de realces uma substitui&ccedil;&atilde;o f&aacute;cil de usar e mais correta da fun&ccedil;&atilde;o de pesquisa dos editores.  O IDE monitora a posi&ccedil;&atilde;o do cursor e, baseado nela, real&ccedil;a algumas partes do c&oacute;digo. Os realces s&atilde;o marcados com uma cor de segundo plano no editor. Eles tamb&eacute;m s&atilde;o colocados na lista de erros, o que permite ter uma vis&atilde;o geral de todo o arquivo. </li>
                            <li><b>Navega&ccedil;&atilde;o e inspe&ccedil;&atilde;o aprimoradas.</b> Al&eacute;m dos realces, o editor de c&oacute;digo-fonte permite navegar com rapidez pelo c&oacute;digo, com melhor organiza&ccedil;&atilde;o da janela Navegador e dos inspetores de membros e hierarquia.</li>
                            <li><b>Muito mais que um simples recurso de autocompletar c&oacute;digo.</b> Com os modelos ativos e a funcionalidade Circundar com, &eacute; poss&iacute;vel inserir rapidamente blocos de c&oacute;digo utilizados com freq&uuml;&ecirc;ncia e concentrar-se na l&oacute;gica dos neg&oacute;cios.</li>
                            <li><b>H&aacute; muito mais.</b> Consulte o <a href="http://wiki.netbeans.org/wiki/view/Java_EditorUsersGuide">Guia de Usu&aacute;rio do Editor Java</a></li>
                        </ul>
                    </td>
                    <td align="center" valign="top"><img src="../../../images_www/screenshots/6.0/hilites3.jpg" border="1" alt="captura de tela de janelas do depurador com a janela Vari&aacute;veis locais &agrave; frente"></td>
                </tr>
            </tbody>
        </table>
        <h3>Suporte para Ruby/JRuby/Ruby on Rails</h3>
        <table border="0" cellspacing="5">
            <tbody>
                <tr>
                    <td valign="top">
                        <ul><li><b>Suporte para projetos.</b> Crie, com rapidez, projetos Ruby com estrutura l&oacute;gica, execute arquivos Ruby, configure outros interpretadores Ruby (como JRuby ou Ruby nativo), localize e instale Ruby Gems com um assistente gr&aacute;fico, crie e execute testes de unidade, execute arquivos de especifica&ccedil;&atilde;o RSpec, alterne entre um arquivo Ruby e seu arquivo de teste de unidade ou de especifica&ccedil;&atilde;o correspondente, e assim por diante.    <a href="https://netbeans.org/download/flash/jruby_on_rails/jruby_on_rails.html">Exibir demonstra&ccedil;&atilde;o.</a></li>
                            <li><b>Edi&ccedil;&atilde;o avan&ccedil;ada do Ruby.</b> Edi&ccedil;&atilde;o de c&oacute;digo avan&ccedil;ada para Ruby, usando informa&ccedil;&otilde;es sem&acirc;nticas sobre o programa para oferecer o recurso de autocompletar c&oacute;digo, mostrando as classes e os m&eacute;todos dispon&iacute;veis para a express&atilde;o atual, juntamente com a documenta&ccedil;&atilde;o RDoc associada.  O realce da sintaxe &eacute; aprimorado com informa&ccedil;&otilde;es sem&acirc;nticas, de modo que vari&aacute;veis locais e par&acirc;metros n&atilde;o-utilizados s&atilde;o exibidos na cor cinza. Existem v&aacute;rios outros recursos de edi&ccedil;&atilde;o, incluindo a declara&ccedil;&atilde;o Ir para passar ao ponto de declara&ccedil;&atilde;o de uma refer&ecirc;ncia de classe ou m&eacute;todo.   <a href="https://netbeans.org/download/flash/jruby_editing/jruby_editing.html">Exibir demonstra&ccedil;&atilde;o.</a></li>
                            <li><b> Depurador Ruby.   </b> Percorra passo a passo ou execute o c&oacute;digo Ruby, configure pontos de interrup&ccedil;&atilde;o, examine vari&aacute;veis locais, navegue na pilha de chamadas, alterne threads e avalie express&otilde;es apenas passando o mouse sobre a vari&aacute;vel no editor.     Tamb&eacute;m h&aacute; suporte para extens&atilde;o de &quot;depura&ccedil;&atilde;o r&aacute;pida&quot; . </li>
                            <li><b>Suporte para Ruby on Rails.</b> Gere projetos ou gere c&oacute;digos com o assistente gr&aacute;fico gerador de c&oacute;digos Rails, que oferece documenta&ccedil;&atilde;o sobre plug-ins dentro do pr&oacute;prio assistente.  Os geradores de outros fornecedores tamb&eacute;m recebem suporte.  Al&eacute;m disso, existem a&ccedil;&otilde;es para pular rapidamente uma a&ccedil;&atilde;o do Rail e sua visualiza&ccedil;&atilde;o correspondente ou desviar o navegador para o URL mais relevante para o arquivo que voc&ecirc; est&aacute; editando.   As migra&ccedil;&otilde;es de banco de dados e destinos Rake tamb&eacute;m recebem suporte. Por &uacute;ltimo, os arquivos RHTML s&atilde;o real&ccedil;ados (junto com o suporte aprimorado do NetBeans 6.0 para arquivos relacionados, como JavaScript e CSS).  Exibir demonstra&ccedil;&atilde;o.</li>
                    </ul>    </td>
                    <td align="center" valign="top">
                        <img src="../../../images_www/screenshots/6.0/ruby-project.png" border="1"
                             alt="captura de tela de uma janela sendo movida com a a&ccedil;&atilde;o de arrastar e soltar">
                    </td>
                </tr>
            </tbody>
        </table>
        <h3>Instala&ccedil;&atilde;o e atualiza&ccedil;&atilde;o mais f&aacute;ceis</h3>
        <table border="0" cellspacing="5">
            <tbody>
                <tr>
                    <td valign="top">
                        <ul>
                            <li><b>Experi&ecirc;ncia de instala&ccedil;&atilde;o unificada.</b> O novo instalador NetBeans facilita obter a funcionalidade desejada. N&atilde;o &eacute; mais necess&aacute;rio baixar e instalar pacotes separados.  Agora voc&ecirc; escolhe o melhor download para voc&ecirc; e instala os recursos e tempos de execu&ccedil;&atilde;o necess&aacute;rios em um &uacute;nico instalador. Voc&ecirc; pode adicionar funcionalidade posteriormente, executando o instalador outra vez.</li>
                            <li><b>Mantenha-se atualizado.</b> A Central de atualiza&ccedil;&otilde;es e o Gerenciador de m&oacute;dulos foram mesclados no Gerenciador de plug-ins.   Habilite e desabilite funcionalidades com facilidade, procure atualiza&ccedil;&otilde;es e obtenha novas funcionalidades, tudo em um s&oacute; lugar.</li>
                        </ul>
                    </td>
                    <td align="center" valign="top">
                        <img src="../../../images_www/screenshots/6.0/pluginmgr2.jpg" alt="Gerencie plug-ins com o Gerenciador de plug-ins." border="1">
                    </td>
                </tr>
            </tbody>
        </table>
        
        <h3>Desenvolvimento de GUI Swing</h3>
        <table border="0" cellspacing="5">
            <tbody>
                <tr>
                    <td valign="top">
                        
                        <p>Al&eacute;m dos in&uacute;meros aprimoramentos do aclamado NetBeans GUI Designer (antes conhecido como &quot;Project Matisse&quot;), o suporte para desenvolvimento de aplicativos da &aacute;rea de trabalho Java foi melhorado com os seguintes recursos:</p>
                        
                        <ul>
                            
                            
                            <li><b>Aplicativos de banco de dados Swing.</b> Agora &eacute; mais f&aacute;cil do que nunca criar aplicativos de banco de dados da &aacute;rea de trabalho Swing aproveitando a tecnologia Beans Binding (JSR 295) e da API Java Persistence.   Com o novo modelo de projeto Java Desktop Application, voc&ecirc; pode configurar rapidamente um formul&aacute;rio que exibe uma tabela de banco de dados e permite modificar o banco de dados. Vincule uma tabela de banco de dados a um formul&aacute;rio existente, arrastando a tabela da janela Tempo de execu&ccedil;&atilde;o para um formul&aacute;rio. <a href="https://netbeans.org/download/flash/netbeans_6_gui_builder/netbeans_6_gui_builder.html">Exibir demonstra&ccedil;&atilde;o.</a></li>
                            <li><b>V&iacute;nculo de beans.</b> Al&eacute;m de ajudar com aplicativos de banco de dados, o suporte do IDE para v&iacute;nculo de beans tamb&eacute;m facilita manter as propriedades de diferentes beans em sincronia.</li>
                            <li><b>Suporte a Swing Application Framework (JSR 296).</b> Agora voc&ecirc; pode desenvolver aplicativos de &aacute;rea de trabalho de pequeno e m&eacute;dio porte mais r&aacute;pido do que nunca, aproveitando os blocos de constru&ccedil;&atilde;o fornecidos pela Swing Application Framework.                                                                               Essa estrutura simplifica a manipula&ccedil;&atilde;o do ciclo de vida, das a&ccedil;&otilde;es e de recursos do aplicativo.</li>
                        </ul>
                    </td>
                    <td align="center" valign="top">
                        <img src="../../../images_www/screenshots/6.0/desktopdb.png" 
                             alt="captura de tela de um aplicativo de banco de dados da &aacute;rea de trabalho em execu&ccedil;&atilde;o, criado com a ajuda de v&iacute;nculo de beans e suporte a Swing Application Framework" >
                    </td>
                </tr>
            </tbody>
        </table>
        
        <h3>Cria&ccedil;&atilde;o de perfil</h3>
        <table border="0" cellspacing="5">
            <tr>
                <td valign="top">
                    <ul>
                        <li><b>Profiler integrado ao IDE NetBeans.</b> O Profiler NetBeans tornou-se uma parte integrante do IDE NetBeans 6.0!                                                                       Agora, n&atilde;o h&aacute; mais necessidade de fazer o download e instalar o Profiler NetBeans separadamente.</li>
                        <li><b>Pontos de cria&ccedil;&atilde;o de perfil.</b> Os pontos de cria&ccedil;&atilde;o de perfil permitem colocar pontos de cria&ccedil;&atilde;o de perfil no c&oacute;digo-fonte a fim de controlar mais precisamente a coleta de resultados da cria&ccedil;&atilde;o de perfil. </li>
                        <li><b>Compare instant&acirc;neos de mem&oacute;ria.</b> Voc&ecirc; pode comparar instant&acirc;neos de mem&oacute;ria salvos e n&atilde;o-salvos para ver quais objetos foram criados ou liberados do heap desde que os instant&acirc;neos foram tirados.                                             Para obter mais informa&ccedil;&otilde;es, consulte <a href="http://profiler.netbeans.org/docs/help/6.0/compare_snapshots.html">Comparando instant&acirc;neos de mem&oacute;ria</a>.</li>
                        <li><b>Gr&aacute;ficos de hierarquia.</b> Os resultados da cria&ccedil;&atilde;o de perfil podem ser exibidos em um gr&aacute;fico que classifica em que o tempo da CPU foi usado.  
                                                                                    &Eacute; poss&iacute;vel clicar nas se&ccedil;&otilde;es do gr&aacute;fico para percorrer desde as categorias de alto n&iacute;vel at&eacute; as informa&ccedil;&otilde;es de cria&ccedil;&atilde;o de perfil mais detalhadas. 
                                                                        Para obter mais informa&ccedil;&otilde;es, consulte <a href="http://profiler.netbeans.org/docs/help/6.0/live_results_categorization.html">&Aacute;reas de interesse - Regras de classifica&ccedil;&atilde;o</a></li>
                        <li><b>Heap Walker.</b> Agora, ao criar o perfil de seu aplicativo, voc&ecirc; pode usar o Heap Walker para ajudar a avaliar o conte&uacute;do de heap Java e a procurar vazamentos de mem&oacute;ria. 
                                                                        Para obter mais informa&ccedil;&otilde;es sobre o Heap Walker, consulte a <a href="http://profiler.netbeans.org/docs/help/6.0/heapwalker.html">documenta&ccedil;&atilde;o do Profiler 6.0 sobre o Heap Walker</a>.</li>
                        <li><b>Integra&ccedil;&atilde;o com o JMeter.</b> O suporte adicionado ao  JMeter permite iniciar scripts JMeter no come&ccedil;o de uma sess&atilde;o de cria&ccedil;&atilde;o de perfil, fornecendo uma maneira f&aacute;cil de realizar testes de carga, enquanto voc&ecirc; tra&ccedil;a o perfil. 
                                                                        Para obter mais informa&ccedil;&otilde;es, consulte <a href="https://netbeans.org/kb/archive/index.html">Suporte para gerador de carga</a>.</li>
                        <li><b>Conex&atilde;o din&acirc;mica no JDK 1.6.</b></li>
                    </ul>
                </td>
                <td align="right" valign="top">
                    <img src="../../../images_www/screenshots/6.0/profiler-pt_dialog.png" style="border:1px solid #333;" alt="caixa de di&aacute;logo Pontos de cria&ccedil;&atilde;o de perfil do profiler" width="350" height="284" >
                    <img src="../../../images_www/screenshots/6.0/profiler-heapwalker.png" style="border:1px solid #333;margin:10px 0;" alt="Heap Walker do profiler" width="350" height="242" >
                </td>
            </tr>
        </table>
        
        <h3>Web e Java EE</h3>
        <table border="0" cellspacing="5">
            <tbody>
                <tr>
                    <td valign="top">
                        <ul>
                            <li><b>Projeto visual embutido para aplica&ccedil;&otilde;es Web.</b> O modelo de projeto Visual Web agora est&aacute; mesclado no principal modelo principal de projeto de aplica&ccedil;&otilde;es Web.   Basta adicionar a estrutura Visual Web JavaServer Faces em seu projeto Web e potencializar uma ampla biblioteca de componentes JavaServer Faces habilitados para Ajax, para construir seu aplicativo.</li>
                            <li><b>Edi&ccedil;&atilde;o visual de fluxo de p&aacute;gina.</b> Vincular p&aacute;ginas em sua aplica&ccedil;&atilde;o Web nunca foi t&atilde;o f&aacute;cil, com os novos Visual Page Flow Editor, JavaServer Faces com suporte, JSP e p&aacute;ginas HTML.</li>
                            <li><b>Suporte melhorado para JavaScript.</b> Realce completo da sintaxe, recurso de autocompletar c&oacute;digo e verifica&ccedil;&atilde;o de erros de c&oacute;digos JavaScript est&atilde;o dispon&iacute;veis em arquivos JavaScript independentes e em arquivos HTML, RHTML e JSP.</li> 
                            <li><b>Suporte aprimorado para servi&ccedil;os Web.</b> Consumo de servi&ccedil;os Web com a op&ccedil;&atilde;o arrastar e soltar em p&aacute;ginas de aplicativo visual Web.   Servi&ccedil;os Web tranq&uuml;ilos est&atilde;o dispon&iacute;veis para envolver beans de entidade e fornecer funcionalidades CRUD f&aacute;ceis.   Melhor edi&ccedil;&atilde;o visual de servi&ccedil;os Web JAX-WS.   Suporte integral para seguran&ccedil;a, confiabilidade e transa&ccedil;&otilde;es de servi&ccedil;os Web.   Melhor interc&acirc;mbio de servi&ccedil;os Web.
                                                                                    Implanta&ccedil;&otilde;es em Sun Java System Application Server, GlassFish, Tomcat, JBoss 4.2.1 e JBossWS 2.0.1. </li>                    
                            <li>     <b>Suporte para componentes JavaServer Faces habilitados para Ajax.</b> A biblioteca de componentes <a href="https://woodstock.dev.java.net">Project Woodstock</a> encapsula Javascript e servidores complexos nos componentes JavaServer Faces.   Usar um componente habilitado para Ajax &eacute; como trabalhar com qualquer outro componente: arraste e solte, configure propriedades e personalize manipuladores de eventos no lado do servidor.</li>
                            <li><b>F&aacute;cil migra&ccedil;&atilde;o do Java Studio Creator.</b> Posicionado como o caminho de migra&ccedil;&atilde;o do Java Studio Creator 2, o NetBeans 6 preserva o investimento em projetos Java Studio Creator, enquanto permite potencializar os diversos recursos de produtividade do IDE NetBeans em uma &uacute;nica ferramenta.</li>
                            <li><b>Edi&ccedil;&atilde;o CSS aprimorada.</b> O Editor CSS permite visualizar altera&ccedil;&otilde;es em sua CSS &agrave; medida que forem feitas.</li>      
                    </ul>    </td>
                    <td align="center" valign="top">
                        <a href="../../../images_www/screenshots/6.0/web-projectlg.png" title="O desenvolvedor da Web Mauro Cioni migrou seu projeto para o IDE NetBeans 6.0. Clique para ampliar."><img src="../../../images_www/screenshots/6.0/web-projectsm.png" alt="O desenvolvedor da Web Mauro Cioni migrou seu projeto para o IDE NetBeans 6.0. Clique para ampliar"><br>Clique para ver o projeto do desenvolvedor da Web visual Mauro Cioni migrado para o IDE NetBeans 6.0.</a> <br> <br><br>
                        <a href="http://www.meteozoom.it" title="Site din&acirc;mico do desenvolvedor da Web Mauro Cioni."><img src="../../../images_www/screenshots/6.0/web-meteozoom.png" alt="Clique para visualizar o aplicativo din&acirc;mico."><br>Clique para ver o site din&acirc;mico do desenvolvedor da Web visual Mauro Cioni.</a>
                        
                    </td>
                </tr>
            </tbody>
        </table>
        
        <h3>Mobility</h3>
        <table border="0" cellspacing="5">
            <tbody>
                <tr>
                    <td valign="top">
                        <ul>
                            <li><b>Nova UI integrada para desenvolvimento de CLDC/MIDP e CDC.</b> Agora, o pacote de mobilidade oferece suporte &agrave;s propriedades de projeto antes dispon&iacute;veis somente para projetos de CLDC/MIDP. Isso inclui suporte &agrave; configura&ccedil;&atilde;o de projetos para a fragmenta&ccedil;&atilde;o de dispositivos, suporte ao obcurescimento e otimiza&ccedil;&atilde;o integrados e v&aacute;rias op&ccedil;&otilde;es de implanta&ccedil;&atilde;o, todas incorporadas no Apache Ant para facilitar a codifica&ccedil;&atilde;o e o gerenciamento. </li>
                            <li><b>Novo criador de jogos. </b>Agora &eacute; mais f&aacute;cil criar jogos m&oacute;veis com o suporte para edi&ccedil;&atilde;o visual do pacote de mobilidade da API de jogos MIDP 2.0.                                   A API oferece suporte a sprites animados e &agrave; capacidade de organizar camadas em mosaico nas cenas. </li>
                            <li><b>Novo Visual Mobile Designer.</b> O Visual Mobile Designer (VMD) foi projetado novamente para oferecer melhor funcionalidade e capacidade de utiliza&ccedil;&atilde;o. 
                            </li>
                            <li><b>An&aacute;lise de projeto.</b> A an&aacute;lise de projeto componentes n&atilde;o-utilizados para a remo&ccedil;&atilde;o de projetos visuais complexos.</li>
                            <li><b>Novos componentes personalizados.</b> Os novos componentes do Visual Mobile Designer simplificam a cria&ccedil;&atilde;o e o projeto de navegadores de arquivo m&oacute;veis, compositores de SMS (Short Message Service), telas de login e navegadores PIM (Personal Information Manager).</li>
                            <li><b>Novos componentes para controle de fluxo.</b></li>
                            <li><b>Agora &eacute; mais f&aacute;cil modificar c&oacute;digos gerados.</b></li>
                            <li> <b>Compilador de stub JSR-172 reescrito.</b> O novo gerador tem suporte para tipo Base64 e &eacute; capaz de analisar documenta&ccedil;&atilde;o de m&eacute;todos. </li>
                            <li><b>Gerenciamento de configura&ccedil;&atilde;o de projeto aperfei&ccedil;oado.</b> Uma nova UI para o Assistente de Projeto facilita adicionar novas configura&ccedil;&otilde;es de projeto para novos dispositivos m&oacute;veis. Agora &eacute; mais f&aacute;cil projetar v&aacute;rias cria&ccedil;&otilde;es para diversas configura&ccedil;&otilde;es. </li>
                        </ul>
                    </td>
                    <td align="center" valign="top">
                        <img src="../../../images_www/screenshots/6.0/visual-mobile-designer-small.png"><br><br>
                        <!--<p><img src="../../../images_www/screenshots/6.0/game-designer-small.png" width="330" height="265"></p>-->
                <img src="../../../images_www/screenshots/6.0/game-designer-small.png"></td></tr>
                
            </tbody>
        </table>
        
        <h3>Arquitetura orientada a servi&ccedil;os (SOA)</h3>
        <table border="0" cellspacing="5">
            <tbody>
                <tr>
                    <td valign="top">
                        <ul>
                            <li><b>Artefatos para composi&ccedil;&atilde;o e montagem de servi&ccedil;o.</b> O Composite Application Service Assembly Editor permite editar a configura&ccedil;&atilde;o de projetos corporativos. Ele oferece suporte &agrave; adi&ccedil;&atilde;o e/ou modifica&ccedil;&atilde;o de v&iacute;nculos e pontos finais de servi&ccedil;o, &agrave; adi&ccedil;&atilde;o/remo&ccedil;&atilde;o de conex&otilde;es entre unidades de servi&ccedil;o para conectar a pontos finais de unidades de servi&ccedil;o externas e &agrave; cria&ccedil;&atilde;o de conex&otilde;es de componente de v&iacute;nculo com componente de v&iacute;nculo.</li>
                            <li><b>Editor de WSDL gr&aacute;fico.</b> Cria documentos abstratos WSDL (WSDL sem v&iacute;nculos) de modo f&aacute;cil, juntamente com informa&ccedil;&otilde;es de tipo de link de parceiro.</li>
                            <li><b>Editor de XSLT para editar transforma&ccedil;&otilde;es.</b> Edita transforma&ccedil;&otilde;es visualmente.</li>
                            <li><b>Suporte de ferramentas para componentes de v&iacute;nculo.</b> Suporte para arquivo, HTTP e componentes de v&iacute;nculo JMS.</li>
                            <li><b>Suporte para projeto de servi&ccedil;os Web Java EE.</b> Um projeto Java EE que implementa interfaces de cliente ou servidor de servi&ccedil;os Web pode ser adicionado a um aplicativo composto, como uma unidade de servi&ccedil;o JBI.   O projeto Java EE pode comunicar-se diretamente com outras unidades de servi&ccedil;o usando o Normalized Message Router (NMR) JBI interno.</li>
                        </ul>
                    </td>
                    <td align="center" valign="top" nowrap><a href="../../../images_www/screenshots/6.0/soa-bpelproject.png" title="Use o BPEL Designer para projetar rapidamente um diagrama de processos comerciais e o NetBeans ir&aacute; gerar o c&oacute;digo-fonte compat&iacute;vel com WS-BPEL 2.0 correspondente. Engenharia de respostas completamente automatizadas entre as visualiza&ccedil;&otilde;es do diagrama e do c&oacute;digo-fonte.    Adicione e conecte links de parceiro visualmente ao projeto BPEL.    Clique para ampliar."><img src="../../../images_www/screenshots/6.0/soa-bpelproject-thumb.png" alt="Use o BPEL Designer para projetar rapidamente um diagrama de processos comerciais e o NetBeans ir&aacute; gerar o c&oacute;digo-fonte compat&iacute;vel com WS-BPEL 2.0 correspondente.    Engenharia de respostas completamente automatizadas entre as visualiza&ccedil;&otilde;es do diagrama e do c&oacute;digo-fonte. Adicione e conecte links de parceiro visualmente ao projeto BPEL. Clique para ampliar."></a>&nbsp;
                        <a href="../../../images_www/screenshots/6.0/soa-casaeditor.png" title="O editor Composite Application Service Assembly (CASA) permite aos usu&aacute;rios editar visualmente os aplicativos compostos e fornece suporte para a a&ccedil;&atilde;o arrastar e soltar ao adicionar v&iacute;nculos WSDL e unidades de servi&ccedil;o externas.   Clique para ampliar."><img src="../../../images_www/screenshots/6.0/soa-casaeditor-thumb.png" alt="&nbsp; O editor Composite Application Service Assembly (CASA) permite aos usu&aacute;rios editar visualmente os aplicativos compostos e fornece suporte para a a&ccedil;&atilde;o arrastar e soltar ao adicionar v&iacute;nculos WSDL e unidades de servi&ccedil;o externas. Clique para ampliar."></a><br>
                        <a href="../../../images_www/screenshots/6.0/soa-bpel-wsdl-casa.png" title="O IDE NetBeans fornece um rico conjunto de ferramentas para editar e configurar aplicativos compostos, incluindo o BPEL Designer, o WSDL Editor e o CASA Editor.   Clique para ampliar."><img src="../../../images_www/screenshots/6.0/soa-bpel-wsdl-casa-thumb.png" width="150" height="102" alt="O IDE NetBeans fornece um rico conjunto de ferramentas para editar e configurar aplicativos compostos, incluindo o BPEL Designer, o WSDL Editor e o CASA Editor."></a>
                    <a href="../../../images_www/screenshots/6.0/soa-wsdleditor.png" title="O projetista WSDL (Web Services Definition Language) permite que os usu&aacute;rios arrastem e soltem componentes WSDL no projetista WDL. Clique para ampliar."><img src="../../../images_www/screenshots/6.0/soa-wsdleditor-thumb.png" alt="O projetista WSDL (Web Services Definition Language) permite que os usu&aacute;rios arrastem e soltem componentes WSDL no projetista WDL. Clique para ampliar."></a></td>
                </tr>
            </tbody>
        </table>
        
        <h3>Linguagem de modelagem unificada (UML)</h3>
        <table border="0" cellspacing="5">
            <tbody>
                <tr>
                    <td valign="top">
                        <ul>
                            <li><b>A gera&ccedil;&atilde;o de c&oacute;digo baseada em modelos est&aacute; agora dispon&iacute;vel e pode ser personalizada. </b>Agora a UML oferece a gera&ccedil;&atilde;o de c&oacute;digo baseada em modelos na engenharia direta.O novo m&eacute;todo de gera&ccedil;&atilde;o de c&oacute;digo utiliza modelos FreeMarker, o que permite aos usu&aacute;rios personalizar o modo como os c&oacute;digos s&atilde;o gerados simplesmente modificando os modelos usados.Os usu&aacute;rios podem aprimorar a gera&ccedil;&atilde;o de c&oacute;digo adicionando novos modelos por meio do painel Modelos de dom&iacute;nio na janela Op&ccedil;&otilde;es de UML. </li>
                            <li><b>Recurso de gera&ccedil;&atilde;o de c&oacute;digo aprimorado.   </b> A capacidade de mesclar c&oacute;digos gerados recentemente em arquivos de c&oacute;digo-fonte j&aacute; existentes est&aacute; agora dispon&iacute;vel.</li>
                            <li><b>Melhor gerenciamento de cole&ccedil;&otilde;es.</b>&nbsp; Os tipos de cole&ccedil;&atilde;o do usu&aacute;rio s&atilde;o preservados durante a engenharia direta e reversa e podem ser configurados e alterados por meio da caixa de di&aacute;logo de propriedades da gera&ccedil;&atilde;o de c&oacute;digo.</li>
                            <li><b>As ferramentas de alinhamento est&atilde;o dispon&iacute;veis.</b> O Diagram Editor agora disp&otilde;e de ferramentas de alinhamento.      Selecione os elementos do diagrama a serem alinhados, clique com o bot&atilde;o direito do mouse na sele&ccedil;&atilde;o e selecione Alinhar no menu de pop-up.</li>
                            <li><b>Novo layout de janelas.</b> Por padr&atilde;o, a janela Documenta&ccedil;&atilde;o est&aacute; agora localizada na &aacute;rea da janela Propriedades.Agora a janela Centro de projetos est&aacute; localizada na &aacute;rea do Explorer por padr&atilde;o.</li>
                            <li><b>A a&ccedil;&atilde;o Salvar como est&aacute; agora no n&oacute; do diagrama.</b> A a&ccedil;&atilde;o &quot;Salvar como&quot; foi adicionada aos n&oacute;s do diagrama.   A a&ccedil;&atilde;o permite que um diagrama seja duplicado.</li>
                        </ul>
                    </td>
                    <td align="center" valign="top" nowrap>
                        <a href="../../../images_www/screenshots/6.0/uml-domain-template.png" title="No painel Modelos de dom&iacute;nio, clique para ampliar"><img src="../../../images_www/screenshots/6.0/uml-domain-template-thumb.png" alt="No painel Modelos de dom&iacute;nio, clique para ampliar" width="141" height="121" border="0"></a><br> 
                        <a href="../../../images_www/screenshots/6.0/uml-collection-parameter.png" title="Em Prefer&ecirc;ncias de cole&ccedil;&atilde;o, clique para ampliar"><img src="../../../images_www/screenshots/6.0/uml-collection-parameter-thumb.png" alt="Em Prefer&ecirc;ncias de cole&ccedil;&atilde;o, clique para ampliar" width="145" height="107" border="0"></a> <br>  
                        <a href="../../../images_www/screenshots/6.0/uml-alignment-menu.png" title="Nos menus Alinhamento e Distribui&ccedil;&atilde;o, clique para ampliar"><img src="../../../images_www/screenshots/6.0/uml-alignment-menu-thumb.png" alt="Nos menus Alinhamento e Distribui&ccedil;&atilde;o, clique para ampliar" width="238" border="0"></a>
                    </td> 
                </tr>    
            </tbody>
        </table>
        
        <h3>C/C++</h3>
        <table border="0" cellspacing="5">
            <tbody>
                <tr>
                    <td valign="top">
                        <ul>
                            <li><b>Melhor qualidade e desempenho na depura&ccedil;&atilde;o de gdb</b></li>
                            
                            <li>Novos recursos de aux&iacute;lio para c&oacute;digo
                                <ul>
                                    <li>A hierarquia de tipos, que permite inspecionar todos os subtipos ou supertipos de uma classe.</li>
                                    <li>A hierarquia de inclus&otilde;es, que permite inspecionar todos os arquivos de cabe&ccedil;alho e de c&oacute;digo-fonte que est&atilde;o direta ou indiretamente inclu&iacute;dos em um arquivo do c&oacute;digo-fonte ou todos os arquivos do c&oacute;digo-fonte e de cabe&ccedil;alho que incluem, direta ou indiretamente, um arquivo de cabe&ccedil;alho.</li>
                                    <li>O recursos de autocompletar c&oacute;digo para <tt>#includes</tt>
                                    <li>Troca entre o arquivo de c&oacute;digo-fonte e o arquivo de cabe&ccedil;alho com o mesmo nome e extens&atilde;o correspondente</li>
                                </ul>
                            </li>
                            <li><b>Depend&ecirc;ncia de projetos baseada em arquivo makefile</b></li>
                            <li><b>Suporte para Mac OS X</b></li>
                        </ul>
                    </td>
                    <td align="center" valign="top" nowrap>
                        <a href="../../../images_www/screenshots/6.0/cnd-GoToElement.png" title="Na caixa de di&aacute;logo Ir para fun&ccedil;&atilde;o ou vari&aacute;vel, clique para ampliar"><img
                                src="../../../images_www/screenshots/6.0/cnd-GoToElement-thumb.png" alt="Ir to Function or Variable Dialog, click to enlarge"
                                width="140"
                            height="92" border="0"></a>&nbsp;<a href="../../../images_www/screenshots/6.0/cnd-GoToType.png" title="Na caixa de di&aacute;logo Ir para tipo, clique para ampliar"><img
                                src="../../../images_www/screenshots/6.0/cnd-GoToType-thumb.png" alt="Ir to Type Dialog, click to enlarge"
                                width="140"
                            height="88" border="0"></a><br>
                        <a href="../../../images_www/screenshots/6.0/cnd-IncludesHierarchy.png" title="Em Hierarquia de inclus&otilde;es, clique para ampliar">
			<img src="../../../images_www/screenshots/6.0/cnd-IncludesHierarchy-thumb.png" alt="Inclus&otilde;es Hierarchy, click to enlarge"
                             width="140"
			     height="85"
			     border="0">
			</a>&nbsp;<a href="../../../images_www/screenshots/6.0/cnd-IncludesCompletion.png" title="No recurso Autocompletar c&oacute;digo de inclus&otilde;es, clique para ampliar">
			<img src="../../../images_www/screenshots/6.0/cnd-IncludesCompletion-thumb.png" alt="Inclus&otilde;es Code Completion, click to enlarge"
                                width="140"
				height="55" border="0">
			</a><br>
                        <a href="../../../images_www/screenshots/6.0/cnd-MacOSX.png" title="Suporte para Mac OS X, clique para ampliar">
				<img src="../../../images_www/screenshots/6.0/cnd-MacOSX-thumb.png" alt="Mac OS X Support, click to enlarge"
                                width="140"
				height="100"
				border="0">
			</a>
                    </td>
                </tr>    
            </tbody>
        </table>
        
        <h3>Aprimoramentos na API da plataforma NetBeans</h3>
        <table border="0" cellspacing="5">
            <tbody>
                <tr>
                    <td valign="top">
                        <ul>
                            <li><b>API Visual Library.</b> A API de Visual Library, que &eacute; a biblioteca gr&aacute;fica da pr&oacute;xima gera&ccedil;&atilde;o, &eacute; &uacute;til na visualiza&ccedil;&atilde;o de dados, como a modelagem orientada por gr&aacute;ficos, em m&oacute;dulos do NetBeans.   Para obter mais informa&ccedil;&otilde;es, assista a <a href="http://www.javalobby.org/eps/netbeans_visual_library/">demonstra&ccedil;&atilde;o</a> ou visite o endere&ccedil;o <a href="https://netbeans.org/projects/platform/">https://netbeans.org/projects/platform/</a>.</li>
                            <li><b>API NetBeans Preferences</b> A API de NetBeans Preferences fornece uma implementa&ccedil;&atilde;o espec&iacute;fica para o NetBeans da API de Preferences do JDK. Por exemplo, ela permite armazenar prefer&ecirc;ncias no diret&oacute;rio do usu&aacute;rio NetBeans.</li>
                            <li><b>Analisador l&eacute;xico.</b> A API de NetBeans aprimorada para a cria&ccedil;&atilde;o de tokens a partir de uma entrada textual.
                                                                                                Os tokens podem ent&atilde;o ser usados para, por exemplo, fornecer o realce de sintaxe. Para obter mais informa&ccedil;&otilde;es, consulte <a href="https://netbeans.org/projects/editor/">https://netbeans.org/projects/editor/</a>.</li>
                            <li><b>Logger.</b> API NetBeans ErrorManager ignorada em favor do mecanismo padr&atilde;o Logger do JDK. Para ver os detalhes, consulte <a href="https://netbeans.org/download/dev/javadoc/org-openide-util/org/openide/util/doc-files/logging.html">
                            Login no NetBeans</a>.</li>
                            <li><b>Interfaces gen&eacute;ricas.</b> As interfaces gen&eacute;ricas do JDK 1.5 s&atilde;o usadas em todas as APIs do NetBeans.</li>
                        </ul>
                        <p>Para obter mais detalhes, consulte a lista de 
                        <a href="https://netbeans.org/download/dev/javadoc/apichanges.html">altera&ccedil;&otilde;es de API do NetBeans</a>.</p>
                    </td>
                    <td align="center" valign="top">
                    <img src="../../../images_www/screenshots/6.0/jarvis.png" border="1" alt="painel de
                         framework em propriedades de projeto"> 
                </tr>
            </tbody>
        </table>
        
        
        <h3>E muito mais...</h3>
        
        <ul><li>Visite a p&aacute;gina <a href="http://wiki.netbeans.org/wiki/view/NewAndNoteWorthy">New &amp; Noteworthy do IDE NetBeans 6.0 </a>.
        </li></ul>
    </body>
</html>

