<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<HTML>
<HEAD>
<TITLE>NetBeans-projektiin osallistuminen</TITLE>
<META NAME="description" CONTENT="T&auml;ss&auml; on joitain tapoja, kuinka voit osallistua NetBeans-yhteis&ouml;&ouml;n.">
<link rel="stylesheet" type="text/css" HREF="../../netbeans.css">
<meta http-equiv="content-language" CONTENT="fi">
<META NAME="AUDIENCE" CONTENT="NBUSER">
<META NAME="TYPE" CONTENT="ARTICLE">
<META NAME="TOPIC" CONTENT="GENERAL">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" >
</HEAD>

<BODY>

<h1>Vaikuttaminen netbeans.org:ssa</h1>

<P>Kuten olet varmaankin tietoinen, NetBeans on <a href="../../about/os/">avoimen l&auml;hdekoodin projekti</a>.
T&auml;m&auml; tarkoittaa sit&auml;, ett&auml; NetBeans on p&auml;&auml;asiallisesti yhteis&ouml;n tekem&auml;, kun taas yhti&ouml;t tekev&auml;t
tuotteita kaupallisesti. T&auml;ll&auml; tarkoitetaan esimerkiksi sit&auml;, ett&auml; jos pystyt tarjoamaan tietoa, joka auttaa
toista henkil&ouml;&auml;, hy&ouml;dyt itsekin lopulta. Jos tieto koskee bugeja tai parannusehdotuksia, niin kaikki hy&ouml;tyv&auml;t
saamalla parempi ty&ouml;kaluja, kun korjaus- ja parannusehdotukset on toteutettu. Mit&auml; tulee NetBeanssiin, niin sin&auml; olet
kuljettajan paikalla - mik&auml;li ei olisi ihmisi&auml;, jotka k&auml;ytt&auml;isiv&auml;t t&auml;t&auml; tuotetta, t&auml;m&auml; kaikki olisi turhaa.

<P>T&auml;ss&auml; on joitain tapoja, kuinka voit osallistua NetBeans-yhteis&ouml;&ouml;n,
jotka palkitsevat omalla tavallaan:

<P>
<UL>
<Li><B>Osallistu postituslistoilla</B>
<BR>netbeans.org:ssa on useita <A href="../../community/lists/top.html">postituslistoja</A> sek&auml;
uutisryhmi&auml;, joissa ohjelmistoa k&auml;ytt&auml;v&auml;t ihmiset voivat hy&ouml;ty&auml; toistensa ammattitaidosta. Jotta niist&auml; olisi todella hy&ouml;ty&auml;, ne vaativat <I>sinun</I>
panostasi! &Auml;l&auml; pelk&auml;&auml; postittamista - auta muita kun voit, postita kysymyksi&auml;si, kommenttejasi sek&auml; ideoitasi sill&auml; tavalla
kuin parhaaksi n&auml;et.<P></LI>

<Li><B>Tee bugi-raportti</B>
<BR>Bugi-raportit ovat eritt&auml;in hy&ouml;dyllisi&auml; kehitt&auml;jille ja mahtava tapa osallistua projektiin!
Muista k&auml;ytt&auml;&auml; hiukan aikaa, kun olet <A HREF="../issues.html">ilmoittamassa bugista</A> - varmista, jotta
pystyt toistamaan virheen uudestaan ja ole eritt&auml;in tarkka kirjoittaessasi kuvausta.
<P></LI>

<LI><B>Tee parannusehdotus</B>
<BR>Jos haluat jotain lis&auml;&auml; IDEen tai pois IDEst&auml; tai sitten jotain, joka voisi parantaa IDE&auml; niin ilmoita meille!
Parannusehdotukset
tulisi <A HREF="../issues.html"> arkistoida asioiden seurantaj&auml;rjestelm&auml;&auml;n</A>,
samaan paikkaan, johon bugitkin ilmoitetaan.
<P></LI>

<LI><B>Vaikuta web-sivuston sis&auml;lt&ouml;&ouml;n</B>
<BR>Uusi sis&auml;lt&ouml; sek&auml; p&auml;ivitys olemassa olevaan sis&auml;lt&ouml;&ouml;n on aina tervetullutta! Artikkelit, kuten
FAQ- ja HOWTO-ohjeet ovat eritt&auml;in auttavia, kuten ovat my&ouml;s kuvakaappauksetkin. Seuraavia
linkkej&auml; seuraamalla saat lis&auml;&auml; tietoa :
<A HREF="../guidelines/www-guide.html">HTML:n l&auml;hett&auml;minen netbeans.orgiin</A>.
<P></LI>

<LI><B>K&auml;&auml;nn&ouml;kset, lokalisoinnit</B>
<BR>Oletko kiinnostunut web-sivuston sis&auml;ll&ouml;n lokalisoinnista tai IDEn lokalisoinnista omalle kielellesi?
Me arvostaisimme apuasi! Katso
<A HREF="localise.html">lokalisoinnin pikaopas</A> -sivulta lis&auml;&auml; tietoa.
<P></LI>



<LI><B>Editoi uutiskirjett&auml;, l&auml;het&auml; tarinoita versomaan</B>
<BR>Viikottainen <A HREF="../news/newsletter/index.html">NetBeans-uutiskirje</A>
on NetBeanssin parissa olevien vapaaehtoisten kasaama kirje - jos olet seuraamassa t&auml;m&auml;n hetkisi&auml;
tapahtumia postituslistalla, pystyisit toimittamaan uutiskirjeen! Kuukausittainen <A HREF="../news/newsletter/index.html">verso</A>-uutiskirje
etsii jatkuvasti tekij&ouml;it&auml; kirjoittamaan haastatteluja,
artikkeleita, partnerien valokeilassa olemisesta ... jos haluat l&auml;hett&auml;&auml; tarinan,
<A HREF="https://netbeans.org/about/contact_form.html?to=2">ota yhteytt&auml;</A>.
<P></LI>

<LI><B>Vaikuta koodiin</B>
<BR>Kuten edell&auml; mainittiin, NetBeans on avoimen l&auml;hdekoodin projekti - kaikki
l&auml;hdekoodit ovat saatavilla ja jos on olemassa ominaisuus, jonka haluaisit n&auml;hd&auml; tuotteessa tai bugi, jonka haluaisit
tulevan korjatuksi, sinulla on valta tehd&auml; se toteen. Katso lis&auml;tietoja
osastoilta <A HREF="patches.html">patchien l&auml;hett&auml;minen</A> ja
<A HREF="modules.html">moduulien l&auml;hett&auml;minen</A>.

<P></li>

<LI><B>Pysy valveilla</B>
<BR>L&ouml;ysitk&ouml; artikkelin, joka koskee NetBeanssia? L&auml;het&auml; meille linkki. Tied&auml;tk&ouml; moduulin, joka
toimii NetBeanssissa ja uskot sen kiinnostavan yhteis&ouml;&auml;? Ilmoita siit&auml; meille, jotta voimme listata sen moduulikatalogiin.
Tied&auml;tk&ouml; tapahtuman, johon NetBeanssin tulisi ottaa osaa? Voimme laittaa sen kalenteriimme.
Auta kasvattamaan ja kouluttamaan NetBeans-yhteis&ouml;&auml; jakamalla tiet&auml;myksesi!


<P></LI>

</UL>

</BODY>
</HTML>
