<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Cómo contribuir al Proyecto NetBeans</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" >
<meta name="description" content="How to make contributions to netbeans.org">
<link rel="stylesheet" type="text/css" HREF="../../netbeans.css">
<meta http-equiv="content-language" CONTENT="es">
</head>
<body>
 
<h1>Contribuir a netbeans.org</h1>

<p>Probablemente sepas que NetBeans es un <a href="../../about/os/">proyecto de código
  abierto</a>. Los proyectos de código abierto están dirigidos principalmente por la
  comunidad, aunque las compañías pueden crear productos comerciales a partir de esos
  proyectos. Los proyectos de código abierto animan a todos los miembros de la comunidad
  a colaborar con su conocimiento y experiencia y, consecuentemente, todo el mundo se
  beneficia. Por ejemplo, cuando la comunidad contribuye solicitudes de mejora o envía
  informes de errores, se implementan esas correcciones o mejoras para mejorar las
  herramientas, y todos se benefician. Puesto que NetBeans es código abierto, puedes
  influenciar lo que le sucede al IDE y la dirección del crecimiento futuro de NetBeans.</p>

<P>¡Contribuir código no es la única manera de ayuda a NetBeans! Lee nuestra lista más
  abajo para averiguar otras maneras en las que puedes ayudar a a la comunidad.</p>

<h2>Asistencia a la comunidad, promoci&oacute;n</h2>

<ul>
  <li><b>Participar en las listas de distribuci&oacute;n</b><br>

    Existen varias <a href="../../community/lists/top.html">listas de
    distribuci&oacute;n y grupos de noticias</a> en netbeans.org, donde los
    usuarios del software se benefician de la experiencia y del conocimiento
    mutuo. Para poder ser realmente eficaces, &iexcl;las listas necesitan
    <i>tu</i> aportaci&oacute;n! &iexcl;No tengas miedo de escribir - ayuda
    a otros cuando puedas!
    <p></p>
  </li>
  
  <li><b>&iexcl;Promociona NetBeans!</b><br>
    Si eres un usuario de NetBeans, &iexcl;dilo! Hay mucha competencia ah&iacute;
    fuera, y muchos desarrolladores no han oído hablar todavía de NetBeans, o aún
    peor, han escuchado acerca del IDE pero tienen una idea equivocada, o no han
    oído hablar de las recientes mejoras. Ayuda a difundir NetBeans - habla de los
    puntos fuertes, y debilidades, de NetBeans en blogs, listas de
    distribuci&oacute;n de la industria, revistas y foros. &iquest;Has encontrado
    (o escrito) un art&iacute;culo o revisi&oacute;n relacionada con NetBeans?
    <a href="../../about/contact_form.html?to=2">&iexcl;Nos
    encantar&iacute;a leerlo!</a></li>

</ul>

<p></p>

<h2>Envía contenidos y traducciones</h2>

<ul>
  <li><b>Contribuye al contenido del sitio web</b><br>
    &iquest;Has descubierto cómo resolver un caso de uso complejo?
    ¡<a href="http://wiki.netbeans.org/wiki/view/CommunityDocs">Los contenidos nuevos
    o actualizaciones siempre son bienvenidos</a>! Art&iacute;culos como
    las&nbsp;FAQs (PUF - Preguntas de Uso Frecuente) y los COMOs son muy
    &uacute;tiles, as&iacute; como capturas de pantalla y pel&iacute;culas Flash.
    Sigue estos enlaces para m&aacute;s informaci&oacute;n:
    <a href="web-content.html">Pautas para contribuir tutoriales</a>.
    Usa este <a href="https://netbeans.org/projects/www/downloads">espacio
    web gratuito para tus contribuciones en forma de demos</a>.
    <p></p>

  </li>
  <li><b>Traducciones y localizaciones</b><br>
    &iquest;Est&aacute;s interesado en colaborar en el esfuerzo de
    traducir el contenido del portal Web, o del propio IDE, en tu lengua materna?
    &iexcl;Nosotros y tus compa&ntilde;eros apreciaremos tu ayuda! Consulta
    la p&aacute;gina de <a href="localise.html">Comienzo r&aacute;pido
    para la localizaci&oacute;n</a> para m&aacute;s informaci&oacute;n. Algunos
    miembros de la comunidad han creado
    <a href="http://wiki.netbeans.org/wiki/view/FaqInternationalCommunity">foros
    en varios idiomas</a>, y ahora ayudan a otros a
    <a href="../../kb/articles/learn-java.html#3">iniciarse
    en Java</a> y NetBeans.
    <p></p>

  </li>
  <li><b>Edita el Bolet&iacute;n, env&iacute;a historias para The Edge
    (El L&iacute;mite)</b><br>
    El <a href="../news/newsletter/index.html">Bolet&iacute;n semanal de
    NetBeans</a> se hace por un grupo de voluntarios involucrados en
    NetBeans - &iexcl;si sigues los eventos actuales en la lista de
    distribuci&oacute;n entonces puedes editar un bolet&iacute;n! El
    bolet&iacute;n <a href="../news/newsletter/index.html">mensual Edge</a>

    est&aacute; siempre buscando autores que contribuyan escribiendo
    entrevistas, art&iacute;culos, presentaciones de socios... si quieres
    enviar una historia, por favor
    <a href="../../about/contact_form.html?to=2">ponte
    en contacto</a>. Adem&aacute;s, si te enteras de un evento o conferencia
    en tu zona donde se use NetBeans,
    <a href="../../about/contact_form.html?to=2">déjanos
    caer una nota</a> y nosotros lo anunciaremos en nuestro
    <a href="../news/calendar.html">calendario
    de eventos</a>.</li>
</ul>

<p></p>

<h2>Envía informes de errores, escribe c&oacute;digo</h2>

<ul>
  <li><b>Presenta un informe sobre un error/bug</b><br>
    Los informes de errores/bugs son muy &uacute;tiles para los
    programadores, &iexcl;y una gran manera de contribuir al proyecto!
    No olvides tomarte tu tiempo <a href="../issues.html">al presentar
    un informe de error/bug</a>, y aseg&uacute;rate de reproducir el
    problema con una descripci&oacute;n muy detallada.
    <p></p>

  </li>
  <li><b>Presenta una petici&oacute;n para una mejora</b><br>
    Si hay algo que quisieras ver en el IDE y no está, o se te ocurre
    algo que puede mejorarse, &iexcl;h&aacute;znoslo saber! Las peticiones
    de mejoras deben ser <a href="../issues.html">registradas en el
    sistema de seguimiento de asuntos</a>, de la misma forma que se
    efect&uacute;an los informes de los errores.
    <p></p>
  </li>
  <li><b>Contribuir c&oacute;digo y módulos plugin</b><br>

    Como hemos mencionado anteriormente, NetBeans es un proyecto de
    c&oacute;digo abierto - todo el c&oacute;digo fuente est&aacute;
    disponible, y si una característica que te gustaría ver implementada, o un error
    que te gustar&iacute;a ver resuelto, puedes hacerlo posible. Consulta las
    secciones sobre c&oacute;mo
    <a href="https://netbeans.org/kb/trails/platform.html">desarrollar módulos
    plugin</a>, <a href="patches.html">contribuir parches</a> y
    <a href="modules.html">contribuir m&oacute;dulos</a>. Publica tus módulos
    plugin en el <a href="http://plugins.netbeans.org/">Portal de Plugins</a>

    ¡y obtén comentarios de tus colegas miembros de la comunidad!
  </li>
</ul>

</body>
</html>
