<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
    <head>
        <link rel="stylesheet" type="text/css" href="https://netbeans.org/netbeans.css">
        <title>Contribuindo com o projeto NetBeans</title>
        <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" >
        <meta http-equiv="Content-Style-Type" content="text/css" >
        <link rel="shortcut icon" href="https://netbeans.org/favicon.ico" type="image/x-icon" >
        <META NAME="description" CONTENT="How to make contributions to netbeans.org">
        <link rel="stylesheet" type="text/css" HREF="../../netbeans.css">
        <meta name="keywords" content="java IDE, java editor, java Platform, free, open source, java development, j2ee support, development enviroment, web development, NetBeans, IDE, java" >
    </head>
    
    <body >
        <h1>Contribuindo para o netbeans.org</h1>
        
        <p>Como provavelmente voc&ecirc; est&aacute; ciente, o NetBeans &eacute; um 
        <a href="../../about/os/">projeto open source</a>. Isso significa que 
        quando as empresas fizerem produtos comerciais fora do que est&aacute; 
        aqui, ser&aacute; dirigido primeiramente &agrave; comunidade. O que isso significa &eacute; 
        que, por exemplo, se voc&ecirc; puder contribuir com conhecimento que ajude 
        alguma outra pessoa, voc&ecirc; acaba se beneficiando. Se forem relat&oacute;rios de 
        bugs ou pedidos de melhorias, todos beneficiam-se tendo melhores 
        ferramentas quando os reparos ou as melhorias s&atilde;o executados. 
        Essencialmente, quando voc&ecirc; vem ao NetBeans, voc&ecirc; est&aacute; no controle - 
        sem pessoas usando o software, n&atilde;o haveria raz&atilde;o para nada disto.
        
        <P>Aqui est&atilde;o algumas das maneiras que voc&ecirc; pode contribuir para a 
        comunidade NetBeans, obtenha suas pr&oacute;prias recompensas. H&aacute; muitas 
        maneiras ajudar o projeto sem realmente contribuir com c&oacute;digo!
        
        <p><h2>Suporte da comunidade, promo&ccedil;&atilde;o</h2>
        
        <ul>
            <li>
                <b>Participe das listas de e-mail</b>
                <br>Existem diversas 
                <a href="../../community/lists/top.html">listas de e-mail e grupos de not&iacute;cias</A> 
                no netbeans.org, onde as pessoas que usam o software podem se 
                beneficiar dos conhecimentos de cada um na comunidade. Para 
                realmente ser &uacute;til, as listas da comunidade precisam <i>de sua</i>
                participa&ccedil;&atilde;o! Por favor n&atilde;o tenha receio de posta - ajude os 
                outros quando voc&ecirc; puder!
            </li>
            
            
            
            <p><li><b>Promova o NetBeans!</b>
                <br>Se voc&ecirc; for um usu&aacute;rio do NetBeans, fale alto! Existe muita 
                competi&ccedil;&atilde;o fora daqui, e muitos desenvolvedores n&atilde;o tem ouvido 
                falar do NetBeans, ou pior, ouviram falar dele mas t&ecirc;m 
                concep&ccedil;&otilde;es erradas, ou n&atilde;o conhecem as melhorias recentes. Ajude
                a espalhar a palavra - fale sobre os pontos fortes e fracos do 
                NetBeans em blogs, em listas de e-mail, em revistas 
                especializadas e em f&oacute;runs de discuss&atilde;o. Voc&ecirc; encontrou, 
                escreveu ou fez a revis&atilde;o de algum artigo relacionado ao NetBeans? 
                <A HREF="https://netbeans.org/about/contact_form.html?to=2">N&oacute;s adorar&iacute;amos l&ecirc;-lo</a>!
            </li>
        </ul>
        
        <p><h2>Submeta conte&uacute;do, tradu&ccedil;&otilde;es</h2>
        <ul>
            <p><LI><B>Contribua com conte&uacute;do para o website</B>
                <BR>Voc&ecirc; acabou de descobrir como se resolve um caso de uso complicado? 
                
                <a href="http://wiki.netbeans.org/wiki/view/CommunityDocs">Novos 
                conte&uacute;dos ou atualiza&ccedil;&otilde;es do conte&uacute;do existente</a> s&atilde;o sempre 
                bem-vindas! Artigos como FAQs e HOWTOs s&atilde;o muito muito &uacute;teis, 
                assim como s&atilde;o as capturas de telas e filmes em Flash. Veja os 
                links a seguir para maiores informa&ccedil;&otilde;es:
                <A HREF="web-content.html">Guia para contribui&ccedil;&atilde;o com tutoriais</A>. 
                Use esse espa&ccedil;o livre 
                <a href="https://netbeans.org/projects/www/downloads">para demonstra&ccedil;&otilde;es de suas contribui&ccedil;&otilde;es</a>.
            </li>
            
            <p><LI><B>Tradu&ccedil;&otilde;es, localiza&ccedil;&otilde;es</B>
                <BR>Voc&ecirc; est&aacute; interessado em localizar o conte&uacute;do do web site, 
                ou mesmo da IDE, em sua lingua nativa? N&oacute;s e seus compatriotas 
                apreciaremos a sua ajuda! Veja a p&aacute;gina 
                <A HREF="localise.html">in&iacute;cio r&aacute;pido com localiza&ccedil;&atilde;o</A> para 
                maiores informa&ccedil;&otilde;es. Alguns membros da communidade j&aacute; criaram
                
                <a href="http://wiki.netbeans.org/wiki/view/FaqInternationalCommunity">f&oacute;runs
                em v&aacute;rias linguagens</a>, e agora ajudam os outros a
                <a href="https://netbeans.org/kb/articles/learn-java.html#3">iniciar no Java</a> 
                e no NetBeans.
            </li>
            
            <p><LI><B>Edite o boletim de not&iacute;cias, submeta hist&oacute;rias</B>
                <BR>O <A HREF="../news/newsletter/index_pt_BR.html">boletim de not&iacute;cias semanal do NetBeans</A>
                &eacute; feito por volunt&aacute;rios envolvidos com o NetBeans - se estiver
                por dentro dos &uacute;ltimos acontecimentos das listas de e-mail voc&ecirc; 
                pode editar o boletim de not&iacute;cias! O Boletim de not&iacute;cias  
                <A HREF="../news/newsletter/index_pt_BR.html">mensal "Edge"</A> est&aacute; 
                sempre procurando por autores que possam contribuir com uma 
                entrevista, um artigo, o brilhantismo de um colega... se voc&ecirc; 
                quiser submeter uma hist&oacute;ria, por favor, 
                <A HREF="https://netbeans.org/about/contact_form.html?to=2">entre em contato</A>.
                Tamb&eacute;m se voc&ecirc; souber de um evento ou confer&ecirc;ncia em sua &aacute;rea em 
                que o NetBeans &eacute; usado, 
                
                <A HREF="https://netbeans.org/about/contact_form.html?to=2">deixe-nos uma nota</a>
                e nos a publicaremos em nosso 
                <a href="https://netbeans.org/community/news/calendar.html">calend&aacute;rio de eventos</a>.
            </li>
        </ul>
        
        <p><h2>Submeta relat&oacute;rios de bug, escreva c&oacute;digo</h2>
        <ul>
            <p><Li><B>Preencha um relat&oacute;rio de bug</B>
                <BR>Relat&oacute;rios de bug s&atilde;o muito &uacute;teis para desenvolvedores, e 
                uma &oacute;tima maneira para contribuir com o projeto! Lembre-se de 
                gastar algum tempo
                <A HREF="../issues.html">preenchendo um relat&oacute;rio de bug</A> - 
                tenha certeza de que &eacute; possivel reproduzir o problema, e seja 
                bem expl&iacute;cito em sua descri&ccedil;&atilde;o.
                
            </li>
            
            <p><LI><B>Preencha um pedido de melhoria</B>
                <BR>Se existe alguma coisa que voc&ecirc; gostaria de ver na IDE e 
                ainda n&atilde;o existe, ou alguma coisa que imagina que pode ser 
                melhorada, diga-nos! Pedidos de melhorias devem ser 
                <A HREF="../issues.html">preenchidos no systema de rastreamento de issues</A>,
                o mesmo para os bugs.
            </li>
            
            <p><LI><B>Contribuindo com c&oacute;digo e m&oacute;dulos</B>
                <BR>Como mencionado acima, o NetBeans &eacute; um projeto de c&oacute;digo 
                livre - todo o c&oacute;digo est&aacute; dispon&iacute;vel, e se houver uma 
                caracter&iacute;stica que gostaria de ver, ou um bug que gostaria que 
                fosse corrigido, voc&ecirc; tem o poder de fazer que isso ocorra. 
                Voc&ecirc; pode aprender mais sobre 
                <a href="http://platform.netbeans.org/tutorials/">desenvolvimento de m&oacute;dulos</a>,
                <A HREF="patches.html">contribuindo com patches</A> e
                
                <A HREF="modules.html">contribuindo com m&oacute;dulos</A>.
                Poblique seus m&oacute;dulos no <a href="http://plugins.netbeans.org/">Portal de Plugins</a>
                e obtenha um feedback de outros membros da comunidade!
            </li>
        </ul>
        </body>
</html>